{"Caroline-College/!Intro-Caroline":{"title":"Welcome To Wisconsin","links":[],"tags":["TTRPG","Horror"],"content":"Two minutes till midnight in Wisconsin...\nThe chill of the evening clings to the air outside. You sit alone in your dorm room, staring at the clock radio resting atop your nightstand. The green digits on your wristwatch agree with the red digits on the clock; 11:58 PM – two minutes ‘til midnight. You pull your headphones off, set your Walkman on the desk, head over to your small bed and tune into the campus radio station on the cheap alarm clock. Light classical music can be heard fading out as the DJ talks about the next piece she&#039;s putting on the turntable.\n11:59 PM\nA minute later the radio crackles with static and an electrical buzz. Your small room is filled with an eerie hum that seems to vibrate through your very bones. You&#039;ve heard rumors of this happening before – a mysterious pirate radio station taking over the campus airwaves at precisely midnight. You&#039;ve tried to catch the show before but without success. Seems tonight you got lucky.\n&quot;Let there be METAL!&quot;\nThe sound of distorted guitars can be heard through the static. A disturbed metal tune, with a happy beat, begins to play.\nWhat have you found?\nAfter a few minutes the song ends and the host returns.\n&quot;Dave Is Back Babies! ‘Metal at Midnight’ is live and we’ve got all the music and news you need to survive this messed up little town. And speaking of news, we’ve got some real juicy nuggets for all you little pink faced freshmen joining our church of METAL for the first time. And believe me, its news that THEY do NOT want you to know.&quot;\nHe pauses only a moment to catch his breath.\n&quot;We’re going live tonight because I know some of you little metal headed sideshow freaks have got class in that torture chamber known as Sister Sarah’s. And believe me, they are trying super hard to keep this quiet. So Dave’s going all School House Rock tonight. Knowledge is power! And power is what they don’t want you to have.&quot;\nThe static hangs in the air as Dave goes quiet. Is that ... screams in the static? You lean in closer, your heart pounding in your chest as the static is broken by Dave&#039;s whispered voice.\n&quot;Yeah, that hospital’s all clean and bleachy fresh outside but in the back rooms … Oh brother, it’s Mike Myers meets that freaky little alien chest baby. Us vets know it. We&#039;ve heard the screams. We&#039;ve seen shadows moving all weird. We&#039;ve seen dumpsters getting collected late at night. Ain&#039;t no trashman working after midnight! Yeah, Sarah’s stinks alright so watch your back there. &quot;\nYou glance out your window, out across the campus, towards the hospital – or rather, what you can see of it through the dense trees. The lights seem too bright tonight, casting long, dancing shadows that seem to twist and writhe unnaturally. You swear you can hear the sound of a large truck operating.\n&quot;Worst yet, THEY know it’s there! And Dave’s got the cancelled checks to prove it; right where you’d expect. In that nasty, creepy museum all the norms pass every day on their way to class. Prairie Hall is just a 24/7, 365, all you can eat charnel house with a receptionist. But they do keep records there….&quot;\n&quot;Call Mr. King, I&#039;ve got a pitch for his next book!&quot;\nThe radio crackles again, and you swear you hear something else – a whispering beneath Dave&#039;s words, a dark alien presence pushing through the static. Music breaks through the small speaker again. For the next several hours metal music flows from the pirate station. Just before dawn the music stops and Dave cuts in again. You were dozing but the odd interference and the mad host&#039;s words stir you awake.\n&quot;Damn, they found me so it’s time to wrap. But before I bounce remember…&quot;\n&quot;We’ll fight on the land,&quot;\n&quot;We’ll fight in the fields and in the streets,&quot;\n&quot;We’ll fight in the hills,&quot;\n&quot;We’ll never surrender.&quot;\n&quot;Man, someone call in the metal MILITIA!&quot;\nThe radio begins blaring the last song of the show. The pirate station has cranked up the volume to an almost unbearable level as heavy power chords and frantic riffs cut through the airwaves. You jump back, heart racing. As the song plays you can hear the sound of equipment being thrown into boxes. Over the din, you think you can hear Dave singing along. After a few moments, the radio station fades back into quiet static, leaving you alone with your thoughts – and the chilling echoes of Dave&#039;s words. You barely notice when the campus radio comes back on the air. Looking back out the window you can see the start of the morning&#039;s false dawn.\nThe night DJ has been replaced by the morning show. Soft Americana music soothes the ringing in your ears as you listen to a sorrowful woman sing over an old guitar.\nIn shadows deep where whispers stir\nA pact is forged\nsilence unheard\nMy heart I give to the darkened sky\nTo save the fields\nto let hope fly\nOh hear my call\noh ancient dread\n\nWelcome to Wisconsin.\nWelcome to a world where truth hides behind conspiracy theories and history. A world where darkness lurks in the unlikeliest of places. A world where friend and foe are difficult to distinguish from one another.\nClass is in session and a new semester begins tonight. Are you ready to confront the truths hidden within the hallowed halls of Caroline College?"},"Caroline-College/01-Character-Creation/01-Characters-Caroline":{"title":"01-Setting Rules - Caroline College","links":["Caroline-College/02-Setting-Rules/01-Distress-Points-(DSP)"],"tags":["TTRPG","Horror"],"content":"House Rules for Caroline College - An Early 1980&#039;s Call of Cthulhu Campaign Setting\nThese house rules are designed to enhance your gaming experience by:\n\nIncreasing character survivability regarding sanity loss.\nProviding more development options for characters.\nKeeping starting character abilities aligned with their status as beginning college students.\nAdding more depth to characters through enriched backstories and mechanics.\n\n\nDisclaimer\nThis is a game of horror. Some themes may be disturbing to some players. Players are required to engage with the Session Zero to ensure that the game is appropriate for themselves, all players, and the keeper at the table.\n\nCharacter Creation\nDetermining Character Stats\nCap on Starting Skill Values\n\nNo starting skill can be above 60% after modifications.\n\nRolling and Distributing Characteristics\nFor Caroline College, we use a variant of Option 3: Choosing Where to Place Rolled Characteristics.\n\nRoll 6 × 4d4 and distribute the results across:\n\nStrength (STR)\nConstitution (CON)\nDexterity (DEX)\nAppearance (APP)\nPower (POW)\nLuck (LUCK)\n\n\nRoll 3 × (3d4+4) and distribute the results across:\n\nSize (SIZ)\nIntelligence (INT)\nEducation (EDU)\n\n\n\nNote on Skill Caps: To reflect the inexperience of college freshmen, the cap on starting skills is set at 60%. This ensures characters have room for noticeable growth throughout the campaign.\nRecommendation: Playing a character ⇐ 39 years old is thematically appropriate. But nothing is stopping you from making a feisty middle-ager or spunky retiree. Just work with the party  to explain why these generationally disparate people are spending so much time together.\nOccupation: College Student\nAll characters at Caroline College use the occupation College Student.\n\nOccupation Skill Points: EDU × 3 (Reduced from the standard to reflect starting students but with more opportunities for advancement during the campaign).\nCredit Rating: 5–10\nSuggested Contacts: Other students.\nSkills:\n\nLanguage (Own or Other)\nLibrary Use\nListen\nThree Fields of Study (choose three academic skills relevant to your character&#039;s studies)\nAny Two Other Skills as personal or era specialties\n\n\n\nBackstory Elements\nDeveloping a rich backstory adds depth to your character and enhances the gaming experience. Each character should create entries for the following areas, aiming for meaningful and engaging content. This is a horror game, so dark elements within a backstory is acceptable, thematically appropriate, and strongly encouraged (within the limits defined by Session Zero). Try to remember that your characters don&#039;t know what&#039;s happening in the setting yet; hints and suggestions go a long way!\nIdeology/Beliefs\n\nBad Example: &quot;I believe in justice.&quot;\n\nWhy it&#039;s bad: Too vague and generic; lacks depth.\n\n\nAcceptable Example: &quot;I believe that the legal system is flawed, and true justice can only be achieved outside of it.&quot;\n\nWhy it&#039;s acceptable: Adds complexity and hints at potential conflicts.\n\n\nGood Example: &quot;Ethan prowls the city&#039;s backstreets at night, where justice rarely reaches. When the courts failed him and the guilty walked free, he wasn&#039;t above bending the rules to set things right. To him, the law is just a guideline, and true justice sometimes requires a darker path that others might deem questionable.&quot;\n\nWhy it&#039;s good: Provides depth, aligns with game themes, and introduces moral ambiguity.\n\n\n\nSignificant People\n\nBad Example: &quot;My mother.&quot;\n\nWhy it&#039;s bad: Too general; doesn&#039;t explain significance.\n\n\nAcceptable Example: &quot;My mother, who supported my academic pursuits.&quot;\n\nWhy it&#039;s acceptable: Offers context but lacks depth.\n\n\nGood Example: &quot;Amelia carries a tattered letter from her estranged mother, filled with unsent words of apology. She reads it under dim lamplight, wondering about the life her mother chose over her family. Each word fuels Amelia&#039;s resolve to find her, not just to reconnect, but to understand the choices that led them apart.&quot;\n\nWhy it&#039;s good: Adds personal stakes, urgency, and ties to potential plot lines.\n\n\n\nMeaningful Locations\n\nBad Example: &quot;The park.&quot;\n\nWhy it&#039;s bad: Too vague; lacks meaningful context.\n\n\nAcceptable Example: &quot;The old park near my childhood home where I used to play.&quot;\n\nWhy it&#039;s acceptable: Provides some context but lacks depth.\n\n\nGood Example: &quot;The rusted remains of the old Ferris wheel loom over the deserted fairground, a place where Lucas once shared a fleeting moment of joy with his first love before she moved away without a word. He returns there, the silence heavy with memories and unanswered questions, hoping one day to recapture that lost connection or at least find closure.&quot;\n\nWhy it&#039;s good: Rich atmosphere, ties into supernatural elements, and profoundly impacts the character.\n\n\n\nTreasured Possessions\n\nBad Example: &quot;A book.&quot;\n\nWhy it&#039;s bad: Generic; doesn&#039;t reveal anything about the character.\n\n\nAcceptable Example: &quot;An old diary from my grandmother.&quot;\n\nWhy it&#039;s acceptable: Provides a familial connection but could be more detailed.\n\n\nGood Example: &quot;Lily discovered an old, leather-bound book hidden behind a loose brick in her grandmother&#039;s fireplace. The pages are filled with faded handwriting and strange symbols she doesn&#039;t understand. As she reads, unsettling family secrets begin to surface—stories of forgotten ancestors and choices that cast long shadows over her family&#039;s history, secrets they had tried desperately to keep buried. At least she knows she isn&#039;t alone in her bad choices.&quot;\n\nWhy it&#039;s good: Deeply personal, tied to game lore, and serves as a catalyst for adventures.\n\n\n\n\nBalancing Classes and Investigations\nClass Selection\nPlayers must balance academic responsibilities with their mystery-solving adventures.\n\nEach Semester, players must choose 5 classes.\n\nFreshman Fall Semester:\n\n3 Required Classes:\n\nOne Science\nOne History\nOne Language\n\n\n2 Optional Classes:\n\nChosen from the list of electives.\n\n\n\nPassing a Class\nTo pass a class, players must:\n\nPass the Final Exam:\n- Involves making an advancement roll in the relevant topic.\n\nLuck may be used on this roll.\n\n\nOptionally, Meet the Attendance Requirement:\n- Attend at least 70% of the class sessions (determined narratively).\n\nMeeting attendance grants a +5% bonus to the relevant skill (in addition to advancements from exams).\n\n\n\nExams\n\nMid-Term and Final Exams will be held each semester.\nPassing the Mid-Term:\n\nGrants a Penalty Die on the final exam advancement roll.\nNote: In advancement rolls, a failed roll results in skill improvement. Therefore, the Penalty Die increases your chance to fail the roll, which benefits your skill advancement.\n\n\nFailing a Class:\n\nIf you fail the final exam but met the attendance requirement, you still gain the +5% bonus.\n\n\n\nTension Mechanic\nPlayers must choose between attending classes or pursuing adventures, balancing academic success with their investigations.\n\nSkipping Classes may lead to:\n\nFalling grades.\nLoss of skill advancement opportunities.\nPotential narrative consequences.\n\n\nBenefits of Academic Success:\n\nAt the keeper&#039;s discretion, and at thematically appropriate times, academic achievements may grant benefits.\nExample: Passing all exams in a semester might unlock access to exclusive resources, faculty support, or special permissions.\n\n\n\n\nMechanics Adjustments\nSanity Loss Adjustments\n\nReading Mythos Tomes:\n\nCosts sanity but will not trigger bouts of madness or insanity if done in a safe environment.\n\n\n\nRecovery from Indefinite Insanity\nStudents at Caroline College have access to counseling sessions provided by the local Lutheran church. These sessions are non-religious and aim to aid students in recovering from indefinite insanity and trauma.\n\nWeekly Counseling Sessions:\n\nAvailability: Once per week when not participating in a game session.\nSanity Recovery Mechanics:\n\nRecovery Attempt:\n\nRoll percentile dice (1d100).\nOn a result of 01–95:\n\nSuccess: Recover 1d10 Sanity Points.\n\n\nOn a result of 96–100:\n\nSetback:\n\nLose 1d6 Sanity Points.\nGain a new phobia related to the stress or topics discussed during counseling.\n\n\n\n\n\n\nResolving Indefinite Insanity:\n\nIf Sanity Points are gained during a counseling session, you may immediately make a Sanity check (using your updated Sanity score).\nOn a Hard Success, your indefinite insanity is resolved.\n\n\n\n\nTime Commitment:\n\nAttending a counseling session requires an in-game time slot, potentially conflicting with classes or investigations.\n\n\nKeeper&#039;s Note:\n\nFrequent therapy sessions may draw attention or have narrative implications, adding to the tension of balancing time.\nFailed Therapy Sessions:\n\nMay induce phobias related to the therapy content, providing additional story hooks.\n\n\n\n\n\n\n\nLuck Recovery and Advancement\nLuck advancements are made at the start of every game session.\n\nLuck Recovery Mechanics:\n\nImprovement Check:\n\nRoll 1d100.\nIf the roll is above your current Luck, add 1d10 points.\nIf the roll is equal to or less than your current Luck, no points are recovered.\n\n\n\n\nNote:\n\nLuck may not exceed 99.\nThe starting Luck value is not used again in the game.\n\n\n\nSkill Advancements\nSkill advancements are made after thematically appropriate breaks, as determined by the keeper (expect 3–5 per semester, including exams).\nPvP Interactions and Loss of Control\n\nPlayer vs. Player (PvP) &#039;Attacks&#039;:\n\nMust be made with consent of all involved players.\n\n\nLoss of Control Situations:\n\nOccur when a character is under the effects of insanity, a Breakdown due to Distress, or certain supernatural influences.\nActions are at the keeper&#039;s discretion.\nThe keeper should consider player enjoyment and strive for consensual storytelling.\n\n\n\nBackstory Connections\n\nRobust and Thematically Appropriate Backstories:\n\nInclude one or more entries with a dark element.\nDevelop meaningful locations, significant people, and pivotal events that add depth.\n\n\nCharacter Connections:\n\nEvery character must have a connection to at least two other characters in the party in their backstory.\nNo character can have more than two connections to them.\n\n\n\nGroup Skill Checks\n\nAssisting with Skill Rolls:\n\nIf more than one character attempts a skill roll for the same task, under pressure:\n\nIf at least two characters have skill above baseline, one person can make the roll with a Bonus Die.\n\n\n\n\n\nSpending Luck\n\nLuck Points can be spent to alter the result of a skill or characteristic roll on a 1-for-1 basis.\nRestrictions:\n\nCannot spend Luck on:\n\nLuck rolls\nDamage rolls\nSanity rolls\nRolls to determine the amount of Sanity points lost\n\n\nCannot spend Luck on Pushed Rolls.\nCriticals, Fumbles, and Firearm Malfunctions cannot be altered with Luck.\nNo skill improvement check is earned if Luck was used to alter the roll.\n\n\n\n\nExpanded Sanity Rules\nThese OPTIONAL rules add psychological realism to the Sanity mechanics, fitting for modern or historical settings where characters may be hardy and accustomed to man-made horrors. Their inclusion will be discussed during Session Zero.\nSee 01-Distress Points (DSP)\n\nSession Zero Guidelines\nStarting Campaigns\nWe begin new campaigns with a Session Zero to:\n\nAlign expectations.\nDiscuss boundaries.\nEstablish the tone.\nIntegrate characters into the world.\n\nBackstories\n\nCharacters Should Not Start as Heroes:\n\nFocus on backstories that plant seeds for future adventures.\nAvoid having characters who have already achieved greatness.\n\n\n\nFitting the Tone\n\nEnsure your character fits the theme of the campaign (early 1980&#039;s horror sit in small town America).\n\nParty Dynamics\n\nCreate Characters That Fit the Party:\n\nDevelop strong connections with at least two other characters.\nCollaborate during character creation to ensure cohesion.\nCome to session zero with ideas, not characters.\n\n\n\nRespecting the Mood\n\nMaintain Immersion:\n\nAvoid breaking tension with out-of-place jokes, side talk, etc..\nEngage with the core themes agreed upon.\n\n\n\nRule of Cool\n\nStory Over Rules: We&#039;ll follow the Rule of Cool to prioritize narrative over strict rule adherence.\n\nImprovisation and Player Agency\n\nYour Actions Shape the Story:\n\nMajor events occur based on your decisions.\nCreativity is rewarded, even if payoffs aren&#039;t immediate.\nNot every encounter is balanced; sometimes avoiding conflict is wise.\n\n\n\nPlayer Preparation\n\nStay Engaged:\n\nBe attentive during sessions.\nReview notes between sessions.\nKeep your character curious and involved.\n\n\nSession Recaps:\n\nBefore each session, a player provides a recap of the previous session (group&#039;s choosing).\nIncentive:\n\nThe player who provides the recap gains a one-time Bonus Die for the session (unused bonus dice do not roll over).\n\n\n\n\n\nSafety Tools\n\nPlayer Comfort Is a Priority:\n\nSession Zero: Establish comfort levels and boundaries.\nLines &amp; Veils:\n\nLines: Hard limits not to be crossed.\nVeils: Topics that can occur but not be spotlighted.\n\n\nX Card:\n\nTap the X card to immediately stop and change uncomfortable content.\n\n\nConsent Flowers:\n\nGreen: Keep going.\nYellow: Proceed with caution.\nRed: Change the subject.\n\n\n\n\nExamples:\n\nA player indicating a yellow consent flower might prompt the keeper to adjust the scene&#039;s intensity without disrupting gameplay.\n\n\n\nThemes and Boundaries\n\nDiscuss Sensitive Topics:\n\nBe proactive in expressing preferences.\nCommon topics include violence, discrimination, sexuality, and personal phobias.\n\n\n\nConflict Resolution\n\nIn-Character Conflict:\n\nShould serve the narrative.\nAvoid actions that disrupt group dynamics.\n\n\nOut-of-Character Conflict:\n\nAddress issues respectfully among yourselves.\nThe keeper is a storyteller, not a mediator.\n\n\n\nRole-Playing\n\nImmerse Yourself:\n\nAct and speak as your character.\nAvoid phrases like &quot;My character does X.&quot;\n\n\n\nPlayer Respect\n\nTreat Each Other with Respect:\n\nRespect beliefs and views without imposing them.\nCreate a welcoming environment.\nAddress discomfort promptly and respectfully.\n\n\n\n\nCommon Topics to Discuss\nDuring Session Zero, we&#039;ll address the following possible story elements to ensure everyone&#039;s comfort:\n\nFrequently Lined Topics:\n\nSexualized violence\nChild abuse\nAnimal cruelty\n\n\nFrequently Veiled Topics:\n\nRacism\nDiscrimination against minorities\nSexuality\nTorture\nPhobias (spiders, snakes, clowns, dentists)\nSerious illnesses\nSexism\nSuicide\n\n\n\n\nBy adhering to these house rules and guidelines, we aim to create an engaging, immersive, and enjoyable gaming experience for everyone involved. Let&#039;s work together to weave a memorable story set in the mysterious world of Caroline College. By incorporating these elements, we aim to enrich the gameplay experience, providing ample opportunities for character development, fun, and immersive storytelling."},"Caroline-College/02-Setting-Rules/01-Distress-Points-(DSP)":{"title":"01-Optional Rules - Distress Points (DSP)","links":["tags/","Caroline-College/01-Character-Creation/01-Characters-Caroline"],"tags":["TTRPG","Horror",""],"content":"Optional Expanded Sanity Rules for Call of Cthulhu\nNote: These rules are optional and will be discussed during Session Zero. They are designed to enhance the horror experience in long-term campaigns without incapacitating characters through excessive Sanity loss.\nThese rules were heavily inspired by the work Apostol Apostolov at  Chaosium Call of Cthulhu 7th Edition House Rules\nFor details on making characters see 01-Characters-Caroline\nIntroduction\nThe Expanded Sanity Rules introduce a new mechanic called Distress Points (DSP) to add psychological depth and realism to our game. Like standard Sanity Points (SAN), which decrease as characters encounter supernatural horrors, Distress Points start at a maximum value and decrease as characters face stress from realistic, non-supernatural threats. This allows characters to handle man-made horrors and stressful situations without immediate risk of madness.\nDistress Points (DSP)\nWhat Are Distress Points?\n\nDistress Points represent your character&#039;s mental resilience to stress from non-supernatural situations, such as tough decisions, resource scarcity, or dangerous environments.\nEvery character starts with DSP equal to their POW (similar to how SAN is calculated).\n\nLosing Distress Points\n\nNon-Supernatural Encounters: Non-supernatural horrors cause DSP loss instead of SAN loss. This would replace the traditional sanity roll for these mundane encounters.\nStressful Situations: When facing non-horrific, but still stress situations, DSP checks may need to be made.\nSAN Rolls: Making a sanity roll, by definition, is caused by a situation that is stressful. You lose a a DSP every time a sanity roll is made; pass or fail.\nVoluntary SAN Damage: You can always choose to take SAN damage instead of losing DSP, but not the reverse.\n\nEffects of Distress Points\n\nAbove Half DSP (more than half of your maximum DSP): You remain composed; your hidden traits are under control.\nEqual to or Below Half DSP (half or less of your maximum DSP):\n\nBegin to show minor signs of stress linked to your Dark Trait.\nEach time you lose 5 or more DSP at once, roll against your current DSP. If you roll equal to or less than your DSP, you experience a Breakdown for 1d4 rounds.\n\n\nEqual to or Below One-Fifth DSP (one-fifth or less of your maximum DSP):\n\nYour behavior is noticeably affected by your Dark Trait.\nBreakdowns last longer (1d10 rounds), and the Keeper may suggest actions for your character.\n\n\nAt Zero DSP:\n\nYou suffer a Complete Breakdown.\nThe Keeper may take control of your character until DSP is recovered.\n\n\n\nMaximum DSP\n\nDSP cannot exceed your starting value (POW). Rest and recovery can help you regain lost DSP up to this maximum.\n\nExample of a Breakdown\nScenario:\nMaria, an investigator with a starting POW of 60, starts with DSP = 60. Her Dark Trait is Paranoia, which she keeps hidden from the rest of the team.\nEvents Leading to the Breakdown:\n\nInitial Stress:\n\nMaria and her team are exploring an abandoned asylum.\nShe encounters realistic but disturbing graffiti and unsettling noises.\nOver time, she loses 20 DSP, reducing her DSP to 40.\n\n\nDSP at Half Maximum:\n\nSince her DSP is now at 40 (which is two-thirds of 60), she remains composed.\n\n\nFurther Stress:\n\nThe team finds a room with detailed accounts of past tortures (non-supernatural).\nMaria loses 15 DSP due to the distressing content, bringing her DSP down to 25.\n\n\nDSP Falls to Half or Less:\n\nWith DSP at 25 (less than half of 60), she begins to show minor signs of her Dark Trait (Paranoia).\nShe starts questioning the intentions of her teammates subtly.\n\n\nTriggering a Breakdown:\n\nSuddenly, a realistic but horrific trap is sprung, causing Maria to lose 10 DSP at once, dropping her DSP to 15.\nBecause she lost 5 or more DSP at once and her DSP is below half, she must roll against her current DSP (15).\n\nShe rolls a 22, which is above her DSP.\nBreakdown Triggered: The Breakdown will last 1d4 rounds (let&#039;s say she rolls a 3).\n\n\n\n\n\nDuring the Breakdown:\n\nBehavior:\n\nFor the next 3 rounds, Maria&#039;s paranoia takes over.\nShe becomes convinced that one of her teammates is sabotaging the mission.\nShe might accuse them openly, refuse to share information, or even act defensively if approached.\n\n\nKeeper&#039;s Role:\n\nThe Keeper reminds Maria&#039;s player of her Dark Trait and suggests actions that reflect her heightened paranoia.\nThe player can choose how to role-play these suggestions within the confines of the Breakdown.\n\n\n\nAfter the Breakdown:\n\nMaria&#039;s DSP remains at 15.\nShe regains some composure but still shows signs of stress.\nThe team may notice her odd behavior, and she might need to find ways to recover DSP.\n\nDark Traits\nWhat Are Dark Traits?\n\nDark Traits are hidden aspects of your character&#039;s personality that emerge under stress.\nThey add depth to your character and provide role-playing opportunities.\n\nSelecting a Dark Trait\n\nChoose a Dark Trait during character creation. It should remain secret from other players but not the keeper.\nExamples include traits like paranoia, obsession, aggression, or compulsiveness.\nYour Dark Trait influences how your character behaves as DSP decreases.\n\nRevealing Dark Traits\n\nAs DSP decreases, subtle behaviors linked to your Dark Trait begin to surface.\nUnder severe stress or during Breakdowns, these traits may dominate your actions.\n\nManaging Distress\n\nRest and Relaxation:\n\nShort Rest: Resting for at least an hour in a safe, comfortable environment restores 1d10 DSP. This cannot be repeated until at least one point of DSP has been lost.\nExtended Rest: A full day of rest restores 10 DSP (may be repeated as needed).\n\n\nComposure Attempts:\n\nPOW Roll: Attempt a POW roll to compose yourself. If your current DSP is at or below half maximum, the roll is of Hard difficulty.\nSuccess: Restores 1d4 DSP during danger or 1d6+1 DSP when safe.\n\n\nAssistance from Allies:\n\nAnother character can use a Psychology roll to help you recover.\nSuccess has the same effects as a successful POW roll. These cannot be used in conjugation. But if one fails, the other may be attempted.\n\n\nIndulging in Manias:\n\nEngaging in a personal mania restores 1d6+1 DSP.\nRequires a Sanity roll; failure results in 1 SAN loss.\n\n\n\nPacing Stress Loss\n\nTo keep gameplay smooth, DSP losses can be accumulated over a scene and applied at the end.\nThis minimizes interruptions and maintains narrative flow.\nImmediate DSP losses may still occur during sudden shocks or critical moments.\n\nIncreased Impact of Phobias\n\nIf your character has a Phobia, encountering its trigger doubles any DSP losses.\n\nPurpose of These Rules\n\nEnhanced Role-Playing: Allows for deeper character development as hidden traits surface under stress.\nBalanced Horror Experience: Maintains the horror atmosphere without quickly incapacitating characters through massive Sanity loss.\nLong-Term Campaign Suitability: Ideal for extended play, where character arcs and psychological journeys are explored over time.\n\nConclusion\nPlease consider how these rules might enhance your gaming experience. They aim to add psychological realism and depth to our campaign, offering new challenges and role-playing opportunities without overwhelming your character with Sanity loss. We&#039;ll discuss these rules in detail during Session Zero to ensure everyone is comfortable and understands how they will be integrated into our game.\n\nList of 50 Example Dark Traits\nThe following are example dark traits; others are possible. Please discuss your choice with the keeper before finalizing your selection.\nDark Traits Table\n\n1. AGGRESSIVE: Physical action and violence are your solutions to every problem.\n\nUnder Distress: You display bouts of verbal aggression and may intimidate allies who challenge your decisions.\nBreakdown: You are unlikely to restrain yourself from combat until any perceived enemy is neutralized.\n\n\n2. MARTYR: You feel overwhelmed by responsibility for others.\n\nUnder Distress: You become less concerned with your own well-being and focus entirely on your allies&#039; needs.\nBreakdown: You&#039;re willing to sacrifice yourself for a greater goal or the survival of others.\n\n\n3. COWARD: Fear dominates your actions.\n\nUnder Distress: You become pessimistic and sarcastic, openly expecting the worst outcomes.\nBreakdown: You panic and flee, even if it means abandoning your friends in danger.\n\n\n4. EGOTIST: Your primary concern is your own well-being and survival.\n\nUnder Distress: Your decisions prioritize your needs over others.\nBreakdown: You place your safety above everything, even denying help or betraying allies.\n\n\n5. SADISTIC: You derive pleasure from others&#039; discomfort.\n\nUnder Distress: You may enjoy causing harm or misfortune to feel better.\nBreakdown: You pursue actions that cause maximum harm to enemies, even if it jeopardizes plans or allies.\n\n\n6. PARANOID: You believe others are constantly scheming against you.\n\nUnder Distress: You see coincidences as evidence of conspiracies.\nBreakdown: You&#039;re convinced immediate events are part of a grand plot and take drastic action to counter it.\n\n\n7. PSYCHOPATHIC: You disconnect from others&#039; emotions and needs.\n\nUnder Distress: You focus solely on your goals, unable to communicate intentions or feelings.\nBreakdown: You lose the ability to cooperate, resolving problems only on your own.\n\n\n8. ANNOYING: You have habits that irritate others, like excessive talking or fidgeting.\n\nUnder Distress: These habits intensify, helping you cope with uncertainty.\nBreakdown: You struggle to concentrate, taking extra time and lacking focus.\n\n\n9. DEPENDENT: You seem independent but rely on others when stressed.\n\nUnder Distress: You cling to others for guidance and protection.\nBreakdown: You&#039;re incapable of making decisions without someone telling you what to do.\n\n\n10. MEGALOMANIAC: You have an insatiable need for power and control.\n\nUnder Distress: Feeling weak causes you anxiety and frustration.\nBreakdown: You&#039;ll stop at nothing to gain power, even embracing dangerous paths.\n\n\n11. CURIOUS: Your thirst for knowledge overrides caution.\n\nUnder Distress: You can&#039;t resist uncovering secrets, even risky ones.\nBreakdown: You&#039;re compelled to experiment with newfound knowledge, often recklessly.\n\n\n12. FIXATED: You focus on repetitive activities to escape stress.\n\nUnder Distress: You feel compelled to continue these activities.\nBreakdown: You fixate on one activity as a source of comfort, resisting attempts to stop.\n\n\n13. LOUD: You express emotions vocally.\n\nUnder Distress: You can&#039;t keep your voice down and openly share your thoughts.\nBreakdown: You make a scene, yelling or ranting, potentially wasting valuable time.\n\n\n14. ZEALOUS: A strong belief or moral code anchors you.\n\nUnder Distress: You obsess over this belief and become anxious if it&#039;s challenged.\nBreakdown: You feel your belief is under attack and will defend it fiercely.\n\n\n15. CATATONIC: You withdraw inward to cope.\n\nUnder Distress: You find it hard to speak and may shut down.\nBreakdown: You halt actions, adopt a neutral posture, and become nearly mute, passively resisting interaction.\n\n\n16. BURDENED: You carry deeper troubles than most.\n\nUnder Distress: Your underlying issues surface, affecting your behavior.\nBreakdown: Combine behaviors from two traits, intensifying your reactions.\n\n\n17. COMPULSIVE LIAR: You habitually lie, even without cause.\n\nUnder Distress: Your lies become elaborate and hard to maintain.\nBreakdown: You create a false reality and insist others accept it.\n\n\n18. MANIPULATIVE: You influence others for personal gain.\n\nUnder Distress: You resort to deceit and exploitation.\nBreakdown: You may manipulate allies into dangerous situations for your benefit.\n\n\n19. OBSESSIVE: You fixate on thoughts or ideas.\n\nUnder Distress: Obsessions dominate your actions.\nBreakdown: You can&#039;t focus on anything else until satisfying your obsession.\n\n\n20. PESSIMISTIC: You expect the worst outcomes.\n\nUnder Distress: Your negativity affects group morale.\nBreakdown: You&#039;re immobilized by hopelessness.\n\n\n21. RECKLESS: You take unnecessary risks.\n\nUnder Distress: You disregard safety measures.\nBreakdown: You engage in dangerous actions without considering consequences.\n\n\n22. JEALOUS: You envy others&#039; successes or possessions.\n\nUnder Distress: You undermine or sabotage others.\nBreakdown: You attempt to take what others have by any means.\n\n\n23. DECEITFUL: Honesty isn&#039;t your policy.\n\nUnder Distress: You lie to protect yourself or gain an advantage.\nBreakdown: You can&#039;t tell the truth, even when necessary.\n\n\n24. ARROGANT: You believe you&#039;re superior.\n\nUnder Distress: You belittle others and ignore advice.\nBreakdown: Overconfidence leads you to make poor decisions.\n\n\n25. CONTROLLING: You need to be in charge.\n\nUnder Distress: You become domineering.\nBreakdown: You attempt to control every aspect, causing conflict.\n\n\n26. STUBBORN: You refuse to change your mind.\n\nUnder Distress: You reject others&#039; ideas.\nBreakdown: You insist on your way, regardless of consequences.\n\n\n27. IMPULSIVE: You act without thinking.\n\nUnder Distress: You make hasty decisions.\nBreakdown: You take immediate action without consideration.\n\n\n28. ENVIOUS: You desire what others have.\n\nUnder Distress: You fixate on others&#039; possessions or status.\nBreakdown: You might steal or sabotage to level the field.\n\n\n29. APATHETIC: You lack interest or concern.\n\nUnder Distress: You disengage from situations.\nBreakdown: You become unresponsive to events around you.\n\n\n30. NARCISSISTIC: You have an inflated sense of self-importance.\n\nUnder Distress: You demand special treatment.\nBreakdown: You believe only you can solve problems, dismissing others.\n\n\n31. MASOCHISTIC: You find satisfaction in your own discomfort.\n\nUnder Distress: You may self-sabotage or take unnecessary risks.\nBreakdown: You engage in self-destructive behaviors.\n\n\n32. UNTRUSTING: You doubt others&#039; intentions.\n\nUnder Distress: You suspect betrayal from those around you.\nBreakdown: You isolate yourself, refusing help.\n\n\n33. GLUTTONOUS: You overindulge in pleasures.\n\nUnder Distress: You seek immediate gratification, neglecting duties.\nBreakdown: You binge excessively, ignoring consequences.\n\n\n34. IRRATIONAL: You abandon logic and reason.\n\nUnder Distress: You make illogical decisions.\nBreakdown: You cannot be reasoned with, acting unpredictably.\n\n\n35. VINDICTIVE: You hold grudges and seek revenge.\n\nUnder Distress: You dwell on past slights.\nBreakdown: You focus solely on settling scores, regardless of cost.\n\n\n36. FRACTIOUS: You&#039;re irritable and prone to conflict.\n\nUnder Distress: You pick fights over minor issues.\nBreakdown: You become uncooperative and disruptive.\n\n\n37. OBSTINATE: You&#039;re unyielding and inflexible.\n\nUnder Distress: You resist any change or compromise.\nBreakdown: You become a barrier to progress and group harmony.\n\n\n38. SUPERSTITIOUS: You believe in omens and rituals.\n\nUnder Distress: You rely on superstitions to make decisions.\nBreakdown: You refuse to act without a &#039;sign&#039; or ritual.\n\n\n39. WORKAHOLIC: You&#039;re addicted to work.\n\nUnder Distress: You immerse yourself in tasks to avoid issues.\nBreakdown: You neglect health and relationships, focusing only on work.\n\n\n40. HYPOCHONDRIAC: You fear illness excessively.\n\nUnder Distress: You misinterpret symptoms as serious ailments.\nBreakdown: You believe you&#039;re critically ill, hindering your actions.\n\n\n41. RESENTFUL: You hold onto past wrongs.\n\nUnder Distress: You bring up old grievances.\nBreakdown: You act out against perceived offenders, even if unwarranted.\n\n\n42. INDECISIVE: You struggle to make choices.\n\nUnder Distress: You&#039;re paralyzed by options.\nBreakdown: You&#039;re incapable of deciding without external intervention.\n\n\n43. GUILT-RIDDEN: You&#039;re burdened by remorse.\n\nUnder Distress: You fixate on past mistakes.\nBreakdown: You may confess to wrongs, real or imagined, distracting from current issues.\n\n\n44. SCHADENFREUDE: You take pleasure in others&#039; misfortunes.\n\nUnder Distress: You may cause or amplify others&#039; failures.\nBreakdown: You actively create situations where others will fail.\n\n\n45. COMPULSIVE CLEANER: You need cleanliness and order.\n\nUnder Distress: You focus on tidiness over urgent matters.\nBreakdown: You stop everything to clean compulsively, ignoring pressing issues.\n\n\n46. ESCAPIST: You avoid reality through distractions.\n\nUnder Distress: You retreat into fantasy or indulgent activities.\nBreakdown: You detach completely from reality, becoming unresponsive.\n\n\n47. CONTROL FREAK: You micromanage every detail.\n\nUnder Distress: You can&#039;t delegate tasks, overwhelming yourself.\nBreakdown: You try to handle everything alone, leading to burnout.\n\n\n48. PROCRASTINATOR: You delay tasks habitually.\n\nUnder Distress: You avoid responsibilities, causing delays.\nBreakdown: You refuse to act, even when action is critical.\n\n\n49. PERFECTIONIST: Nothing meets your standards.\n\nUnder Distress: You obsess over minor flaws.\nBreakdown: You&#039;re immobilized by the impossibility of perfection.\n\n\n50. EMOTIONLESS: You suppress your feelings.\n\nUnder Distress: You become detached and indifferent.\nBreakdown: You can&#039;t empathize, making cold, calculated decisions without regard for others.\n\n\n"},"Caroline-College/02-Setting-Rules/02-Caroline-College-Freshman-Schedule":{"title":"02-Caroline College Freshman Schedule","links":[],"tags":["TTRPG","Horror"],"content":"House Rule: Balancing Classes and Investigations\nIn this campaign, players must balance academic responsibilities with their mystery-solving adventures. Attending class not only helps avoid failing grades but also provides in-game bonuses through skill improvements.\n\nClass Selection: Each player must choose 5 classes each semester.\n\nFreshman Fall Semester:\n\n3 required classes: One science, one history, and one language.\n2 optional classes: Chosen from the list of electives.\n\n\n\n\nPassing a Class:\n\nPass the final exam\nOptionally, meet the attendance requirement\n\nAttend at least 70% of the class sessions determined narratively\n\n\nPassing an exam involves making an advancement roll in the relative topic\n\nLuck may be used on this roll!\n\n\nTwo exams will be held during the semester: a mid-term and a final\n\nMaking the mid-term advancement will grant a &#039;penalty&#039; die on the final\n\nAs you want to &#039;fail&#039; an advancement roll, the penalty die is a benefit\n\n\n\n\nMeeting the attendance requirement grants a +5% to the relative skill. This is in addition to the advancements made from the mid-term and final.\n\nMeeting the attendance requirement, but failing a class, will still grant the bonus (you at least learned something by showing up).\n\n\n\n\nTension Mechanic: Players must choose between attending classes or pursuing adventures, balancing academic success with their investigations.\n\n\nClass Descriptions and Schedule\nRequired Science Classes (Both lecture and lab must be attended)\n\nIntro to Biology\n\nDescription: Basic biological concepts with a focus on cellular structures, genetics, and ecology. The lab allows hands-on experience, where strange things might start to happen.\n\n\nChemistry 201\n\nPrerequisite: Chemistry 101, College Math or greater, or permission from the department chair\nDescription: Analyzing chemical bonding using atomic theory, stoichiometric methodologies, interpreting graphical chemical data and an introduction quantum mechanics. You never know when knowledge of chemical substances might help solve an occult mystery.\n\n\nTechnical Physics I\n\nPrerequisite: Calculus I, or permission from the department chair\nDescription: Calculus based introduction to physics. Topics include elementary forces, work and optics.\n\n\n\nRequired History Classes (Choose 1)\n\nWestern Civilization I\n\nDescription: A comprehensive study of Western history, covering ancient civilizations through the Renaissance, with key insights into the origins of arcane practices.\n\n\nHistory of the United States until 1855\n\nDescription: An exploration of U.S. history from colonization to modern times. Local Wisconsin history becomes relevant to uncovering the hidden past of Watashuka.\n\n\n\nRequired Language Classes (Choose 1)\n\nEnglish Composition I\n\nDescription: Focuses on writing and analysis\nSecret Game Hooks and Ideas: critical for understanding written clues and keeping track of findings in investigations.\n\n\nIntroductory Latin\n\nDescription: Introduction to Latin\nSecrete Game Hooks and Ideas: essential for translating ancient texts or deciphering old manuscripts related to the occult.\n\n\nFrench I\n\nDescription: Basics of French language\nSecrete Game Hooks and Ideas: essential for translating ancient texts or deciphering old manuscripts related to the occult, helpful for interacting with international documents or individuals related to the mystery.\n\n\n\n\nOptional Classes (Choose 2)\n\nIntroduction to Public Speaking\n\nDescription: This course teaches students the basics of effective verbal communication, focusing on persuasive speaking techniques, managing audience perception, and developing confidence in public speaking. Students will engage in debates, presentations, and impromptu speeches.\n\n\nFoundations of Gymnastics\n\nDescription: An introduction to physical conditioning, agility, and body mechanics. The course covers basic skills in climbing, jumping, running, and balance through physical training and exercises. Designed for students looking to enhance their physical prowess.\n\n\nIntro to Parapsychology: An Introduction to the Weird\n\nDescription: This course explores the fringes of scientific inquiry, delving into phenomena such as telepathy, clairvoyance, psychokinesis, and hauntings. Students will examine case studies, historical research, and conduct their own experiments to understand the possible connections between the mind and supernatural occurrences. Expect things to get weird.\n\n\nIntroduction to Computing\n\nDescription: Students will learn the fundamentals of computing, including basic programming, data entry, and information processing. The course emphasizes practical computer applications in various fields.\n\n\nActing for Beginners\n\nDescription: This course focuses on the foundations of acting, including role-playing, physicality, and emotional expression. Students will learn how to embody different characters, effectively altering their appearance and persona through performance techniques.\n\n\nBasic Electronics\n\nDescription: An introductory course covering basic principles of electricity, circuits, and electronic components. Students will engage in hands-on projects to understand the fundamentals of building and repairing electronic systems.\n\n\nMarketing 101: Principles of Market Influence\n\nDescription: This introductory course covers the fundamental concepts of marketing, including market research, consumer behavior, advertising strategies, and product positioning. Students will learn how to craft persuasive messages and develop marketing plans, with a focus on influencing consumer decision-making in various industries.\n\n\nBasic First Aid and CPR\n\nDescription: Students will learn essential first aid techniques, including CPR, wound treatment, and emergency response. The course is hands-on and prepares students for basic medical emergencies in everyday situations.\n\n\nIntroduction to Legal Studies\n\nDescription: This course introduces the foundational concepts of law, including constitutional law, criminal justice, and civil procedures. Students will explore real-world case studies and participate in mock trials.\n\n\nInformation Research and Literacy\n\nDescription: This course teaches students how to efficiently locate, evaluate, and use information from various sources, including libraries, archives, and digital databases. Emphasis is placed on research strategies and citation techniques.\n\n\nIntroduction to Mechanics\n\nDescription: This hands-on course introduces students to the fundamentals of mechanical systems, focusing on repairing and maintaining machines, vehicles, and industrial equipment. Students will work in a lab setting, learning to use tools and heavy machinery.\n\n\nIntroduction to Medical Science\n\nDescription: Designed for pre-med students, this course introduces the basics of human anatomy, pathology, and medical ethics. Students will explore medical case studies and observe hospital procedures.\n\n\nEcology and Environmental Studies 101\n\nDescription: This course explores ecosystems, biodiversity, and environmental conservation. Students will learn about the interconnections between species and their environments through fieldwork and lab exercises.\n\n\nOrienteering 101\n\nDescription: A practical course in map reading, compass use, and wilderness navigation. Students will engage in field activities, learning how to navigate different terrains and track wildlife.\n\n\nIntroduction to Psychoanalytic Theory\n\nDescription: This course introduces the basic principles of psychoanalytic theory, including concepts such as the unconscious, repression, and dream interpretation. Students will examine foundational case studies from Freud and Jung.\n\n\nForensic Science 101\n\nDescription: Students will learn basic forensic techniques, focusing on crime scene investigation and evidence gathering. Emphasis is placed on attention to detail and spotting hidden clues during investigations.\n\n\nWilderness Survival Techniques\n\nDescription: This course teaches the fundamentals of wilderness survival, including shelter building, fire-making, and finding food and water in the wild. Students will participate in hands-on field exercises.\n\n\nSwimming for Lifelong Health\n\nDescription: Students will learn swimming techniques, water safety, and endurance training. This course is ideal for beginners or those looking to improve their swimming skills.\n\n\nIntroduction to Anthropology\n\nDescription: This course explores human cultures, ancient practices, and the development of civilizations. A particular focus is placed on the cultural practices of indigenous groups, such as the Ho-Chunk Nation, providing key insights into their sacred sites and traditions.\n\n\nIntroduction to Psychology\n\nDescription: This course studies the human mind and behavior, including key psychological theories on cognition, perception, and social behavior. It is particularly useful for understanding the motivations of NPCs and evaluating mental health or sanity during investigations.\n\n\nPublic Speaking\n\nDescription: This course provides instruction on developing persuasive speaking skills, helping students gain confidence in communication. It covers techniques for influencing and convincing others, skills that are useful during interactions with NPCs and negotiations.\n\n\nIntroduction to Philosophy\n\nDescription: A deep dive into metaphysical questions and esoteric thought, this course examines classical and modern philosophical theories. Special attention is given to occult philosophies and ancient belief systems, making it ideal for players interested in occult knowledge.\n\n\nIntroduction to Theater\n\nDescription: This course introduces students to improvisation, performance, and role-playing. Students will learn how to quickly adapt their personas and use verbal techniques to deceive or convince others, perfect for moments when quick thinking and fast talk are essential.\n\n\nDrawing and Painting I\n\nDescription: This studio-based course teaches the basics of drawing and painting techniques. Students will develop their skills in artistic expression, which can be used for sketching clues, analyzing artworks, or interpreting occult symbols found during investigations.\n\n\nIntroduction to Music Appreciation: From Cavemen to Chopin\n\nDescription: A broad survey of music history, from ancient rhythmic traditions to classical compositions. This course hones students’ listening skills, making them more attuned to subtle auditory cues, which are often crucial during investigations where sound plays a role.\n\n\nCollege Math\n\nDescription: This course covers essential mathematical principles such as algebra, trigonometry, and basic calculus concepts. It serves as a foundation for students pursuing science, engineering, or economics, offering problem-solving techniques applicable to various fields.\n\n\nCalculus I\n\nDescription: An introduction to differential and integral calculus, focusing on limits, derivatives, and applications of the derivative in real-world contexts. This course is required for students pursuing technical fields such as physics, engineering, and economics.\n\n\n\nClass Schedule\n"},"Caroline-College/03-Caroline-College/01-Campus-Directory":{"title":"01-Caroline College Campus Directory","links":[],"tags":["TTRPG","Horror"],"content":"Caroline College: Campus Directory\n\n\nPrairie Hall\n\nBuilt: 1856\nDescription: The oldest structure on campus, Prairie Hall was the first building constructed for the original Prairieville School. Now a historic museum, it houses artifacts from early Wisconsin life and stands as a testament to the school’s origins in education. The building sits atop an elaborate basement which houses most of the artifacts.\n\n\nFounder&#039;s Hall\n\nBuilt: 1862, relocated 1945\nDescription: Founder&#039;s Hall, originally constructed after the rebuilding of the Prairieville School in 1862, now serves as the college&#039;s alumni center. It was relocated in 1945 to make way for campus land expansion and construction.\n\n\nMorgan Lafayette Liberal Arts Center\n\nBuilt: 1950\nDescription: A bustling center for liberal arts, the Lafayette Center encourages interdisciplinary collaboration and intellectual discourse. Its modernist architecture was funded through significant post-war grants, supporting the growth of liberal education.\n\n\nDuff Business Center of Excellence\n\nBuilt: 1949\nStudent Nickname: DBC\nDescription: The Duff Business Center is home to the esteemed business program, offering real-world opportunities for students through partnerships with local industries. Its growth was fueled by post-WWII funding aimed at developing future leaders in business.\n\n\nRite Hall\n\nBuilt: 1875\nStudent Nickname: Admin\nDescription: Serving as the administrative core of Caroline College, Rite Hall houses student services, faculty offices, and administrative departments. This stately building has long been the backdrop for important college events and student support services.\n\n\nBrown Science Complex\n\nBuilt: 1945-1954\nStudent Nickname: The Dungeon\nDescription: The Brown Science Complex consists of interconnected buildings dedicated to advancing scientific inquiry. The complex was developed with government support to enhance STEM education post-WWII.\nBuildings Include:\n\nCastelaz Building and Observatory (physical sciences): the crown jewel of the Brown complex, the observatory houses a stunning 30-inch refractor telescope, the Wright Telescope; one of the largest student-operated telescopes in the Midwest.\nGardner Mathematics Hall (mathematics and parapsychology):  Gardner Hall is a  striking example of modern architectural prowess that houses a thriving mathematics department. At the heart of Gardner Mathematics Hall lies the Great Hall, a breathtaking three-story atrium with soaring ceilings and intricate glasswork that bathe the space in natural light. Here, students gather to collaborate on complex problems, attend guest lectures, and engage in spirited debates – all within an atmosphere of intellectual rigor and camaraderie.\nLuttermoser Science Hall (biological and chemical sciences): The centerpiece of Luttermoser Science Hall is the Atrium of Discovery, a vast open-plan space that encourages interdisciplinary collaboration and exchange among faculty and students. Here, you&#039;ll find interactive exhibits, artwork inspired by scientific concepts, and even a living wall of plants.\nThe Obelisk of Nekhbet (monument): On permanent loan from Cairo University. Installed in 1954, the Obelisk stands as a symbol of the college’s commitment to global cultural awareness and intellectual exchange.\n\n\n\n\nScarlet Center for Women’s Studies\n\nBuilt: 1970\nDescription: A focal point for research and study of gender studies, law, forensic science and social justice issues, the Scarlet Center is a progressive space dedicated to intellectual exploration. Its development was part of a post-war expansion to support diverse academic programs.\n\n\nAdda F. Howie Center for Agricultural Theory\n\nBuilt: 1958\nDescription: Named after a trailblazing figure in agricultural science, the Howie Center connects theoretical agricultural studies with practical applications. The center’s programs have been instrumental in modernizing regional agricultural practices.\n\n\nC.D. Levi Agriculture Science Complex\n\nBuilt: 1901\nStudent Nickname: The Farm\nDescription: Known for its extensive greenhouses and experimental farms, &quot;The Farm&quot; provides hands-on experience in agriculture. The complex’s expansion after WWII reflects the nation’s emphasis on sustainability and food security.\n\n\nLantern Memorial Park, Reflecting Pool, and Cemetery\n\nEstablished: 1939\nStudent Nickname: The Swinging Tree\nDescription: A serene spot for reflection, Lantern Memorial Park commemorates the life of visiting artist Elijah Kane. It offers a peaceful place for students to gather, surrounded by nature and tranquility.\n\n\nPrairie Dog Stadium\n\nBuilt: 1914\nDescription: Home to the Prairie Dogs baseball team, this stadium fosters community spirit and competition. The facility is also used for various campus events, including intramural sports and large gatherings.\n\n\nThe Burrow\n\nBuilt: 1968\nStudent Nickname: Student Center\nDescription: As the social hub of campus, The Burrow provides spaces for student organizations, recreational activities, and events. This lively center encourages students to engage with their peers and build lasting friendships.\n\n\nHo-Chunk Cultural Heritage Museum\n\nBuilt: 1955\nStudent Nickname: HCC\nDescription: The HCC museum showcases the rich history and cultural contributions of Wisconsin&#039;s Ho-Chunk Nation. It serves as an educational space where students and visitors can learn about indigenous heritage.\n\n\nS. Fields Building\n\nBuilt: 1885\nStudent Nickname: SFB\nDescription: This building houses the departments of anthropology and sociology. It offers students the opportunity to explore societal structures and human behavior through comprehensive research programs.\n\n\nPhilip Love Aquatic Center\n\nBuilt: 1975\nStudent Nickname: The Pool\nDescription: The newest facility on campus, the Philip Love Aquatic Center boasts both indoor and outdoor pools, offering opportunities for recreational swimming, water sports, and scuba certification.\n\n\nRutherford-Walsh Mann Track and Sport Field\n\nBuilt: 1901\nDescription: A key athletic facility, this complex supports track and field events, intramural sports, and physical education classes. Its construction reflected the post-war emphasis on physical fitness and community well-being.\n\n\nMcElhenney Journalism School and Communications Center\n\nBuilt: 1955\nDescription: A center for media and communications studies, McElhenney School trains students in modern journalism practices. The school’s graduates have gone on to work in national media outlets, reflecting its reputation for excellence.\n\n\nBowstein Center of Philosophy and Religious Research\n\nBuilt: 1869\nDescription: The Bowstein Center engages students with global philosophical and religious traditions. The center’s vast library and connections with international scholars make it a vibrant hub for intellectual exchange.\n\n\nGale Veterinary Hospital and Training School\n\nBuilt: 1957\nDescription: This hospital specializes in the treatment of large animals, providing students with hands-on veterinary training. It serves both the campus and the surrounding agricultural community.\n\n\nResearch Greenhouses (Plant Science Research)\n\nBuilt: 1953\nDescription: The Research Greenhouses offer state-of-the-art facilities for plant science and agriculture. Students here work on projects related to sustainability, conservation, and crop development.\n\n\n**West Maintenance Building\n\nBuilt: 1946\nStudent Nickname: The Dump\nDescription: Housing the campus facilities management team, this building ensures the maintenance and smooth operation of the entire campus, from heating systems to grounds keeping. A few industrial arts courses are even taught here. The students who choose to engage are given the opportunity to learn and help their school!\n\n\nCampus Security Station\n\nBuilt: 1888\nStudent Nickname: The Jail\nDescription: The security station monitors the campus 24/7, offering students and staff a sense of safety and peace of mind. Its modern surveillance systems keep the campus secure.\n\n\nFonseca Power Systems Research Facilities\n\nBuilt: 1960\nStudent Nickname: The Nightlight\nDescription: This engineering research facility provides students with unparalleled opportunities in civil, electrical, and mechanical engineering. Its advanced labs and technology help foster the next generation of engineers.\n\n\nDon Peachy Center for the Performing Arts\n\nBuilt: 1956\nDescription: A vibrant space for theater and music, the Don Peachy Center is home to numerous student performances and cultural events. Its folk and ethnic music programs are renowned in the region.\n\n\nFine Arts Building\n\nBuilt: 1899\nStudent Nickname: The Fab\nDescription: The Fine Arts Building, constructed in 1899, stands as one of the oldest structures on campus, housing studios, galleries, and classrooms for the college’s art programs. Originally named after a prominent local patron, its title was quietly changed in 1923 following a scandal that has since been buried, leaving it now known simply as the Fine Arts Building.\n\n\nJ. Sawyer Amphitheater\n\nBuilt: 1937\nStudent Nickname: The Pit\nDescription: This expansive outdoor venue hosts concerts, guest speakers, and campus-wide events. Its open-air design provides a picturesque setting for graduation ceremonies.\n\n\nPrairie Academy Teacher Training Center\n\nBuilt: 1965\nStudent Nickname: The Academy\nDescription: The Academy is a center for teacher training, returning the college to its roots. The facility is also home to the E. Rowe School for the Gifted, providing specialized education for exceptional students.\n\n\nSterling Men’s Dormitory and E. Root Women’s Dormitory\n\nBuilt: 1950\nDescription: These dormitories provide comfortable housing for students from all corners of the country. Their location in the heart of campus ensures students are close to academic and social life.\n\n\nDennis W. Dark Ecology Research Center\n\nBuilt: 1961\nDescription: This research station offers students the opportunity to study the region’s native ecology, with advanced technology for weather tracking and ecological research. Advanced ecology and environmental laboratory work is performed here.\n\n\nAnnex Buildings\n\nBuilt: 1863\nStudent Nickname: The Attics\nDescription: Originally constructed to house soldiers during the Civil War, these buildings are now used for storage. They stand as a reminder of the college&#039;s long history and connection to national events.\n\n\nQubit Tower\n\nBuilt: 1968\nStudent Nickname:  The Brain\nDescription: Qubit Tower is home to two of the most powerful supercomputers in the Midwest, offering students unique opportunities in computational research and data science.\n\n\nRevival Study Center (Classical Studies)\n\nBuilt: 1870\nDescription: A center for the study of classical languages, archology and ancient civilizations, this facility hosts a comprehensive collection of rare texts and artifacts, fostering academic excellence in classical studies.\n\n\nJ. W. Midnight Library\n\nBuilt: 1955\nDescription: The campus library offers extensive resources for students, including rare books, archives, and study spaces. Librarians are available to assist students in their academic pursuits. Library science courses are offered in basement levels 1 and 2.\n\n\nSister Sarah’s Teaching Hospital\n\nBuilt: 1927\nDescription: A teaching hospital providing top-notch medical services to the campus and community, as well as training opportunities for healthcare students in clinical settings. It offers coursework in pre-med as well as provide facilities for biological labs.\n\n\nApplied Health and Nursing Center\n\nBuilt: 1966\nDescription: The Applied Health and Nursing Center is a modern, multi-story facility that serves as the hub for Caroline College’s nursing and health education programs. Equipped with state-of-the-art simulation labs, clinical classrooms, and research spaces, the center provides hands-on training for students pursuing careers in healthcare. Its proximity to Watashuka’s teaching hospital ensures a seamless integration of academic learning with real-world clinical experience, preparing students for immediate entry into the healthcare field.\n\n\nSt. John&#039;s Lutheran Chapel\n\nBuilt: 1890\nDescription: The oldest Lutheran chapel on a public college campus in the region, St. John’s offers classes in religious studies and serves the spiritual needs of the student body. Graduate work in comparative religion and philosophy is offered here.\n\n\nWCTU Radio Station\n\nOverview: The campus radio station at Caroline College. It is housed in the McElhenney Journalism School.  The station is run by a mix of students and fulltime staff. Fulltime staff includes:\n\nMichelina Plum, who hosts the late-night show &quot;Night Vibes.&quot; from 10:00pm to 5:00 am. The show focuses on classical musical to sleep and study to.\nAlbert Hawkins, who hosts the early morning news and Americana program &quot;News and Roots&quot; from 5:00 am to noon.\n\n\nWCTU AM Radio (Public Radio On The Campus Of Caroline College)\n\n\n\n\nClubs and Societies\nBelow are 20 clubs and societies with you might engage with in and around the college. Each includes associated Call of Cthulhu skills.\n\nGreat Lakes Archaeological Society\n\nSkills: Archaeology, History\nStory Hooks: Discovering Native American artifacts linked to ancient rituals; uncovering local historical sites.\n\n\nCaroline College Debate Club\n\nSkills: Persuade, Fast Talk\nStory Hooks: Debating controversial topics that stir up hidden tensions; uncovering faculty secrets.\n\n\nPeach Street Library Occult Studies Group\n\nSkills: Occult, Library Use\nStory Hooks: Access to obscure local folklore; accidental involvement with real supernatural forces.\n\n\nFolklore and Mythology Circle\n\nSkills: Anthropology, History\nStory Hooks: Exploring regional legends; finding connections between myths and current strange occurrences.\n\n\nCaroline Science Association\n\nSkills: Science (choose one), Mechanical Repair\nStory Hooks: Experiments affected by mysterious phenomena; encountering anomalies in nature.\n\n\nLiterary Appreciation Society\n\nSkills: Language (Own or Other), Art/Craft (Literature)\nStory Hooks: Uncovering hidden messages in classic literature; meeting reclusive authors with dark secrets.\n\n\nPsychology and Wellness Club\n\nSkills: Psychology, Psychoanalysis\nStory Hooks: Exploring the minds of troubled students; encountering mind-altering experiences.\n\n\nOutdoor Adventure Club\n\nSkills: Navigate, Survival\nStory Hooks: Organizing trips into the nearby forests; discovering hidden places and strange happenings.\n\n\nThespian Troupe of Caroline\n\nSkills: Acting, Disguise\nStory Hooks: Performing plays that have unexpected effects; blurring lines between roles and reality.\n\n\nAstronomy Enthusiasts of Caroline\n\nSkills: Astronomy, Spot Hidden\nStory Hooks: Observing unexplained celestial events; contact with cosmic entities.\n\n\nStrategy Games Club\n\nSkills: Strategy Game (Chess), Spot Hidden\nStory Hooks: Strategic contests with unusual stakes; deciphering patterns that hint at larger schemes.\n\n\nCaroline Art Collective\n\nSkills: Art/Craft (Painting, Sculpture)\nStory Hooks: Art that seems to come alive; students disappearing after creating certain pieces.\n\n\nMusic Appreciation Group\n\nSkills: Art/Craft (Music), Listen\nStory Hooks: Composing or playing music that has strange effects; instruments with mysterious origins.\n\n\nWatashuka Historical Preservation Society\n\nSkills: History, Library Use\nStory Hooks: Efforts to preserve local history uncover hidden truths; dealing with those who want the past forgotten.\n\n\nLakeview Cryptid Hunters\n\nSkills: Natural World, Track\nStory Hooks: Searching for legendary creatures said to inhabit local areas; encounters with the unknown.\n\n\nPhilosophical Inquiry Club\n\nSkills: Philosophy, Occult\nStory Hooks: Discussions that lead to unsettling realizations; questioning reality itself.\n\n\nLanguage and Culture Exchange\n\nSkills: Language (Other), Anthropology\nStory Hooks: Connecting with international students; discovering ancient languages with hidden power.\n\n\nSelf-Defense and Martial Arts Club\n\nSkills: Fighting (Brawl), Dodge\nStory Hooks: Learning techniques with unexpected origins; defending against unseen threats.\n\n\nPhotography and Journalism Society\n\nSkills: Photography, Spot Hidden\nStory Hooks: Capturing images that reveal more than meets the eye; investigating stories that others avoid.\n\n\nOur Earth Group\n\nSkills: Biology, Survival\nStory Hooks: Protecting local environments leads to strange discoveries; nature behaving unpredictably.\nKeeper&#039;s Note: Involvement in clubs can provide:\n\n\n\n\nSkill Bonuses: Gain a +5% bonus to associated skills while active in the club.\nStory Opportunities: Clubs can introduce unique quests, NPCs, and resources.\nPotential Risks: Groups can grant mechanical benefits as well as possible contacts. But some clubs may be fronts for groups your character may not wish to draw attention from.\n"},"Caroline-College/04-Watashuka/01-Business-Directory":{"title":"01-Watashuka Overview and Business Directory","links":["Caroline-College"],"tags":["TTRPG","Horror"],"content":"Watashuka\n\nOverview\n\nLocation: Watashuka is a small town located at the intersection of US-14 W and Hwy 11 W in Wisconsin. It lies approximately 54 miles southeast of Madison, 60 miles southwest of Milwaukee, and 100 miles northwest of Chicago. The town is also 20 miles from Lake Geneva.\nTagline: &quot;Quiet country life, for honest people.&quot;\nPopulation (1983):\n\nTotal Region: ~10,359 (as of 1983)\nWithin Town Limits: ~5,280\nTrend: Decline since 1969 due to closing of government projects.\n\n\nDemographics:\n\nEthnicity and Diversity:\n\nPredominantly white, with a notable Native American population, primarily members of the Ho-Chunk tribe as well as a large Amish community.\nWhite: ~75%\nNative American (Ho-Chunk): ~15%\nAfrican American: ~5%\nAsian: ~3%\nHispanic/Latino: ~1%\nOther: ~1%\n\n\nAge: The town has an aging population, but the influx of students from Caroline College brings the average age down to below 27.\nReligion:\n\nLutheran: ~50% (of total population)\nAmish: ~20%\nNon-Christian Faiths: ~15% (including Native American spiritual beliefs and other minor religions)\nOther Christian Denominations: ~10%\nOther: ~5%\n\n\n\n\nEconomy\n\nPrimary Industry: Education (Caroline College)\n\nCaroline College is the primary economic driver for Watashuka, employing a significant portion of its workforce and attracting substantial but mysterious funding.\n\nImpact:\n\nDirect employment: ~40% of the town&#039;s workforce\nIndirect employment through supporting businesses: ~30%\nLarge public and private financial support, with an unknown source\n\n\n\n\n\n\nSecondary Industry:\n\nAgriculture plays a vital role in Watashuka&#039;s economy, with dairy products and cranberries being the primary crops.\nAgriculture: Primary Products:\n\nDairy: Milk and cheese\nCranberries\n\n\nImpact: Supports ~15% of the town&#039;s workforce\n\n\nTertiary Industries:\n\nLumber and crafts contribute to Watashuka&#039;s economy by providing additional employment opportunities.\nLumber: Supports ~5% of the workforce\n\nPrimary Activities: Logging, sawmills, woodworking\n\n\nCrafts: Supports another ~3%\n\nPrimary Activities: Artisan workshops, galleries, and small-scale manufacturing\n\n\n\n\n\n\nRecent Economic Developments/Challenges:\n\nIncreased Funding for Caroline College: The recent influx of funds has helped revitalize the town but has also raised questions about its source\nAging Population: Many farmers and craftspeople are approaching retirement age, which may lead to a skills gap in the future\n\n\n\nPublic History of Watashuka\n\nMay 1856 – Founding of Prairieville Academy\n\nPrairieville Academy is established as a teacher-training school (normal school) to educate future educators. The academy becomes the heart of the town of Prairieville, which later becomes Watashuka. The academy was the dream of three educators Walter Mann, Eleazar Root and John W. Sterling. There dream was to work with the local Ho-Chunk people to bring forth a new era for the region. That dream is still alive today despite setbacks.\nFounding Members\n\nWalter Mann: German immigrant, artist, head founder of the academy\nEleazar Root: Co-founder. Massachusetts school teacher, relocated\nJohn W. Sterling: Co-founder, English businessman, relocated\nElias Haskins: Co-founder, local prominent cavalrymen\nJonathan Whitmore: Co-founder, local esteemed teacher and theologian\nSarah Johnson: Co-founder, local wealthy widow and philanthropist\n\n\n\n\nAugust 1860 – Destruction of Prairieville Academy\n\nThe academy is destroyed during a violent conflict between the settlers and a rogue native tribe who attacked the school. During the attack many of the educators and founders were killed; only Eleazar Root and John Sterling survived. The academy burned down. Many blame local tensions with indigenous people on the attack. Most records from this time are lost, and it remains a tragic, but poorly understood, event in local history.\n\n\nSeptember 1862 – Rebuilding of Prairieville School\n\nIn the wake of the academy’s destruction, the Prairieville School is built to continue the region’s educational mission. Under the leadership of Eleazar Root and John W. Sterling the school thrives and grows as part of the effort to revitalize education in the region, attracting settlers to the area. Eleazar served as the school&#039;s first principal while John provided the financial and political support.\n\n\nBlizzard of 1888 - Humanitarian Aid\n\nAfter the Blizzard of 1888, large numbers of members of the Lutheran Church immigrate to the region. The first settlers arrive to provide humanitarian assistance but soon took to calling the region home.\n\n\nApril 1895 – Caroline Religious Teaching College Founded\n\nDue to the influence of Lutheran immigrants, the Caroline Religious Teaching College is established, expanding the former school into a larger institution focused on religious education. The town of Prairieville is renamed Watashuka, believed to be derived from a misinterpreted Native American word symbolizing the area&#039;s different cultural influences.\n\n\n1939-1945 – World War II Efforts\n\nCaroline Religious Teaching College contributes to the war effort, with local industry and students engaging in patriotic duties. The college’s science and engineering departments grow due to wartime funding. After the war, the college continues expanding its academic programs.\n\n\n1945 – Caroline College Renamed\n\nThe college is officially renamed Caroline College after WWII, reflecting its role as a modern liberal arts institution. The post-war years bring growth and new facilities, including Sister Sarah’s Medical Center, a teaching hospital for nursing and healthcare students.\n\n\n1969 – Population Decline\n\nWatashuka’s population begins to decline in the late 1960s due to changing economic conditions; notably the closing of several government projects now deemed complete. People start leaving for larger cities like Madison and Milwaukee. The closing of some industries and the general economic downturn are seen as the reasons for this decline.\n\n\n1983-Present – Present Day Watashuka\n\nWatashuka is a quiet rural town with Caroline College as its centerpiece. The town struggles economically, but the college brings new students and some level of vibrancy. Residents are largely unaware of any significant issues beyond normal small-town troubles.\n\n\n\nTown of Watashuka Directory\n\n{Feel: Small-town America, where even those better off economically are still considered disadvantaged by the standards of most of the country.}\nMain Street\n\nThe Press Newsstand\n\n\n\nOwner: Margaret &quot;Marge&quot; Wilkins, a no-nonsense woman in her late 50s.\n\n\nDescription: Located on Main Street, The Press Newsstand has been a fixture in Watashuka for decades. Marge, the gruff but friendly owner, runs the small shop, which offers everything from local newspapers and national magazines to candy and cigarettes. Though small, the newsstand sees plenty of foot traffic, especially from old-timers and curious teenagers who like to pick up the latest gossip. Marge has a sharp eye for detail and always seems to know what’s going on in town.\n\n\nThe Prairie Press\n\nOwner: Norm Habersham\nEstablished: 1932\nDescription: The Prairie Press is the town’s local newspaper, and Norm has been its senior editor for over 30 years. The building is a modest, single-story office with a big front window displaying the latest headlines. Norm’s dedication to local journalism keeps the small office buzzing with activity despite the declining readership.\n\n\nFrozen Cow Burger Stand\n\nOwner: Mike and Ruth Garrison\nDescription: Mike and Ruth run this nostalgic 1950s-style burger stand. The small, red-and-white building is a summertime favorite, offering burgers, shakes, and fries to locals and tourists. Mike is the talkative type, while Ruth ensures everything in the kitchen runs smoothly.\n\n\nThe Prince: New &amp; Used Books\n\nOwner: Dexter Colby\nDescription: A charming, slightly dusty bookstore filled with a carefully curated selection of new and used books. The Prince is known for its quiet, cozy atmosphere, with shelves that seem to go on forever. Dexter Colby, the reserved and knowledgeable owner, has been running the shop for as long as anyone can remember. He has a reputation for always being able to find rare or hard-to-find books, making The Prince a favorite spot for local book lovers and collectors alike. The store’s resident cat, Poe, is often found napping in a sunbeam near the front window.\n\n\nCreek Music Store\n\nOwner: Tom Creek\nDescription: A small, cramped store filled with violins, horns, guitars, records, and old music equipment. Tom is a gruff, middle-aged musician who loves to chat about the glory days of rock and roll. The store&#039;s walls are covered with band posters from decades past.\n\n\nDiane&#039;s VCR/TV/Typewriter Sales, Service and Movie Rental\n\nOwner: Diane Forrester\nDescription: Diane’s shop is a catch-all for aging electronics, VCR rentals, and typewriter repairs. The cluttered storefront is an intimidating mess, but Diane’s expertise keeps her loyal customers coming back. She’s known to be friendly, but a bit of a technophobe when it comes to modern computers.\n\n\nDance With Us! Studios\n\nOwner: Beth Carmichael\nDescription: Beth runs this small dance studio with passion, teaching ballet, jazz, and tap to children and adults alike. The building is an old converted warehouse with wooden floors and mirrored walls. Beth is energetic and upbeat, always encouraging her students to do their best.\n\n\nThe Hut (Electronics And Appliance)\n\nOwner: Jerry &quot;Buzz&quot; Horton\nDescription: The Hut is a compact store crammed with everything from radios to refrigerators. Buzz is a gadget enthusiast and knows every feature of the appliances he sells. The store’s slightly disorganized appearance reflects Buzz’s chaotic but friendly personality.\n\n\nWatashuka Public Services Building (City Hall, Courthouse, jail, police, fire)\n\nOwner: Public Services\nDescription: This imposing brick building serves as the town’s administrative hub. It’s home to the town’s municipal government, police, fire station, and courthouse. The staff is small but efficient, handling everything from zoning permits to civil disputes.\n\n\nWatashuka Post Office\n\nOwner: U.S. Postal Service (Postmaster: Linda Neal)\nDescription: The post office is a simple, utilitarian building with a friendly atmosphere. Linda Neal, the town’s long-serving postmaster, oversees a small team who know most customers by name. The building also serves as a gathering spot for older residents picking up their mail.\n\n\nBergmann’s Drugstore\n\nOwner: Henry Bergmann\nDescription: A classic, small-town drugstore with a soda fountain counter that harks back to the 1950s. Henry is a kindly older man who has run the pharmacy for over 40 years. His gentle demeanor makes him a favorite among locals, who rely on his store for medications and sundries.\n\n\n\n\nAlbert’s General Goods\n\nOwner: Albert “Al” Ralston\nDescription: A catch-all general store selling everything from canned food to gardening tools. Al is a no-nonsense man in his 50s with a gruff exterior but a heart of gold. The store is packed with shelves of goods, and Al seems to know where everything is in his well-worn shop. \n\n\n\n\n\nDowntown Side Streets and Alleys\n\nHanson&#039;s Hardware &amp; Building Supplies (Closed, relocated)\nFreeman &amp; Burke Attorneys at Law\n\nOwner: Sarah Freeman and Michael Burke\nDescription: A small general practice law firm specializing in family law, real estate, and business contracts. Sarah and Michael are both serious and professional but maintain a friendly rapport with their clients. Their office is located in a charming converted house on a side street near the town center.\n\n\nFixer’s Supply Co.\n\nOwner: Roy and Jean Fixer\nDescription: Roy and Jean run this well-stocked hardware and building supply store. Known for their friendly service and practical advice, the couple has made Fixer’s a go-to spot for home improvement supplies. The large building on a side street still has an old-school charm, with its wood-paneled walls and hand-painted signage.\n\n\nBlue Heron Pub &amp; Grill\n\nOwner: Paul Erickson\nDescription: A classic pub with a comfortable, lived-in feel. The Blue Heron serves as a gathering place for locals, offering simple but tasty pub food. Paul is a laid-back owner who enjoys a good conversation with his patrons, often sitting at the bar during slow hours.\n\n\nLocal Savings &amp; Loan\n\nDescription: The oldest financial institution in town, Local Savings &amp; Loan has provided banking services to residents for generations. The building is an imposing 1930s structure located off Main Street.\n\n\nWatashuka Fitness &amp; Recreation Center\n\nOwner: Jenny and Todd Mills\nDescription: A modest fitness center with an attached community gym. Jenny and Todd are fitness enthusiasts who returned to Watashuka after college to open the center. They host fitness classes and recreational leagues for the town’s youth.\n\n\nSmileWorks Dental Care\n\nOwner: Dr. Ellie Chambers\nDescription: A cheerful dental office with bright, kid-friendly décor. Dr. Ellie is a warm and caring dentist who returned to her hometown after dental school. The small building offers basic dental services with a personal touch.\n\n\nEyes on Watashuka Optometry\n\nOwner: Dr. Michael Larson\nDescription: A small, neat optometry office where Dr. Larson provides eye exams and glasses. He is soft-spoken but knowledgeable, making him a trusted figure in the community. The office has a quiet, calming atmosphere, with vintage eyeglass frames displayed as décor.\n\n\nSpin Cycle Laundry &amp; Dry Cleaners\n\nOwner: Margaret and Earl Jacobs\nDescription: A family-run laundromat with attached dry cleaning services. Margaret manages the dry cleaning side, while Earl runs the laundromat. The building is a little worn, but it’s a reliable place where locals come to clean their clothes or chat while waiting for the spin cycle to end.\n\n\nThe Stand: Community Theatre\n\nOwner: Watashuka Theatre Group (Managed by Mary Cline)\nDescription: A charming little community theater housed in a renovated church. Mary Cline is the passionate director of the theater group, which puts on performances throughout the year. The space is intimate, with just enough room for an enthusiastic crowd.\n\n\nFrontier Life History Center\n\nOwner: Watashuka Historical Society (Curator: Alan Graves)\nDescription: A small museum dedicated to Watashuka’s pioneer history. Alan Graves, the curator, is an eccentric historian who loves sharing stories of the town’s early days. The building itself is an old cabin-like structure, restored to give visitors a sense of what life was like in the past.\n\n\nWatashuka WP (Water and Power)\n\nDescription: A functional, no-nonsense utility building where the town’s water and power systems are managed. The employees are friendly but busy, ensuring that the town’s essential services run smoothly without interruption.\n\n\nAll Saints Church of Watashuka (Lutheran Church)\n\nHead: Pastor Daniel Mueller\nDescription: A modest but well-maintained Lutheran church with a tall steeple. Pastor Mueller is a kind and soft-spoken man who has served the congregation for over a decade. The church is a cornerstone of the community, hosting services, events, and local outreach programs.\n\n\nBakers&#039; Creamery &amp; Bakery\n\nOwners: Clint and Amanda Baker\nDescription: Located just off Main Street, this neighborhood grocery is known for its fresh-baked bread and local dairy products. Bakers&#039; is a quiet spot where locals often run into one another after church for ice cream or cookies.\n\n\nPrairie Realty\n\nOwner: Jim Halushka\nDescription: A local real estate office handling everything from farmland to residential properties. Prairie Realty has deep roots in Watashuka and plays a key role in selling historic homes and new development areas.\n\n\nRiver’s End Funeral Services\n\nOwner: The Hansen Family\nDescription: A family-run establishment that provides personalized funeral services. Known for its caring staff and beautifully maintained grounds just outside the town center.\n\n\nPetals &amp; Posies\n\nOwner: Stanley Romano\nDescription: A quaint little flower shop nestled on one of the side streets off Main. Petals &amp; Posies is beloved for its affordable, custom flower arrangements and its personal touch for every event.\n\n\nWhich In The Wardrobe\n\nOwner: Rebecca Covell\nDescription: A charming boutique offering affordable clothing and accessories for women and men. It&#039;s a place where locals can find everything from casual wear to outfits for special occasions.\n \n\n\n\nAtmosphere:\n\nWatashuka’s Main Street is the lifeblood of the town, though it has seen better days. Lined with small businesses and family-owned shops, it exudes a nostalgic charm. During the day, it bustles with locals running errands and small talk flowing between shopkeepers and customers. The sounds of typewriters, local radio, and the clinking of glasses at the Blue Heron Pub fill the air. However, as the sun sets, Main Street takes on a different tone. Shadows seem to stretch longer here, and the empty streets echo with an eerie silence. The old brick buildings, now weathered and fading, whisper of past prosperity, but there’s a creeping unease.\nThe side streets add to the town’s atmosphere of quiet decay, with narrow, cobbled roads leading to forgotten businesses like old law firms and shuttered hardware stores. These roads seem darker at night, and there’s a sense that they have stories of their own.\n\nNorthwest &quot;Sterling Hills&quot;\n {Notes: State Route 89 marks the town&#039;s western border} {Feel: Most affluent, not wealthy but doing better than the rest of the town. } \n\n\n\nNorth High School\n\nPrincipal: Mr. Peter Clarke, a stern but fair educator who has been principal for over a decade.\nDescription: As the only remaining high school in Watashuka, North High School is vital to the town’s educational system. The building is old, with some sections dating back to the 1950s, but it&#039;s well-maintained thanks to Principal Clarke&#039;s efforts. The mysterious destruction of South High School years ago in a boiler explosion haunts the faculty, with rumors still swirling about whether it was an accident or spiteful former students.\n\n\n\n\nJack&#039;s Surfer: Comics &amp; Games\n\nOwner: Jack Hastings, an eccentric man in his 40s with a deep love for comics, tabletop role-playing games, and 80s pop culture.\nDescription: Jack’s store is a haven for local teenagers and college students. Its walls are lined with comic books, old action figures, and game paraphernalia. Jack often hosts Dungeons &amp; Dragons nights and has a hidden stash of rare comics and RPG sourcebooks for special customers. The store has a loyal following among the town’s youth, particularly those interested in metal music and counterculture, making it a target for the &quot;Mothers Opposing Metal&quot; group.\n\n\nLinda’s Beauty &amp; Hair Salon\n\nOwner: Linda Novak, a no-nonsense hairdresser in her late 50s who has been cutting hair in Watashuka for as long as anyone can remember.\nDescription: The salon is a small, cozy space with a few chairs, and Linda prides herself on knowing everyone&#039;s business. It’s where gossip spreads, and rumors about the oddities in Watashuka often start or grow here. Linda is friendly but doesn’t shy away from offering her opinion on anything. Her clients trust her judgment, making her an informal source of local news.\n\n\nWatashuka Bus Depot\n\nManager: Frank Holloway, a quiet, middle-aged man who has worked at the depot for over 20 years.\nDescription: The bus depot is a small, utilitarian building that serves as a hub for both passengers and cargo deliveries. The depot connects Watashuka to nearby cities, but the service has seen a decline over the years due to the shrinking population.\n\n\nHomes of Caroline College Faculty and Staff\n\nResidents: Various faculty and staff members from Caroline College, with a mix of younger professionals and older professors who have lived in Watashuka for decades.\nDescription: The homes in this area are modest but well-kept, mostly occupied by college faculty who commute to the campus. The homes here are older, with a sense of quiet respectability, but at night, the streets can feel eerie, as though those that stroll the quiet streets are always being watched.\n\n\nHomes of Government Staff\n\nResidents: Various staff connected to Project Caroline and other secretive government initiatives.\nDescription: On the surface, these homes seem perfectly ordinary, blending in with the rest of the northwest. However, these government workers are often more reclusive, keeping their personal lives secret due to work regulations. It&#039;s not uncommon for new families to move in suddenly without much introduction, and neighbors have learned not to ask too many questions.\n\n\n\nOutside of the town limits to the Northwest\n\nCaroline College\n\nAtmosphere\n\nSterling Hills is a peaceful and affluent part of Watashuka, home to Caroline College faculty, government staff, and some of the town’s more well-off residents. The streets are lined with mature trees and stately homes, giving the neighborhood an air of quiet respectability. On the surface, Sterling Hills feels safe and orderly, but there’s an underlying tension among the residents, particularly those with ties to the college or government projects.\nCaroline College’s campus stands apart from the town of Watashuka, its stately buildings and green lawns giving it an air of academia and history. A distance of several miles, through dense woods, separate the school from its town.\n\nNortheast &quot;Farmer&#039;s Ridge&quot;\n {Feel: Very rural, farm focused} \n\nHanson’s Hardware &amp; Building Supplies (Relocated from Downtown)\n\nOwner: Jack Hanson\nDescription: After closing the downtown location, Jack Hanson moved his hardware store to the northeast of town, closer to the rural community it serves. Jack is a gruff but helpful man, always willing to offer advice on home repairs and farming tools.\n\n\nWatashuka Co-Op Farming Supplies\n\nOwner: Co-Operative (Manager: Fred Yoder)\nDescription: A bustling co-op that provides farming supplies to local dairy farmers and crop growers. Fred Yoder, a practical man with deep roots in the Amish community, manages the co-op. The building is large and utilitarian, but always busy.\n\n\nYoder’s Amish Goods Market\n\nOwner: The Yoder Family\nDescription: A rustic market selling handmade Amish goods, including baked items, furniture, and crafts. The Yoders are a quiet but friendly family, well-known for their traditional methods and quality products. The market is a charming wooden structure with a welcoming atmosphere.\n\n\n\nOutside of the town limits to the Northeast\n\nAmish Community Border\nWatashuka Farmers\n\nAtmosphere\n\nFarmer’s Ridge is the agricultural heart of Watashuka, where life revolves around the seasons, livestock, and the land. The area feels timeless, with endless rows of crops and farmhouses dotting the landscape. There’s a peacefulness here, but also a sense of isolation. The farmers are proud and self-reliant. The Amish community nearby maintains a watchful eye while keeping their deeper knowledge to themselves.\nThe Amish lands to the northeast of Watashuka are serene and picturesque, with rolling hills, wide fields, and carefully maintained farms that seem untouched by time. Horse-drawn buggies travel along dirt roads, and the simple wooden homes and barns give the area a peaceful, pastoral quality. The air smells of fresh-cut hay and wood smoke, and the rhythmic sound of hammering and livestock creates a sense of calm industry. Life here feels slower and more purposeful, far removed from the chaos that pervades the rest of the town.\n\nSouthwest &quot;Prairie View Downs&quot;\n {Notes: Corner of State Route 89 and State Route 11 marks the town boarder} {Notes: Boarder of Ho-Chunk native people&#039;s land (further to the south west)} {Feel: Very rural, keep to themselves type people} \n\nK Squared Gas Station\n\nOwner: Kevin and Kyle Kilgore, twin brothers who run the station.\nDescription: Located on the way out of town, heading towards Caroline College, K Squared is more than just a rural gas station. It serves as a morning pit stop for students and faculty on their way to class. In addition to fuel, the store offers coffee, breakfast snacks, and basic supplies. The Kilgore brothers are known for their friendly banter and keeping tabs on the local happenings.\n\n\n\n\nAnnie&#039;s Animal and Game Processing Plant\n\nOwner: Annette &quot;Annie&quot; Martin, a tough, no-nonsense woman in her early 60s.\nDescription: Annie’s processing plant serves the rural hunting and farming communities around Watashuka. She processes everything from livestock to wild game for local farmers and hunters. The plant, located just off State Route 89, is a sprawling complex that smells of blood and meat. Annie has worked here her whole life.\n\n\n\n\nStreamwader&#039;s Hunting Goods\n\nOwner: Jim Watson, a grizzled Vietnam War vet and experienced outdoorsman.\nDescription: Streamwader’s shop is a small, rugged building filled with hunting rifles, bows, traps, and other outdoor equipment. Jim has lived in Watashuka for decades and loves to share his stories with the younger generation of hunters, though his more chilling tales are often dismissed as the ramblings of an old soldier.\n\n\nRural Communities\n\nResidents: Dairy farmers, crop growers, and livestock ranchers.\nDescription: The sprawling farmland to the southwest is home to families who have lived in Watashuka for generations. These farmers are mostly self-sufficient, and many have an unspoken rule to mind their own business.\n\n\nHo-Chunk Information Center\n\nCurator: Mary Whitecloud, a knowledgeable and reserved Ho-Chunk woman in her late 40s.\nDescription: This small center serves as an educational hub about the Ho-Chunk people, their history, and their culture. The building is humble but welcoming, with displays about Ho-Chunk traditions and artifacts. Mary runs the center, offering tours and answering questions from visitors.\n\n\n\nOutside of the town limits to the Southwest\n\nThe Wet Spot\n\nOwner: “Big” Tony D’Amato, a business-savvy man in his 50s.\nDescription: Despite its seedy reputation, The Wet Spot is a popular hangout for college students, known for cheap drinks and live music. The club, located just outside town limits near Lake Mary. Tony, the owner, loves catering to the college crowd, offering student discounts and hosting wild theme nights. Locals mostly avoid the place, but for Caroline College students, it’s a spot to unwind away from prying eyes. Though rumors swirl about shady dealings, Tony keeps a tight lid on any trouble, preferring to keep things legal—and profitable.\n\n\nBorder of Ho-Chunk Native People&#039;s Lands\n\nAtmosphere\n\nThe Downs are a mix of sprawling farmlands and quiet, isolated properties. The air is thick with the smell of fresh hay and the sound of distant tractors, creating a rural, down-to-earth feel. It’s a hard-working community where people keep to themselves and don&#039;t ask too many questions.\nThe Ho-Chunk lands are sacred and revered, with a strong connection to the spiritual. The area is quiet, peaceful, and somewhat eerie. The trees here seem older, and the wind carries with it the weight of ancient history. Many in Watashuka avoid this part of the land.\n\nSouth East &quot;Lakeview&quot;\n {Feel: Working Class mixes with impoverished housing and abandoned lots}\n {Note: You cannot see the lake from the neighborhood.}\n\nLakeview Elementary And Jr. High School\n\nOwner/Principal: Principal Nancy Doyle, a stern yet caring woman who has run the school for over 20 years, is known for her no-nonsense attitude.\nDescription: The school serves the local working-class families of Watashuka. It&#039;s an aging building, with outdated facilities, but a dedicated staff. Known for its tight-knit community, teachers often go above and beyond to help students who face difficult circumstances at home.\n\n\nMackie Recreational Park\n\nCaretaker: Gary “Old Man” Dutton, a retiree who volunteers his time to maintain the park, always seen with his trusty rake in hand.\nDescription: Once a bustling park for families, Mackie Recreational Park now has overgrown fields and outdated playground equipment. Despite its wear, it’s a gathering place for children after school and hosts occasional community events.\n\n\nBerg Farm House - on empty lot on 14th St.\n\nOwner: Unknown and in dispute. The Watashuka Historical Society is attempting to take ownership but they lack the funds.\nDescription: The oldest surviving building in the region, the Berg Farm House was built before 1876. This is known from a surviving watercolor painting dated from 1876. It is suspected that the structure may have an older origin. The building is currently abandoned and opinions are mixed as to whether the town should restore it or demolish it.\n\n\n19th Street Apartments\n\nOwner: The elusive Mr. Ronald Maddox, a local landlord notorious for neglecting property repairs while still demanding rent on time.\nDescription: A low-income apartment complex filled with diverse residents. The building is run down, with peeling paint and unreliable plumbing, but it&#039;s home for many who can’t afford better housing.\n\n\nJackie&#039;s East Side Pizza\n\nOwner: Jackie Leone, a friendly, middle-aged man with a deep love for pizza (even if he cannot eat it himself due to lactose intolerance). He’s known for giving free slices to kids who can&#039;t afford them in exchange for odd jobs (washing dishes, cleaning, etc.).\nDescription: Known for its greasy, but delicious pizza, Jackie’s East Side Pizza is a local favorite for a quick bite. The interior is simple and clean, with checkered tablecloths and neon signs that have seen better days.\n\n\nDominick&#039;s Grocery\n\nOwner: Dominick Santoro\nDescription: The largest grocery store in the region, it is a family owned store with shelves that are always stocked with local produce and staples. Dominick&#039;s caught between the norms of a simpler time and the pull of the modern world. In a struggle to stave off outside commercial interests, the pull of the modern is winning.\n\n\nCobblers &amp; Threads\n\nOwner: Betty Whitehall, a no-nonsense seamstress, and her brother Frank Whitehall, the cobbler. They’ve run the shop together for decades, known for their efficient teamwork.\nDescription: A dual-purpose shop offering both shoe repair and clothing alterations. Known for its fast service, it’s a favorite for residents who want to make their clothes and shoes last a little longer.\n\n\nTony’s Barber Shop\n\nOwner: &#039;Little&#039; Tony McKivett\nDescription: A classic barber shop where the men of Watashuka gather for haircuts and town gossip. Tony’s father ran the shop before him, and Tony knows just about everyone’s secrets. The shop has old-fashioned leather chairs and a timeless feel.\n\n\nNickel Quick-Mart\n\nOwner: Rick Graves, a friendly, overworked man who runs the store mostly on his own. He’s known for always greeting customers with a smile despite the long hours.\nDescription: A small, rundown convenience store that carries everything from snacks to household items. It’s open late and frequented by everyone in the neighborhood for last-minute purchases.\n\n\nMetal Circle Apartments\n\nOwner: Martha Hale, a widow who inherited the building from her late husband and struggles to keep it maintained on her own.\nDescription: A small apartment complex, known for its circular layout which follows what was once the boundary Prairieville. The apartments are affordable but come with frequent maintenance issues. It&#039;s popular with students from Caroline College looking for off campus housing.\n\n\n\n\nAnderson&#039;s Shady Tree Mechanics and Auto Sales\n\nOwner: Jed Anderson, a gruff but likable mechanic who’s been fixing cars in Watashuka for as long as anyone can remember.\nDescription: A combination auto repair shop and used car dealership, located just on the road out of town. It’s known for doing quick, cheap repairs and offering used cars at prices that make people suspicious. The junk yard in the fields behind the shop are expansive.\n\n\n\n\nMid-City Apartments\n\nOwner: Marie Jennings, a tough but fair property manager who tries to do what she can with the limited resources she has.\nDescription: A crumbling, multi-story apartment building. The elevator is always broken, and the halls are filled with peeling wallpaper. Despite this, it’s always full of tenants; especially the town&#039;s aging population who do not have family to stay with.\n\n\n3 Ball Pawn\n\nOwner: Roy “Three Ball” Smith, a shrewd businessman who claims he can sell anything.\nDescription: A dark, cramped pawn shop filled with odd trinkets, used electronics, and questionable items. The shop is always busy, with people haggling over prices. It has frequently in trouble with local law enforcement for selling items with a &#039;questionable&#039; past.\n\n\nPR’s (Poor Richard’s) Bar\n\nOwner: Richard “Rich” Mulligan, a man whose nickname, Poor Richard, comes from his tendency to drink away his own profits.\nDescription: A local dive bar with a dimly lit interior, cheap drinks, and live music that is popular with college students.\n\n\nCornerstone Center (Community Center)\n\nManager: Clara Williams, a passionate social worker who does her best to keep the center running with limited funds.\nDescription: A rundown community center that offers free classes and activities for local kids and adults. The building is in desperate need of repairs, but it’s still a hub for the neighborhood.\n\n\nWatashuka Chamber of Commerce\n\nHead: Alan Peterson, an optimistic businessman who believes Watashuka’s best days are still ahead, despite the overwhelming evidence to the contrary.\nDescription: The town’s business association, housed in a small, non-descript building. The Chamber tries to encourage economic development, but the town’s declining fortunes make it an uphill battle.\n\n\nPeach Street Library\n\nLibrarian: Sly Coolstein\nThe Peach Street Library is the only public library in town. While the number of volumes available are limited, they do cover a wide range of topics not usually found in a rural town library. This is due to the donations of enthusiasts in the region.\n\n\nGarrison &amp; Sons Law Office\n\nOwner: Jack Garrison and Sons (Ted and Wayne)\nDescription: A family-run law office, Garrison &amp; Sons handles wills, property disputes, and other local legal matters. Jack is semi-retired, leaving much of the day-to-day work to his sons, Ted and Wayne. The office is a small, simple building with old wooden floors and dusty bookshelves.\n\n\n\nOutside the town limits to the Southeast: &quot;Lakeview Shores&quot;\n {Feel: Resort attractions that have seen better days.}\nOnce a thriving vacation destination, Lakeview Shores has seen better days. Nestled along the edge of Lake &quot;View,&quot; this aging resort area was once popular with families seeking outdoor recreation, but a combination of economic decline and neglect has left it in a state of disrepair. The area is now frequented by locals, campers, and the occasional nostalgic visitor, though the glory days are long gone.\n\nSit n&#039; Eat Diner and Motel\n\nOwner: Doris Larkin, a friendly but world-weary woman in her 60s who runs the place single-handedly.\nDescription: This diner and attached motel are classic roadside Americana, with faded neon signs and a cracked parking lot. Once a bustling stop for tourists, the rooms are now sparsely occupied, and the diner serves mostly local regulars. Despite the wear and tear, Doris keeps the food hot and the coffee flowing. The motel rooms are clean but dated, with décor that hasn’t been updated since the 1970s.\n\n\nThe Lake (Public House)\n\nOwner: Tom &quot;Big T&quot; Lawson, a burly man in his 50s with a passion for local history and cheap beer.\nDescription: The Lake is a weathered lakeside tavern that once thrived on summer tourism. Now, it’s mostly filled with locals looking for a cheap drink. The tavern has a large deck overlooking the water, though the view is often shrouded in mist, adding an eerie ambiance. Inside, fishing trophies and old photos of Lakeview’s heyday decorate the walls. Big T is always ready to share stories of the lake’s supposed mysteries, though most patrons dismiss them as drunken ramblings. It is almost never visited by college students and is considered a &#039;locals only&#039; establishment. &quot;Its the only place in town where a good Lutheran can get a drink.&quot;\n\n\nLakeside RV Park &amp; Campground\n\nOwner: Marty and Sue Briggs, an aging couple who have managed the site for over 30 years.\nDescription: The RV park and campground sit on the fringes of Lakeview Shores, offering both short-term and long-term stays. Once a vibrant vacation spot, the campground now attracts a more transient crowd, with only a handful of RVs and tents set up at any given time. The facilities are outdated but functional, and the lake’s shoreline is overgrown with weeds.\n\n\nAll Wet Market &amp; Deli\n\nOwner: Jane and Bob Wheeler, a friendly couple in their late 40s trying to revive the area.\nDescription: This small market and deli caters to the remaining campers, RV dwellers, and the few vacationers that still trickle in. Despite the area’s decline, Jane and Bob are optimistic and do their best to offer fresh sandwiches and snacks, even though their stock sometimes sits for weeks before being sold. The building is quaint but worn, with a cheery atmosphere inside.\n\n\nLakeview Lakeside Fun Center (Mini Golf &amp; Arcade)\n\nOwner: Dave and Cathy Arnold, a laid-back couple in their 50s who refuse to let the place die.\nDescription: The Lakeview Fun Center was once a bustling family attraction, complete with mini golf, an arcade, and boat rentals. These days, the mini golf course is overgrown, and most of the arcade machines are out of order, save for a few that still function—barely. Dave and Cathy are known for their easygoing attitudes, keeping the place open even if it only gets a few visitors a day.\n\n\nThe Playhouse on the Lake\n\nOwner: Nancy Bright, a former actress who settled down after her career ended.\nDescription: This small theater once hosted local plays, musicals, and live performances for vacationers. Now, it’s mostly abandoned, with only a few amateur productions each year. Nancy, an eccentric woman with a flair for the dramatic, still dreams of restoring the theater to its former glory, though few share her enthusiasm. The Playhouse is said to be haunted by the ghost of a former actor who died during a performance, but Nancy waves off such rumors with a smile.\n\n\nThe View New Age Shop\n\nOwner: Lucinda &quot;Luce&quot; Moore, a free-spirited woman in her 40s with a deep interest in the supernatural.\nDescription: This small, quirky shop offers crystals, tarot readings, and other New Age paraphernalia. Luce is one of the few people in Lakeview Shores who embraces the strange energy of the area, and she’s always ready to discuss local legends or offer advice on warding off spirits. The shop is popular with college students and visitors interested in the occult, though locals are often skeptical of Luce’s claims about the lake’s mystical powers. She’s known to host moonlit gatherings by the lake, though only a few daring souls ever attend.\n\n\n\nAtmosphere:\n\nDespite its decline, Lakeview Shores holds a certain charm for those who appreciate faded beauty and quiet reflection. The lake, once a source of joy, now seems shrouded in fog and whispers of the unknown. Once a bustling summer retreat, Lakeview Shores has an air of forgotten grandeur. The overgrown paths, weathered motels, and silent campgrounds hint at better days, but now the area feels haunted by time. Despite its decline, Lakeview Shores retains a nostalgic charm for those who remember its heyday.\nLakeview is a working-class neighborhood with a sense of faded optimism. Many of its residents are struggling to make ends meet, and the area’s rundown houses and overgrown lots are signs of its slow decline. Yet, there’s a strong community spirit here, where neighbors help each other out, and children still play in the streets. The boarded-up windows and crumbling facades tell the story of a once-thriving part of town, but the people hold onto hope that better days are coming.\n"},"Gaming-Thoughts/!How-I-Play":{"title":"How I Play","links":[],"tags":[],"content":"Welcome to my table: A Guide For New Players Looking To Play At A Table With Me\nWhat is this\nThis document is living and will be adjusted as my views grow and change. I have gamed for many decades and the only constant I have seen is change.\nThe following are my ideas and are focused mainly on players who have never played with me before. Your ideas about games and how they should be played may differ and that&#039;s great! The hope with this document is to see if we are compatible with each in terms of gaming. I believe strongly in the idea that not every table is right for every person.\nIntroduction\nRole-playing games are for everyone, but not every game table is the right fit for every player. My goal is to create collaborative stories, where everyone helps drive the narrative. We all work together to build a fun and memorable experience. Below is a guide to help you understand the expectations and style of games I run.\nSession Zero\nWe will always begin new campaigns with a Session Zero to align expectations, discuss boundaries, and establish the tone. There are two types of session zeros:\n\n\nEstablished World: If we are playing in a defined setting, I will provide information about the world and its tone ahead of time. During Session Zero, we’ll discuss how your character fits into this world and make sure everyone is aligned on tone and boundaries. There is still a lot of flexibility available to us to tweak existing worlds to taste.\n\n\nNew Campaign Setting: If we’re starting a new campaign world, we’ll collaboratively build the world together. This is your chance to influence the setting, tone, and major elements. Be ready to share your ideas and preferences, so we can create a world that fits your expectations.\n\n\nCharacter Creation\nCharacter creation is a crucial part of any game, and we’ll handle this during Session Zero. Here’s what to keep in mind:\n\nBackstories: Characters should not start as heroes; they are on the path to becoming heroes. Focus on creating backstories that plant seeds for future adventures, rather than ones where your character has already achieved greatness. Try not to come to the table with concrete notions about a character. The best characters are created within the context of a party.\nFitting the Tone: Your character should fit the theme of the campaign. If we’re playing a gritty, combat-heavy game, a pacifist may not work. If the game is about exploration, make sure your character is ready to explore.\nParty Dynamics: We are playing games with a party, not individuals. Try to make a character that is interesting to you and fits in with the party. One way of doing this is making sure that your characters has a strong connection to at least one other character in the party.\n&#039;Evil&#039; Characters: If you’re playing a morally gray character, ensure there is something that keeps you tied to the party. Conflicts within the party are fine if they create story opportunities but avoid actions that ruin the game for other players. And don&#039;t be surprised that actions have consequences. Murder hobos become the target for another party&#039;s quest.\n\nRespecting the Mood\nMood is everything! Respecting the tone and mood of the game is important. Avoid breaking tension or stepping outside the genre we’ve agreed upon. For example:\n\nCracking jokes during an emotional scene can spoil the immersion.\nRefusing to engage with core themes, such as exploration or combat, might disrupt the game.\n\n\nEven hobbits go on adventures!\n\nWe’re here to build a story together, and maintaining the right tone helps everyone stay immersed.\nHouse Rules and Rule of Cool\nI follow the Rule of Cool—the story always comes before the rules. While we’ll try to follow the game system&#039;s rule, if strict rule-following slows down the game or takes away from the story, we’ll prioritize the narrative.\n\nHouse Rules: These are generally aimed at speeding up gameplay or making things run smoother. For example, detailed combat rules might be simplified to keep the story moving.\nRules Lawyers: If you enjoy debating game mechanics, my games may not be the best fit for you. I prefer to focus on storytelling and improvisation. If you must debate the rules, with people that enjoy that type of thing, do so AFTER the session.\n\nImprovisation and Player Agency\nMy games involve a lot of improvisation. Your actions will heavily influence the story’s direction, and major events will only occur if the antagonists can counter your actions. It’s entirely possible for you to derail or even prevent major, planned events through clever choices. I write stories based on plans and locations, not end goals. So if you are looking to &#039;win&#039; a story then I am not the storyteller for you.\n\nModules are inspiration, not recipes!\n\nCreativity is always rewarded, even if the payoff isn’t immediate. Feel free to try unconventional actions—negotiating with an enemy, coming up with new uses for spells, or devising clever solutions to problems. While not every move will work as intended, it will always shape the story in meaningful ways.\nUnless planned for during session zero, not every encounter is balanced. Sometimes the best choice is to not engage.\nPlayer Preparation\nTo help keep the story flowing, here are a few tips:\n\nBe Attentive: Stay engaged with the game, listen to other players, and make notes if needed.\nReview Between Sessions: Before each session, review your notes to refresh yourself on the story and prepare for what’s ahead.\nStay Curious: Keep your character curious and involved in the world—ask questions, explore, and look for ways to engage with the narrative.\n\nSafety Tools\nGiven the mature themes often present in my games, player safety is a top priority. I use tools such as the &#039;X&#039; card and consent flowers to ensure everyone feels comfortable.\n\n\nSession Zero: we will establish the comfort levels for different topics. This is a proactive step to ensure that everyone is playing the game we want to play. You have to speak up for your preferences to be respected.\n\nLines &amp; Veils: Lines are hard limits that you do not want to see in the game, veils are things that can come up but you do not wish to have it in the spot light. These limits can apply differently for PCs and NPCs. It might be a hard limit, a line, for the PCs to commit murder, but not for an evil NPCs (thus giving a reason for the players to stop them!).\n\n\n\nX Card: If at any time you feel uncomfortable with the content, you can tap the X card to indicate we need to stop and change the topic immediately. It’s a disruption, but your safety is more important than the flow of the game.\n\n\nConsent &#039;Flowers&#039;: A more subtle tool, consent flowers let you indicate your comfort level with the game in a non-verbal manner. Items will be provided that can be place in front of you in order to communicate your current comfort level.\n\nGreen: You’re fine, keep going.\nYellow: Proceed with caution.\nRed: Please change the subject or theme.\n\n\n\nConsent Flowers can be thought of as precursors to the X card.\nIf possible, try to raise concerns during Session Zero. It helps me tailor the game, and it gives you the ability to consent to the story’s direction.\nAlways assume that people are acting in good faith. Most people do not want to harm someone else; mistakes can happen. The best solution is always open and proactive communication. Everyone at the table is human and misunderstandings can happen. So it is on each person to help your fellow table-mates if they begin to stray from the agreed upon limits.\nCommon Topics to Discuss\nFrom www.dramadice.com/gm-tips/safety-tools-for-tabletop-rpgs/\nFrequently &#039;Lined&#039; Topics:\n\nSexualized violence\nChild abuse\nAnimal cruelty\n\nFrequently &#039;Veiled&#039; Topics:\n\nRacism\nDiscrimination against minorities\nSexuality in general\nTorture\nSpiders\nSnakes\nClowns\nDentists\nSerious illnesses\nSexism\nSuicide\n\nThis should be a starting point for the conversation, not definitive check list. I will give my list at the end.\nThemes and Boundaries\nThere are many topics that I do not care to hear about in real life; harm to marginalized groups, women, children, violence, religion, etc. However, in dramatic stories these topic frequently arise. This is true even for darker topics within the context of villains or evil NPCs. My hope is that players will act as the force to oppose these actions. But these are my preferences.\nFor backstories, especially in horror games, it’s okay to explore darker themes. Just be mindful of other players’ boundaries and the tone we’ve established. (Another reason not to come to the table with preconceived ideas about your characters.)\nConflict Resolution\n\n\nIn-Character Conflict: Conflict between characters can add to the story, but it should serve the narrative and not disrupt the group dynamic. Always consider how your character’s actions impact the party. Don&#039;t be that person. If it is &#039;what your character would do&#039; then maybe that character doesn&#039;t fit the party.\n\n\nOut-of-Character Conflict: I prefer not to get involved in out-of-character disputes unless I’m directly involved. I’m a storyteller, not a mediator. If conflicts arise, try to resolve them respectfully among yourselves.\n\n\nRole-Playing\nIn my games, immersive role-playing is encouraged. Try to avoid saying “my character does X” or “my character says Y.” Instead, speak and act as your character. You don’t need to be a professional actor, but embracing the role will enhance the experience for everyone.\nPlayer Respect\nWhile our characters may clash and NPCs may engage in morally questionable behavior, it’s essential that players treat each other with respect. Regardless of the actions within the game, I expect players to:\n\nRespect each other’s beliefs and views without pushing them onto others.\nCreate a welcoming environment where no player feels insulted, ignored, bullied, or made uncomfortable.\n\nDisagreements about in-game decisions are natural, but they should never escalate into personal attacks. If an issue arises that makes you uncomfortable, please let me or another player know so we can address it.\nWe’re here to create a fun and immersive experience together, and that starts with mutual respect at the table.\nCommunication\nIf you need to reach me outside of the game, feel free to contact me via Discord or email. I’m always open to hearing feedback, answering questions, or discussing any concerns you might have.\nWarnings About My Style\n\nIn real life, most people do not view themselves as &#039;bad&#039;... even when they are demonstrably acting that way. People are great at rationalizing their actions. Many of my villains do that too! So morally gray NPCs are common.\nImprov is big part of my style. I love seeing the story we make together. That does mean I tend to forget things like minor NPCs names that were made up on the spot. Player notes help players and storytellers alike!\nI like to start each session with a player recapping the last session. This allows me to see things from the other side. If I didn&#039;t explain something well, or a clue was missed, or some action is taking on more importance in the players&#039; minds then was intended, this helps me see that.\nI like long running stories where one event bleeds into the next. So it is a challenge for me to do things episodically. I can do it, it just goes against my nature.\nI have told stories for over 40 years. That means I have 40 years of bad habits, not that I know more than someone else. I am still surprised most times I sit down to play.\nI am here to have fun. I hope you are too. We work together to make sure every reaches this goal.\n\nMy List of Lines and Veils\nI am very flexible on my list. Within the context of a good story I can move a line to a veil and ignore a veil altogether. But as a starting point here is my list:\nLines\n\nGraphic roleplaying of taboo topics such a torture, abuse of minors, and sexuality between PCs\n\nI am very sex positive but I don&#039;t wish to be engaged in PCs erotica. If it comes up in a story, state the minimum and move on. Violence happens in a game, state the minimum and move on. Full on role-playing out such acts is a line for me.\n\n\nAudio/Visual of people in pain or abused, especially children\n\nIn a story I can handle dark topics but I do not care to see or hear such things. This includes in audio props or visuals produced as props.\n\n\n\nVeils\n\nGratuitous violence without a story reason\nAbuse of minors or the non-consenting\nManipulation for the &#039;fun of it&#039;\n\nBad guys do bad things, got it. Sometimes the details are needed for a clue but let&#039;s keep even that to a minimum.\n\n\n"},"Niisii/!Intro-Niisii":{"title":"The World Of Niisii","links":[],"tags":["TTRPG","Fantasy"],"content":"What was and what will be Niisii?\nNiisii is the world I have spend the most time on, and know the least about. This is because it started as one thing; something good. And that good thing got morphed into something else. This new thing was good but it was never &#039;right&#039;. It was forced into being something it was not supposed to be. And because it wasn&#039;t fit for this new purpose it broke.\nLet me explain.\nNo, there is too much. Let me sum up.\nNiisii was built at the request of a group of adult friends who gamed. This group of friends engaged in alternative lifestyles and activities. They a small request. &quot;Could we make a world where heteronormality and monogamy were NOT the default setting?&quot;\nMy answer was Niisii.\nSexuality, like in the real world, was a driving force in the world. The game was not erotic, but it was mature. The themes were heavy and tried to be thoughtful. The quests had more to do with human desire and fault (regardless of the species) than McGuffins and loot.\nStories were told, laughs were bellowed and tears were shed.\nThe DM was doing his job.\nBut as it happens, within the group there was a tiff. Someone in the group felt slighted and the games stopped because we all felt bad. And like that, Niisii was put on a shelf.\n\nFast forward\nYears and passed and a new group of friend have formed. And they wanted a homebrew world to play in. FR is fun and all but ....\n&#039;Sure! When do you want to start playing?&#039;\nTonight!\nOk, it was a few days later. But with work and life, what difference was 30-40 hours going to make.\nSo I dusted off an old friend and unlikely heroes went off to find a missing librarian.\nNiisii was always built to support multiple DMs; a measure of design went into the world so that different people had their own &#039;corners&#039; of the world with just enough connections to make it feel &#039;whole&#039;. So, for this group, I found an area where the lore was ignored and started to tell stories appropriate to this group.\nAnd then it grew.\nSlowly, what made Niisii, Niisii was being pushed out in favor of &#039;generica&#039;. Every race had to make an appearance, the world was always coming to the end, and no one wanted to go questing for love or vanity.\nAnother +5 sword would do just nicely thank you.\nAnd of course, whatever came out in the latest book by WotC had to be rolled in.\nStories were told, laughs were bellowed and tears were shed.\nThe DM was doing his job. :-D\nAnd not just the starting DM. Other DMs joined. And they told their stories too.\nAnd each story moved the world further away from its flavor. Mechanics, lore, limitations and options were stripped to make room for the latest suppliment.\nSure, there were are few that wanted see what this &#039;old&#039; Niisii was like but what do you mean my elf would live as long as my current 5e character?\nNiisii was generic.\nDon&#039;t get me wrong, we had a lot of fun in this world. Hundreds of years of history, epic stories, and games where, no exaggeration, over 20 people playing together in person (remember that!) just share in the stories.\nTo be fair that was only two or three times.\n....the average game night was over 12.\nAnd the games happened multiple times a week.\nEpic\nBut it wasn&#039;t Niisii.\nIt wasn&#039;t a world built where a group of lovely, good hearted perverts, could tell stories of love and betrayal. All in a world where they weren&#039;t the freaks. Where they weren&#039;t the ones who had to hide who or how they loved. Where they had representation. Their lore and stories were ... different. And when their lore got in the way, it was erased. Not added to. Erased.\nBut with that said, it was not the games played in Niisii, nor the people who played them, that was the problem.\nIt was me.\nI led people into this wonderful garden of joy. They didn&#039;t want to be there. They just wanted to play games. And if this was the world they had, well they would make a home for themselves here. They plowed the ground so they could plant their seeds. They did the right thing for them.\nIf I hadn&#039;t of been lazy, I would have made a world fit for them. It would have been something... sturdy. Every garden can be full of joy and no better than another. Just grow the garden that fits you!\nAs it is, Niisii lays in shambles. It doesn&#039;t &#039;feel&#039; right anymore; at least not to its father.\nAm I teary eyed sometimes about a make believe world?\nYeah.\nNo.\nNo, not for the world. For the why, and the who, it was made for.\nWill I &#039;fix&#039; Niisii someday?\nI don&#039;t know. I doubt it. But I am often wrong.\nWhat I do know is that maybe I&#039;m beginning to learn a lesson. Knowing when to build new gardens and when to tend the old ones is something I hope to get good at in the next 100-200 years. :-)\nThen why is this here?\nTo remind me of my mantra.\nDon&#039;t be lazy Randy"},"Terra-Mortuum/!Intro-Terra":{"title":"The World of Terra Mortuum","links":[],"tags":["TTRPG","Fantasy"],"content":"&quot;You had to go and learn for yourself, didn&#039;t you?&quot;\nA look of anger, panic and fear each fought to control his mother&#039;s face as she moved the hair from his ashen brow. Dobbin had seen each of these emotions overtake her before. His mother was nothing if not... excitable. OK, she was a lot excitable. But there was always some subtle tell; some sly hint that she wasn&#039;t truly angry or panicked or afraid. He always thought that she just liked making a scene. The over-the-top warnings, her cries of feigned fear when he got in a fight and her sobs over the dangers her &#039;stupid baby boy&#039; faced in his trades was just her excuse to be heard.\nThis was different. There was no cocked smile or quick wink now. There was only raw emotion.\nTime passed but he could not tell how long. As the young man&#039;s hands began to stiffen, and his vision clouded, he could just make out the tears that flowed down her face as she stood from where she was kneeling by his bed. She left his room quickly. As he tried to call out to her, tried to say he was sorry, only a wet grumble came from his throat. A mass fell from his mouth and his face began to twitch uncontrollably.\nHe was so cold. Cold and starving.\n\nA lifetime later she returned. The raw emotion replaced with cold, sterile, determination. In one hand she held the family&#039;s felling axe. In the other, the Beams of God that usually stayed above the hearth.\nAs she knelt once more by his bed, she whispered.\n&quot;I am so sorry baby.&quot;\nShe choked back the tears and continued.\n&quot;How many tales did we tell you? How many warnings to stay out of the Northern Fields? We didn’t do enough.&quot;\nThe battle with her emotions was taking a turn as her words began to take on the wet, fluid sound of uncontrollable loss.\nIt was then that Dobbin realized he had been holding his breath. As he tried to fill his lungs with air he found no heady relief; no soothing of the burning in his chest.\nHis eyes went wide as his heart began to slow.\nHis muscles started to twitch and break the bones of his toes.\nHis ears felt like they have been stuffed full of dandelion seeds.\nShe never let go of the hand of his hand. Even as the flesh pulled away from his nail bed and his convulsions tore through him with enough strength to break her little finger she held fast. She had failed him before. The least she could do now was to be with him while he was still … her baby.\nAnd then it stopped.\nLike a candle snuffed out, the boy... the human … died. She freed her damaged hand and stood.\nIn her good hand she reached down and cradled the Beams of God and tried to remember the ‘Prayer of the Good Death’. Slowly the words came to mind.\n&quot;O Spirit, As Dobbin journeys through the Sheltered Route&#039;s serene domain, Let him find rest from his mortal travels.&quot;\nAs she started, so too did the transformation. The human had left and the gravling was arriving much sooner than expected. He had spent too long in their domain. The days she had hoped the family had to mourn was quickly turning into minutes of terror.\n&quot;Gu-Gu-Guarded him from the clutches of a sleepless second life, so his soul may bask in the dreams of everlasting night.&quot;\nNever letting the sign of her family&#039;s faith slip from her good hand, she took up the axe in her broken one...just in case her prayer wasn&#039;t enough.\n&quot;In the Sheltered Route&#039;s Haven, let my little boy find reprieve,&quot;\nAs the broken shell of her only son started to rise, she thought of her daughters. The pain in her hand as she gripped the handle for the blow made the last line tear from her mouth like storm.\n&quot;Where eternal rest he shall achieve.&quot;"},"index":{"title":"'That' Randy's Stuff","links":["Terra-Mortuum/!Intro-Terra","Caroline-College/!Intro-Caroline","Gaming-Thoughts/!How-I-Play"],"tags":[],"content":"\nIf you were looking for me, congratulations YOU WON. If you weren&#039;t looing for me I have to wonder why you are here. Are lost? Do you need a grown-up to help you get home? I&#039;ll try to help but I gave up being a grown up a long time ago. I&#039;m just an old man that likes to play games, make mediocre music and working on being a better person today than I was yesterday.\nWhat you will find here are links to my\n\nTTRPG gaming campaigns I tell stories in\n\nI am a proud member of the Forever DM club, and I like it that way\nYou will find some information about my two current worlds\n\nTerra Mortuum: A grim dark fantasy game about a future after a horrible mistake was made.\nCaroline College: Welcome to Wisconsin. The year is 1983, the metal is loud and all the things go bump in the night.\n\n\nAnd you&#039;ll find a little bit about how I play here . Not everyone is a good gaming match with everyone else and that&#039;s ok. Before I waste your time, see if we might vibe. Don&#039;t worry, I&#039;m flexible.\n\n\nMusic I Make\n\nI do not claim to be good. I make music for me and those who want to play with me. \n\n\nPhotographs I make\n\nI don&#039;t take pictures as often as I used to but I still love the craft.\n\n\n\nFinally I guess a bit about me isn&#039;t a bad thing to add.\n\nI&#039;m happily married to my high school sweetheart. Its been over 3 decades now and I&#039;m still enamored with her.\nI have three grown children. Two I helped make, a son and a daughter, one who I gained when she married my son.\nI write mathy-optimizey-codey-things for a living\n\nDon&#039;t worry, I&#039;m a trained professional and can use these types of professional terms safely.\n\n\nI&#039;m very liberal. And believe in love, peace, equality, sex positivity, education, reason and joy for all.\n\n"}}