{"00-Gaming-Thoughts/!How-I-Play":{"title":"RPG & Me","links":[],"tags":[],"content":"Welcome to my table: A Guide For New Players Looking To Play At A Table With Me\nWhat is this\nThis document is living and will be adjusted as my views grow and change. I have gamed for many decades and the only constant I have seen is change.\nThe following are my ideas and are focused mainly on players who have never played with me before. Your ideas about games and how they should be played may differ and that&#039;s great! The hope with this document is to see if we are compatible with each in terms of gaming. I believe strongly in the idea that not every table is right for every person.\nIntroduction\nRole-playing games are for everyone, but not every game table is the right fit for every player. My goal is to create collaborative stories, where everyone helps drive the narrative. We all work together to build a fun and memorable experience. Below is a guide to help you understand the expectations and style of games I run.\nSession Zero\nWe will always begin new campaigns with a Session Zero to align expectations, discuss boundaries, and establish the tone. There are two types of session zeros:\n\nEstablished World: If we are playing in a defined setting, I will provide information about the world and its tone ahead of time. During Session Zero, we’ll discuss how your character fits into this world and make sure everyone is aligned on tone and boundaries. There is still a lot of flexibility available to us to tweak existing worlds to taste.\nNew Campaign Setting: If we’re starting a new campaign world, we’ll collaboratively build the world together. This is your chance to influence the setting, tone, and major elements. Be ready to share your ideas and preferences, so we can create a world that fits your expectations.\n\nCharacter Creation\nCharacter creation is a crucial part of any game, and we’ll handle this during Session Zero. Here’s what to keep in mind:\n\nBackstories: Characters should not start as heroes; they are on the path to becoming heroes. Focus on creating backstories that plant seeds for future adventures, rather than ones where your character has already achieved greatness. Try not to come to the table with concrete notions about a character. The best characters are created within the context of a party.\nFitting the Tone: Your character should fit the theme of the campaign. If we’re playing a gritty, combat-heavy game, a pacifist may not work. If the game is about exploration, make sure your character is ready to explore.\nParty Dynamics: We are playing games with a party, not individuals. Try to make a character that is interesting to you and fits in with the party. One way of doing this is making sure that your characters has a strong connection to at least one other character in the party.\n&#039;Evil&#039; Characters: If you’re playing a morally gray character, ensure there is something that keeps you tied to the party. Conflicts within the party are fine if they create story opportunities but avoid actions that ruin the game for other players. And don&#039;t be surprised that actions have consequences. Murder hobos become the target for another party&#039;s quest.\n\nRespecting the Mood\nMood is everything! Respecting the tone and mood of the game is important. Avoid breaking tension or stepping outside the genre we’ve agreed upon. For example:\n\nCracking jokes during an emotional scene can spoil the immersion.\nRefusing to engage with core themes, such as exploration or combat, might disrupt the game.\n\n\nEven hobbits go on adventures!\n\nWe’re here to build a story together, and maintaining the right tone helps everyone stay immersed.\nHouse Rules and Rule of Cool\nI follow the Rule of Cool—the story always comes before the rules. While we’ll try to follow the game system&#039;s rule, if strict rule-following slows down the game or takes away from the story, we’ll prioritize the narrative.\n\nHouse Rules: These are generally aimed at speeding up gameplay or making things run smoother. For example, detailed combat rules might be simplified to keep the story moving.\nRules Lawyers: If you enjoy debating game mechanics, my games may not be the best fit for you. I prefer to focus on storytelling and improvisation. If you must debate the rules, with people that enjoy that type of thing, do so AFTER the session.\n\nImprovisation and Player Agency\nMy games involve a lot of improvisation. Your actions will heavily influence the story’s direction, and major events will only occur if the antagonists can counter your actions. It’s entirely possible for you to derail or even prevent major, planned events through clever choices. I write stories based on plans and locations, not end goals. So if you are looking to &#039;win&#039; a story then I am not the storyteller for you.\n\nModules are inspiration, not recipes!\n\nCreativity is always rewarded, even if the payoff isn’t immediate. Feel free to try unconventional actions—negotiating with an enemy, coming up with new uses for spells, or devising clever solutions to problems. While not every move will work as intended, it will always shape the story in meaningful ways.\nUnless planned for during session zero, not every encounter is balanced. Sometimes the best choice is to not engage.\nPlayer Preparation\nTo help keep the story flowing, here are a few tips:\n\nBe Attentive: Stay engaged with the game, listen to other players, and make notes if needed.\nReview Between Sessions: Before each session, review your notes to refresh yourself on the story and prepare for what’s ahead.\nStay Curious: Keep your character curious and involved in the world—ask questions, explore, and look for ways to engage with the narrative.\n\nSafety Tools\nGiven the mature themes often present in my games, player safety is a top priority. I use tools such as the &#039;X&#039; card and consent flowers to ensure everyone feels comfortable.\n\nSession Zero: we will establish the comfort levels for different topics. This is a proactive step to ensure that everyone is playing the game we want to play. You have to speak up for your preferences to be respected.\n\nLines &amp; Veils: Lines are hard limits that you do not want to see in the game, veils are things that can come up but you do not wish to have it in the spot light. These limits can apply differently for PCs and NPCs. It might be a hard limit, a line, for the PCs to commit murder, but not for an evil NPCs (thus giving a reason for the players to stop them!).\n\n\nX Card: If at any time you feel uncomfortable with the content, you can tap the X card to indicate we need to stop and change the topic immediately. It’s a disruption, but your safety is more important than the flow of the game.\nConsent &#039;Flowers&#039;: A more subtle tool, consent flowers let you indicate your comfort level with the game in a non-verbal manner. Items will be provided that can be place in front of you in order to communicate your current comfort level.\n\nGreen: You’re fine, keep going.\nYellow: Proceed with caution.\nRed: Please change the subject or theme.\n\n\n\nConsent Flowers can be thought of as precursors to the X card.\nIf possible, try to raise concerns during Session Zero. It helps me tailor the game, and it gives you the ability to consent to the story’s direction.\nAlways assume that people are acting in good faith. Most people do not want to harm someone else; mistakes can happen. The best solution is always open and proactive communication. Everyone at the table is human and misunderstandings can happen. So it is on each person to help your fellow table-mates if they begin to stray from the agreed upon limits.\nCommon Topics to Discuss\nFrom www.dramadice.com/gm-tips/safety-tools-for-tabletop-rpgs/\nFrequently &#039;Lined&#039; Topics:\n\nSexualized violence\nChild abuse\nAnimal cruelty\n\nFrequently &#039;Veiled&#039; Topics:\n\nRacism\nDiscrimination against minorities\nSexuality in general\nTorture\nSpiders\nSnakes\nClowns\nDentists\nSerious illnesses\nSexism\nSuicide\n\nThis should be a starting point for the conversation, not definitive check list. I will give my list at the end.\nThemes and Boundaries\nThere are many topics that I do not care to hear about in real life; harm to marginalized groups, women, children, violence, religion, etc. However, in dramatic stories these topic frequently arise. This is true even for darker topics within the context of villains or evil NPCs. My hope is that players will act as the force to oppose these actions. But these are my preferences.\nFor backstories, especially in horror games, it’s okay to explore darker themes. Just be mindful of other players’ boundaries and the tone we’ve established. (Another reason not to come to the table with preconceived ideas about your characters.)\nConflict Resolution\n\n\nIn-Character Conflict: Conflict between characters can add to the story, but it should serve the narrative and not disrupt the group dynamic. Always consider how your character’s actions impact the party. Don&#039;t be that person. If it is &#039;what your character would do&#039; then maybe that character doesn&#039;t fit the party.\n\n\nOut-of-Character Conflict: I prefer not to get involved in out-of-character disputes unless I’m directly involved. I’m a storyteller, not a mediator. If conflicts arise, try to resolve them respectfully among yourselves.\n\n\nRole-Playing\nIn my games, immersive role-playing is encouraged. Try to avoid saying “my character does X” or “my character says Y.” Instead, speak and act as your character. You don’t need to be a professional actor, but embracing the role will enhance the experience for everyone.\nPlayer Respect\nWhile our characters may clash and NPCs may engage in morally questionable behavior, it’s essential that players treat each other with respect. Regardless of the actions within the game, I expect players to:\n\nRespect each other’s beliefs and views without pushing them onto others.\nCreate a welcoming environment where no player feels insulted, ignored, bullied, or made uncomfortable.\n\nDisagreements about in-game decisions are natural, but they should never escalate into personal attacks. If an issue arises that makes you uncomfortable, please let me or another player know so we can address it.\nWe’re here to create a fun and immersive experience together, and that starts with mutual respect at the table.\nCommunication\nIf you need to reach me outside of the game, feel free to contact me via Discord or email. I’m always open to hearing feedback, answering questions, or discussing any concerns you might have.\nWarnings About My Style\n\nIn real life, most people do not view themselves as &#039;bad&#039;... even when they are demonstrably acting that way. People are great at rationalizing their actions. Many of my villains do that too! So morally gray NPCs are common.\nImprov is big part of my style. I love seeing the story we make together. That does mean I tend to forget things like minor NPCs names that were made up on the spot. Player notes help players and storytellers alike!\nI like to start each session with a player recapping the last session. This allows me to see things from the other side. If I didn&#039;t explain something well, or a clue was missed, or some action is taking on more importance in the players&#039; minds then was intended, this helps me see that.\nI like long running stories where one event bleeds into the next. So it is a challenge for me to do things episodically. I can do it, it just goes against my nature.\nI have told stories for over 40 years. That means I have 40 years of bad habits, not that I know more than someone else. I am still surprised most times I sit down to play.\nI am here to have fun. I hope you are too. We work together to make sure every reaches this goal.\n\nMy List of Lines and Veils\nI am very flexible on my list. Within the context of a good story I can move a line to a veil and ignore a veil altogether. But as a starting point here is my list:\nLines\n\nGraphic roleplaying of taboo topics such a torture, abuse of minors, and sexuality between PCs\n\nI am very sex positive but I don&#039;t wish to be engaged in PCs erotica. If it comes up in a story, state the minimum and move on. Violence happens in a game, state the minimum and move on. Full on role-playing out such acts is a line for me.\n\n\nAudio/Visual of people in pain or abused, especially children\n\nIn a story I can handle dark topics but I do not care to see or hear such things. This includes in audio props or visuals produced as props.\n\n\n\nVeils\n\nGratuitous violence without a story reason\nAbuse of minors or the non-consenting\nManipulation for the &#039;fun of it&#039;\n\nBad guys do bad things, got it. Sometimes the details are needed for a clue but let&#039;s keep even that to a minimum.\n\n\n"},"01-Caroline-College/00-Information/!Intro-Caroline":{"title":"Welcome To Wisconsin","links":["01-Caroline-College/04-Watashuka/02-People/Dave","01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/03-The-College/00-Information/01-Campus-Directory","01-Caroline-College/03-The-College/00-Information/Caroline-College"],"tags":["TTRPG","Horror"],"content":"\nTwo minutes till midnight in Wisconsin...\nThe chill of the evening clings to the air outside. You sit alone in your dorm room, staring at the clock radio resting atop your nightstand. The green digits on your wristwatch agree with the red digits on the clock; 11:58 PM – two minutes ‘til midnight. You pull your headphones off, set your Walkman on the desk, head over to your small bed and tune into the campus radio station on the cheap alarm clock. Light classical music can be heard fading out as the DJ talks about the next piece she&#039;s putting on the turntable.\n11:59 PM\nA minute later the radio crackles with static and an electrical buzz. Your small room is filled with an eerie hum that seems to vibrate through your very bones. You&#039;ve heard rumors of this happening before – a mysterious pirate radio station taking over the campus airwaves at precisely midnight. You&#039;ve tried to catch the show before but without success. Seems tonight you got lucky.\n&quot;Let there be METAL!&quot;\nThe sound of distorted guitars can be heard through the static. A disturbed metal tune, with a happy beat, begins to play.\nWhat have you found?\nAfter a few minutes the song ends and the host returns.\n&quot;Dave Is Back Babies! ‘Metal at Midnight’ is live and we’ve got all the music and news you need to survive this messed up little town. And speaking of news, we’ve got some real juicy nuggets for all you little pink faced freshmen joining our church of METAL for the first time. And believe me, its news that THEY do NOT want you to know.&quot;\nHe pauses only a moment to catch his breath.\n&quot;We’re going live tonight because I know some of you little metal headed sideshow freaks have got class in that torture chamber known as Sister Sarah’s. And believe me, they are trying super hard to keep this quiet. So Dave’s going all School House Rock tonight. Knowledge is power! And power is what they don’t want you to have.&quot;\nThe static hangs in the air as Dave goes quiet. Is that ... screams in the static? You lean in closer, your heart pounding in your chest as the static is broken by Dave&#039;s whispered voice.\n&quot;Yeah, that hospital’s all clean and bleachy fresh outside but in the back rooms … Oh brother, it’s Mike Myers meets that freaky little alien chest baby. Us vets know it. We&#039;ve heard the screams. We&#039;ve seen shadows moving all weird. We&#039;ve seen dumpsters getting collected late at night. Ain&#039;t no trashman working after midnight! Yeah, Sarah’s stinks alright so watch your back there. &quot;\nYou glance out your window, out across the campus, towards the hospital – or rather, what you can see of it through the dense trees. The lights seem too bright tonight, casting long, dancing shadows that seem to twist and writhe unnaturally. You swear you can hear the sound of a large truck operating.\n&quot;Worst yet, THEY know it’s there! And Dave’s got the cancelled checks to prove it; right where you’d expect. In that nasty, creepy museum all the norms pass every day on their way to class. Prairie Hall is just a 24/7, 365, all you can eat charnel house with a receptionist. But they do keep records there….&quot;\n&quot;Call Mr. King, I&#039;ve got a pitch for his next book!&quot;\nThe radio crackles again, and you swear you hear something else – a whispering beneath Dave&#039;s words, a dark alien presence pushing through the static. Music breaks through the small speaker again. For the next several hours metal music flows from the pirate station. Just before dawn the music stops and Dave cuts in again. You were dozing but the odd interference and the mad host&#039;s words stir you awake.\n&quot;Damn, they found me so it’s time to wrap. But before I bounce remember…&quot;\n&quot;We’ll fight on the land,&quot;\n&quot;We’ll fight in the fields and in the streets,&quot;\n&quot;We’ll fight in the hills,&quot;\n&quot;We’ll never surrender.&quot;\n&quot;Man, someone call in the metal MILITIA!&quot;\nThe radio begins blaring the last song of the show. The pirate station has cranked up the volume to an almost unbearable level as heavy power chords and frantic riffs cut through the airwaves. You jump back, heart racing. As the song plays you can hear the sound of equipment being thrown into boxes. Over the din, you think you can hear Dave singing along. After a few moments, the radio station fades back into quiet static, leaving you alone with your thoughts – and the chilling echoes of Dave&#039;s words. You barely notice when the campus radio comes back on the air. Looking back out the window you can see the start of the morning&#039;s false dawn.\nThe night DJ has been replaced by the morning show. Soft Americana music soothes the ringing in your ears as you listen to a sorrowful woman sing over an old guitar.\nIn shadows deep where whispers stir\nA pact is forged\nsilence unheard\nMy heart I give to the darkened sky\nTo save the fields\nto let hope fly\nOh hear my call\noh ancient dread\n\nWelcome to Wisconsin.\nWelcome to a world where truth hides behind conspiracy theories and history. A world where darkness lurks in the unlikeliest of places. A world where friend and foe are difficult to distinguish from one another.\nClass is in session and a new semester begins tonight. Are you ready to confront the truths hidden within the hallowed halls of Caroline College?\nDisclaimers:\n\nThis game makes creative use of organizations that exist in real life. This game is set in an alternate history and the inclusion of these peoples, the Ho-Chunk, the Amish and the Lutherans, are here for verisimilitude. I have learned much about these peoples during the creation of this setting and have nothing but respect for their culture. I have taken efforts to avoid working in their unique mythologies into this game. I am not versed enough in these histories to do justice to such an endeavor. Any facsimile to real people, real events or histories is purely coincide.\nThis document makes use of large language models to accomplish initial drafts or art that I am not qualified, or able, to produce. Everything goes through a human multiple times but if this is a topic that you have strong opinions on, please consider avoiding this work.\n"},"01-Caroline-College/01-Character-Creation/01-Characters-Caroline":{"title":"Character Creation","links":["01-Caroline-College/01-Character-Creation/02-Session-Zero-Guidelines","01-Caroline-College/02-Setting-Rules/01-House-Rule-Distress-Points-(DSP)","01-Caroline-College/02-Setting-Rules/02-House-Rule-School-Life","00-Gaming-Thoughts/!How-I-Play","01-Caroline-College/03-The-College/01-Locations/WCTU","01-Caroline-College/04-Watashuka/02-People/Norm-Habersham","01-Caroline-College/05-Factions/Mothers-Opposing-Metal"],"tags":["TTRPG","Horror"],"content":"An Early 1980&#039;s College Setting For Call of Cthulhu Campaign\n\nDisclaimer\nThis is a game of horror. Some themes may be disturbing to some players. Players are required to engage with the Session Zero to ensure that the game is appropriate for themselves, all players, and the keeper at the table.\nPlease note: this game makes creative use of organizations that exist in real life. This game is set in an alternate history and the inclusion of these peoples, the Ho-Chunk, the Amish and the Lutherans, are here for verisimilitude. I have learned much about these peoples during the creation of this setting and have nothing but respect for their culture. I have taken efforts to avoid working in their unique mythologies into this game. I am not versed enough in these histories to do justice to such an endeavor. Any facsimile to real people, real events or histories is purely coincide.\n\nSession Zero Guidelines for details about session zero planning can be found here.\n\nCharacter Creation\nDetermining Character Stats\nRolling and Distributing Characteristics\nFor Caroline College, we use a variant of for determining characteristics.\n\nRoll 9 sets of (3d4+2) and assign one of the nine sets to each of the following:\n\nStrength (STR)\nConstitution (CON)\nDexterity (DEX)\nAppearance (APP)\nPower (POW)\nLuck (LUCK)\nSize (SIZ)\nIntelligence (INT)\nEducation (EDU)\n\n\n\nFollowing standard Call of Cthulhu procedure, each value will be multiplied by 5 to determine the characteristic&#039;s value. 1/2 and 1/5 values can be determined from this value (except for Luck).\nThe goal with this system of generating characteristics is to provide a reasonable floor for character stats and a realistic upper end (you are students after all) that allows for growth throughout the campaign. Within this setting, there are numerous ways to gain increases to characters or bonuses.\nHouse Rules\nThere are a number of house rules used in this campaign setting, including optional ones.\nSee:\n\nOptional House Rule: Distress Points\nHouse Rule: School Life\n\n\nMechanics Adjustments\nThe following are a list of adjustments, clarifications, and exercised options available in the Call Of Cthulhu system that are made use of in Caroline College.\nSanity Loss Adjustments\n\nReading Mythos Tomes:\n\nCosts sanity but will not trigger bouts of madness or insanity if done in a safe environment.\n\n\n\nRecovery from Indefinite Insanity\nStudents at Caroline College have access to counseling sessions provided by the local Lutheran church. These sessions are non-religious and aim to aid students in recovering from indefinite insanity and trauma.\n\nWeekly Counseling Sessions:\n\nAvailability: Once per week, when not participating in a game session. This is the same as Call of Cthulhu recovery method in all ways except the frequency (weekly as opposed to monthly).\nSanity Recovery Mechanics:\n\nRecovery Attempt:\n\nRoll percentile dice (1d100).\nOn a result of 01–95:\n\nSuccess: Recover 1d10 Sanity Points.\n\n\nOn a result of 96–100:\n\nSetback:\n\nLose 1d6 Sanity Points.\nGain a new phobia related to the stress or topics discussed during counseling.\n\n\n\n\n\n\nResolving Indefinite Insanity:\n\nIf Sanity Points are gained during a counseling session, you may immediately make a Sanity check (using your updated Sanity score).\nOn a Hard Success, your indefinite insanity is resolved.\n\n\n\n\nTime Commitment:\n\nAttending a counseling session requires an in-game time slot, potentially conflicting with classes or investigations.\n\n\nKeeper&#039;s Note:\n\nFrequent therapy sessions may draw attention or have narrative implications, adding to the tension of balancing time.\nFailed Therapy Sessions:\n\nMay induce phobias related to the therapy content, providing additional story hooks.\n\n\n\n\n\n\n\nLuck Recovery and Advancement\nLuck advancements are made at the start of every game session.\n\nLuck Recovery Mechanics:\n\nImprovement Check:\n\nRoll 1d100.\nIf the roll is above your current Luck, add 1d10 points.\nIf the roll is equal to or less than your current Luck, no points are recovered.\n\n\n\n\nNote:\n\nLuck may not exceed 99.\nThe starting Luck value is not used again in the game.\n\n\n\nSkill Advancements\nSkill advancements are made after thematically appropriate breaks, as determined by the keeper (expect 3–5 per semester, including exams).\nPvP Interactions and Loss of Control\n\nPlayer vs. Player (PvP) &#039;Attacks&#039;:\n\nMust be made with consent of all involved players.\n\n\nLoss of Control Situations:\n\nOccur when a character is under the effects of insanity, a Breakdown due to Distress, or certain supernatural influences.\nActions are at the keeper&#039;s discretion.\nThe keeper should consider player enjoyment and strive for consensual storytelling.\n\n\n\nBackstory Connections\n\nRobust and Thematically Appropriate Backstories:\n\nInclude one or more entries with a dark element.\nDevelop meaningful locations, significant people, and pivotal events that add depth.\n\n\nCharacter Connections:\n\nEvery character must have a connection to at least two other characters in the party in their backstory.\nNo character can have more than two connections to them.\n\n\n\nGroup Skill Checks\n\nAssisting with Skill Rolls:\n\nIf more than one character attempts a skill roll for the same task, under pressure:\n\nIf at least two characters have skill above baseline, one person can make the roll with a Bonus Die.\n\n\n\n\n\nSpending Luck\n\nLuck Points can be spent to alter the result of a skill or characteristic roll on a 1-for-1 basis.\nRestrictions:\n\nCannot spend Luck on:\n\nLuck rolls\nDamage rolls\nSanity rolls\nRolls to determine the amount of Sanity points lost\n\n\nCannot spend Luck on Pushed Rolls.\nCritical, Fumbles, and Firearm Malfunctions cannot be altered with Luck.\nNo skill improvement check is earned if Luck was used to alter the roll.\n\n\n\n\nCharacter Creation Advice\nThis section is not about rule modifications or clarifications. Instead, it is advice for how to get the most out of your character&#039;s time at Caroline College. Every setting has tropes and archetypes and a game set in the early 80&#039;s in the Midwest of the United States is no different. So here is some advise for making characters that fit the feel of Caroline College.\nHopefuls, Not Heroes.\nThis is a story of people who got in over their heads and either rose to the occasion or failed in the most memorable way possible. Is it possible to make a character that has millions of dollars in assets available to them, the ears of kings and presidents, and was a former super solider work in the setting? Maybe. Would it respect the mood of the setting. Absolutely not.\nCharacter Ideas and Suggestions For Players Who Don&#039;t Know Where To Start\n\nGet Dirty: Remember that this is a horror game with a setting that assumes no one is pure and innocent. Everyone in Watashuka has a skeleton in their closet; even you. The size of this skeleton, and how far back in the closet it is, is up to you; but its there. For some it might be minor and public; youthful drug use that left a mark on you that you don&#039;t deny, a problem with juvie as a child that you&#039;d rather not talk about, something.\n\nWhy? Because just like a fantasy game where your character is expected to take wounds and recover, a horror game inflicts wounds too. But when those wound happen, it is more interesting, and hopefully fun, to have a way to show those wounds by more than a number in a box. Call of Cthulhu works best when the backstory is the most important page on the character sheet. As horrors rend your mind, your backstory changes. New facts become &#039;discovered&#039; about your past. It is much more meaningful to have a fertile bed ready for this than just a blank sheet and rolled phobia.\nDO NOT USE THE GAME AS THERAPY. It is tempting for some people to use real life, lived pain, as a basis for a character&#039;s backstory. Don&#039;t do this. We are gamers, not therapists. While it may be cathartic for you, it is not for your fellow table-mates.\n\n\nAsk before touching: The NPCs in the setting can be a great way of tying your character into the setting early on. While we have tried to add dozens and dozens of NPCs that you might know, some of these NPCs have backstories of their own. Work with the Keeper BEFORE fleshing out an elaborate back story involving you being the long lost child of an NPCs who never had children. By asking first, the Keeper can help find an appropriate way to tie you into the game. They may even be able to help you weave new lore of the world!\nDon&#039;t Be Afraid To Be New: The College actively recruits people from outside the region. Maybe you have no ties to the region. Maybe you are here as a last resort - the failing student who got a surprise full-ride scholarship to a little school in the middle of nowhere. Or perhaps you are running from something back home, something you would like to stay far away. Work with your Keeper as needed.\nDon&#039;t &#039;Cheat&#039;: &quot;Well, my character has connection to X so I should already know all about Y and Z.&quot;. Or &quot;I&#039;m the Q&#039;s daughter so I should be able to just walk into the secret meeting.&quot; This is a game of horror and horror means the unknown. Don&#039;t try to engineer a character that takes the fun out of the horror but circumventing it. We aren&#039;t here to &#039;win&#039;, we are here to play.\nEmbrace The Unknown: If you are at Caroline College, you deserve to be at Caroline College. Rise above the madness by investigating it.\n\nExample Starting Points For Characters\nIf you need them, take inspiration from the following. Mix, match, ignore, add to, etc.\n\nSmall-Town Legacy – A freshman who grew up hearing stories of their uncle&#039;s disappearance while working the night shift at WCTU (notice all the hosts that are &#039;replacements&#039;). They’re studying journalism, determined to find out what happened, but their family warns them against digging too deep.\nNew School, New Dreams, right?: Maybe if I leave the state the dreams will stop. Maybe I won&#039;t drop out my first semester, again. Maybe a psychology major will help me remember the dreams I can&#039;t recall. Maybe it will help me forget them altogether.\nAmateur Cryptid Hunter – A kid who grew up on Ripley&#039;s and &quot;In Search Of...&quot;.  Fascinated by rumors of cryptid sightings around Lake Geneva and Watashuka decides to major in biology to see if its even possible.\nThe Journalist’s Protégé – A journalism major with a passion for uncovering the truth. They landed an early internship at The Prairie Press under Norm Habersham, but they&#039;ve started to receive strange anonymous tips and can&#039;t shake the feeling they’re being watched.\nThe Former Delinquent – Fresh out of high school, you barely scraped into college after a troubled past at North High (how did that happen). You’re trying to start fresh, but a broken home is hard to over come. Especially with spending all your life hearing hints that mom and dad knew more about what went down at South High that night.\nThe Reluctant Believer – A history major, raised by a strict religious family, who grew up hearing warnings about occult forces infiltrating Caroline College. Not a founding member, but a passionate one, your grandfather made sure you heard all of Mothers Opposing Metal&#039;s warnings. But now that you are on campus, you can’t help but notice strange things, particularly in St. John’s Chapel, that remind you of his warnings.\nThe Absent Minded Pre-Med Student? – You&#039;ve always been drawn to medicine, and was a promising student. But now that you are on campus it seems you can&#039;t remember where you put your stuff. And there must be allergies in your dorm because you wake up with nose bleeds... a lot.\nThe Photographer with a Problem – A freshman art major with a passion for photography. Maybe the school will help you go to the next level... and finally learn how to stop getting that odd light smudge that sometimes show up in your pictures when you take photos of certain places.\nMaybe Dad Was Right – The child of a longtime Watashuka resident, you grew up hearing stories about strange happenings around Lake Mary, particularly from your eccentric family members. Now that you’re attending Caroline College, you’re starting to wonder if those stories might be more than just local myths.\nAbsentee Grandfather - You are here. Therefore, you had a father. That&#039;s just science right? And that means he had a father; it follows. Then why is the last mention of my grandfather, anywhere in town, a baptism record from before WW2?\nThe Hesitant Explorer – An outdoor enthusiast who joined Caroline College’s Adventure Club, eager to explore the forests around the town. Maybe you&#039;ll get a chance to see the creature that licked your palm clean of blood when you feel down that ravine when you were a kid. Too bad the scout guides scared it away before you could see more than its tongue.\nThe Quiet Music Major – Drawn to the Don Peachy Center for the Performing Arts, you quickly discover that perfect pitch doesn&#039;t mean that someone in in your head telling you what to play when under stress.\n\nBackstory Elements\nDeveloping a rich backstory adds depth to your character and enhances the gaming experience. Each character should create entries for the following areas, aiming for meaningful and engaging content. This is a horror game, so dark elements within a backstory is acceptable, thematically appropriate, and strongly encouraged (within the limits defined by Session Zero). Try to remember that your characters don&#039;t know what&#039;s happening in the setting yet; hints and suggestions go a long way!\nIdeology/Beliefs\n\nBad Example: &quot;I believe in justice.&quot;\n\nWhy it&#039;s bad: Too vague and generic; lacks depth.\n\n\nAcceptable Example: &quot;I believe that the legal system is flawed, and true justice can only be achieved outside of it.&quot;\n\nWhy it&#039;s acceptable: Adds complexity and hints at potential conflicts.\n\n\nGood Example: &quot;Ethan prowls the city&#039;s backstreets at night, where justice rarely reaches. When the courts failed him and the guilty walked free, he wasn&#039;t above bending the rules to set things right. To him, the law is just a guideline, and true justice sometimes requires a darker path that others might deem questionable.&quot;\n\nWhy it&#039;s good: Provides depth, aligns with game themes, and introduces moral ambiguity.\n\n\n\nSignificant People\n\nBad Example: &quot;My mother.&quot;\n\nWhy it&#039;s bad: Too general; doesn&#039;t explain significance.\n\n\nAcceptable Example: &quot;My mother, who supported my academic pursuits.&quot;\n\nWhy it&#039;s acceptable: Offers context but lacks depth.\n\n\nGood Example: &quot;Amelia carries a tattered letter from her estranged mother, filled with unsent words of apology. She reads it under dim lamplight, wondering about the life her mother chose over her family. Each word fuels Amelia&#039;s resolve to find her, not just to reconnect, but to understand the choices that led them apart.&quot;\n\nWhy it&#039;s good: Adds personal stakes, urgency, and ties to potential plot lines.\n\n\n\nMeaningful Locations\n\nBad Example: &quot;The park.&quot;\n\nWhy it&#039;s bad: Too vague; lacks meaningful context.\n\n\nAcceptable Example: &quot;The old park near my childhood home where I used to play.&quot;\n\nWhy it&#039;s acceptable: Provides some context but lacks depth.\n\n\nGood Example: &quot;The rusted remains of the old Ferris wheel loom over the deserted fairground, a place where Lucas once shared a fleeting moment of joy with his first love before she moved away without a word. He returns there, the silence heavy with memories and unanswered questions, hoping one day to recapture that lost connection or at least find closure.&quot;\n\nWhy it&#039;s good: Rich atmosphere, ties into supernatural elements, and profoundly impacts the character.\n\n\n\nTreasured Possessions\n\nBad Example: &quot;A book.&quot;\n\nWhy it&#039;s bad: Generic; doesn&#039;t reveal anything about the character.\n\n\nAcceptable Example: &quot;An old diary from my grandmother.&quot;\n\nWhy it&#039;s acceptable: Provides a familial connection but could be more detailed.\n\n\nGood Example: &quot;Lily discovered an old, leather-bound book hidden behind a loose brick in her grandmother&#039;s fireplace. The pages are filled with faded handwriting and strange symbols she doesn&#039;t understand. As she reads, unsettling family secrets begin to surface—stories of forgotten ancestors and choices that cast long shadows over her family&#039;s history, secrets they had tried desperately to keep buried. At least she knows she isn&#039;t alone in her bad choices.&quot;\n\nWhy it&#039;s good: Deeply personal, tied to game lore, and serves as a catalyst for adventures.\n\n\n\n\nWith these house rules and guidelines, we aim to create an engaging, immersive, and enjoyable gaming experience for everyone involved and one that is tailored to the stories told at Caroline College. Every table is different. And during session zero these rules adjustments can be discussed, modified or removed as the table decides."},"01-Caroline-College/01-Character-Creation/02-Session-Zero-Guidelines":{"title":"Session Zero Guidelines","links":[],"tags":["TTRPG","Horror"],"content":"Session Zero Guidelines\nStarting Campaigns\nWe begin new campaigns with a Session Zero to:\n\nAlign expectations.\nDiscuss boundaries.\nEstablish the tone.\nIntegrate characters into the world.\n\nBackstories\n\nCharacters Should Not Start as Heroes:\n\nFocus on backstories that plant seeds for future adventures.\nAvoid having characters who have already achieved greatness.\n\n\n\nFitting the Tone\n\nEnsure your character fits the theme of the campaign (early 1980&#039;s horror sit in small town America).\n\nParty Dynamics\n\nCreate Characters That Fit the Party:\n\nDevelop strong connections with at least two other characters.\nCollaborate during character creation to ensure cohesion.\nCome to session zero with ideas, not characters.\n\n\n\nRespecting the Mood\n\nMaintain Immersion:\n\nAvoid breaking tension with out-of-place jokes, side talk, etc..\nEngage with the core themes agreed upon.\n\n\n\nRule of Cool\n\nStory Over Rules: We&#039;ll follow the Rule of Cool to prioritize narrative over strict rule adherence.\n\nImprovisation and Player Agency\n\nYour Actions Shape the Story:\n\nMajor events occur based on your decisions.\nCreativity is rewarded, even if payoffs aren&#039;t immediate.\nNot every encounter is balanced; sometimes avoiding conflict is wise.\n\n\n\nPlayer Preparation\n\nStay Engaged:\n\nBe attentive during sessions.\nReview notes between sessions.\nKeep your character curious and involved.\n\n\nSession Recaps:\n\nBefore each session, a player provides a recap of the previous session (group&#039;s choosing).\nIncentive:\n\nThe player who provides the recap gains a one-time Bonus Die for the session (unused bonus dice do not roll over).\n\n\n\n\n\nSafety Tools\n\nPlayer Comfort Is a Priority:\n\nSession Zero: Establish comfort levels and boundaries.\nLines &amp; Veils:\n\nLines: Hard limits not to be crossed.\nVeils: Topics that can occur but not be spotlighted.\n\n\nX Card:\n\nTap the X card to immediately stop and change uncomfortable content.\n\n\nConsent Flowers:\n\nGreen: Keep going.\nYellow: Proceed with caution.\nRed: Change the subject.\n\n\n\n\nExamples:\n\nA player indicating a yellow consent flower might prompt the keeper to adjust the scene&#039;s intensity without disrupting gameplay.\n\n\n\nThemes and Boundaries\n\nDiscuss Sensitive Topics:\n\nBe proactive in expressing preferences.\nCommon topics include violence, discrimination, sexuality, and personal phobias.\n\n\n\nConflict Resolution\n\nIn-Character Conflict:\n\nShould serve the narrative.\nAvoid actions that disrupt group dynamics.\n\n\nOut-of-Character Conflict:\n\nAddress issues respectfully among yourselves.\nThe keeper is a storyteller, not a mediator.\n\n\n\nRole-Playing\n\nImmerse Yourself:\n\nAct and speak as your character.\nAvoid phrases like &quot;My character does X.&quot;\n\n\n\nPlayer Respect\n\nTreat Each Other with Respect:\n\nRespect beliefs and views without imposing them.\nCreate a welcoming environment.\nAddress discomfort promptly and respectfully.\n\n\n\n\nCommon Topics to Discuss\nDuring Session Zero, we&#039;ll address the following possible story elements to ensure everyone&#039;s comfort:\n\nFrequently Lined Topics:\n\nSexualized violence\nChild abuse\nAnimal cruelty\n\n\nFrequently Veiled Topics:\n\nRacism\nDiscrimination against minorities\nSexuality\nTorture\nPhobias (spiders, snakes, clowns, dentists)\nSerious illnesses\nSexism\nSuicide\n\n\n"},"01-Caroline-College/02-Setting-Rules/01-House-Rule-Distress-Points-(DSP)":{"title":"House Rule: Distress Points (DSP)","links":["tags/","01-Caroline-College/01-Character-Creation/01-Characters-Caroline"],"tags":["TTRPG","Horror",""],"content":"Optional Expanded Sanity Rules for Call of Cthulhu\nNote: These rules are optional and will be discussed during Session Zero. They are designed to enhance the horror experience in long-term campaigns without incapacitating characters through excessive Sanity loss.\nThese rules were heavily inspired by the work Apostol Apostolov at  Chaosium Call of Cthulhu 7th Edition House Rules\nFor details on making characters see Character Creation\nIntroduction\nThe Expanded Sanity Rules introduce a new mechanic called Distress Points (DSP) to add psychological depth and realism to our game. Like standard Sanity Points (SAN), which decrease as characters encounter supernatural horrors, Distress Points start at a maximum value and decrease as characters face stress from realistic, non-supernatural threats. This allows characters to handle man-made horrors and stressful situations without immediate risk of madness.\nDistress Points (DSP)\nWhat Are Distress Points?\n\nDistress Points represent your character&#039;s mental resilience to stress from non-supernatural situations, such as tough decisions, resource scarcity, or dangerous environments.\nEvery character starts with DSP equal to their POW (similar to how SAN is calculated).\n\nLosing Distress Points\n\nNon-Supernatural Encounters: Non-supernatural horrors cause DSP loss instead of SAN loss. This would replace the traditional sanity roll for these mundane encounters.\nStressful Situations: When facing non-horrific, but still stress situations, DSP checks may need to be made.\nSAN Rolls: Making a sanity roll, by definition, is caused by a situation that is stressful. You lose a a DSP every time a sanity roll is made; pass or fail.\nVoluntary SAN Damage: You can always choose to take SAN damage instead of losing DSP, but not the reverse.\n\nEffects of Distress Points\n\nAbove Half DSP (more than half of your maximum DSP): You remain composed; your hidden traits are under control.\nEqual to or Below Half DSP (half or less of your maximum DSP):\n\nBegin to show minor signs of stress linked to your Dark Trait.\nEach time you lose 5 or more DSP at once, roll against your current DSP. If you roll equal to or less than your DSP, you experience a Breakdown for 1d4 rounds.\n\n\nEqual to or Below One-Fifth DSP (one-fifth or less of your maximum DSP):\n\nYour behavior is noticeably affected by your Dark Trait.\nBreakdowns last longer (1d10 rounds), and the Keeper may suggest actions for your character.\n\n\nAt Zero DSP:\n\nYou suffer a Complete Breakdown.\nThe Keeper may take control of your character until DSP is recovered.\n\n\n\nMaximum DSP\n\nDSP cannot exceed your starting value (POW). Rest and recovery can help you regain lost DSP up to this maximum.\n\nExample of a Breakdown\nScenario:\nMaria, an investigator with a starting POW of 60, starts with DSP = 60. Her Dark Trait is Paranoia, which she keeps hidden from the rest of the team.\nEvents Leading to the Breakdown:\n\nInitial Stress:\n\nMaria and her team are exploring an abandoned asylum.\nShe encounters realistic but disturbing graffiti and unsettling noises.\nOver time, she loses 20 DSP, reducing her DSP to 40.\n\n\nDSP at Half Maximum:\n\nSince her DSP is now at 40 (which is two-thirds of 60), she remains composed.\n\n\nFurther Stress:\n\nThe team finds a room with detailed accounts of past tortures (non-supernatural).\nMaria loses 15 DSP due to the distressing content, bringing her DSP down to 25.\n\n\nDSP Falls to Half or Less:\n\nWith DSP at 25 (less than half of 60), she begins to show minor signs of her Dark Trait (Paranoia).\nShe starts questioning the intentions of her teammates subtly.\n\n\nTriggering a Breakdown:\n\nSuddenly, a realistic but horrific trap is sprung, causing Maria to lose 10 DSP at once, dropping her DSP to 15.\nBecause she lost 5 or more DSP at once and her DSP is below half, she must roll against her current DSP (15).\n\nShe rolls a 22, which is above her DSP.\nBreakdown Triggered: The Breakdown will last 1d4 rounds (let&#039;s say she rolls a 3).\n\n\n\n\n\nDuring the Breakdown:\n\nBehavior:\n\nFor the next 3 rounds, Maria&#039;s paranoia takes over.\nShe becomes convinced that one of her teammates is sabotaging the mission.\nShe might accuse them openly, refuse to share information, or even act defensively if approached.\n\n\nKeeper&#039;s Role:\n\nThe Keeper reminds Maria&#039;s player of her Dark Trait and suggests actions that reflect her heightened paranoia.\nThe player can choose how to role-play these suggestions within the confines of the Breakdown.\n\n\n\nAfter the Breakdown:\n\nMaria&#039;s DSP remains at 15.\nShe regains some composure but still shows signs of stress.\nThe team may notice her odd behavior, and she might need to find ways to recover DSP.\n\nDark Traits\nWhat Are Dark Traits?\n\nDark Traits are hidden aspects of your character&#039;s personality that emerge under stress.\nThey add depth to your character and provide role-playing opportunities.\n\nSelecting a Dark Trait\n\nChoose a Dark Trait during character creation. It should remain secret from other players but not the keeper.\nExamples include traits like paranoia, obsession, aggression, or compulsiveness.\nYour Dark Trait influences how your character behaves as DSP decreases.\n\nRevealing Dark Traits\n\nAs DSP decreases, subtle behaviors linked to your Dark Trait begin to surface.\nUnder severe stress or during Breakdowns, these traits may dominate your actions.\n\nManaging Distress\n\nRest and Relaxation:\n\nShort Rest: Resting for at least an hour in a safe, comfortable environment restores 1d10 DSP. This cannot be repeated until at least one point of DSP has been lost.\nExtended Rest: A full day of rest restores 10 DSP (may be repeated as needed).\n\n\nComposure Attempts:\n\nPOW Roll: Attempt a POW roll to compose yourself. If your current DSP is at or below half maximum, the roll is of Hard difficulty.\nSuccess: Restores 1d4 DSP during danger or 1d6+1 DSP when safe.\n\n\nAssistance from Allies:\n\nAnother character can use a Psychology roll to help you recover.\nSuccess has the same effects as a successful POW roll. These cannot be used in conjugation. But if one fails, the other may be attempted.\n\n\nIndulging in Manias:\n\nEngaging in a personal mania restores 1d6+1 DSP.\nRequires a Sanity roll; failure results in 1 SAN loss.\n\n\n\nPacing Stress Loss\n\nTo keep gameplay smooth, DSP losses can be accumulated over a scene and applied at the end.\nThis minimizes interruptions and maintains narrative flow.\nImmediate DSP losses may still occur during sudden shocks or critical moments.\n\nIncreased Impact of Phobias\n\nIf your character has a Phobia, encountering its trigger doubles any DSP losses.\n\nPurpose of These Rules\n\nEnhanced Role-Playing: Allows for deeper character development as hidden traits surface under stress.\nBalanced Horror Experience: Maintains the horror atmosphere without quickly incapacitating characters through massive Sanity loss.\nLong-Term Campaign Suitability: Ideal for extended play, where character arcs and psychological journeys are explored over time.\n\nConclusion\nPlease consider how these rules might enhance your gaming experience. They aim to add psychological realism and depth to our campaign, offering new challenges and role-playing opportunities without overwhelming your character with Sanity loss. We&#039;ll discuss these rules in detail during Session Zero to ensure everyone is comfortable and understands how they will be integrated into our game.\n\nList of 50 Example Dark Traits\nThe following are example dark traits; others are possible. Please discuss your choice with the keeper before finalizing your selection.\nDark Traits Table\n\n1. AGGRESSIVE: Physical action and violence are your solutions to every problem.\n\nUnder Distress: You display bouts of verbal aggression and may intimidate allies who challenge your decisions.\nBreakdown: You are unlikely to restrain yourself from combat until any perceived enemy is neutralized.\n\n\n2. MARTYR: You feel overwhelmed by responsibility for others.\n\nUnder Distress: You become less concerned with your own well-being and focus entirely on your allies&#039; needs.\nBreakdown: You&#039;re willing to sacrifice yourself for a greater goal or the survival of others.\n\n\n3. COWARD: Fear dominates your actions.\n\nUnder Distress: You become pessimistic and sarcastic, openly expecting the worst outcomes.\nBreakdown: You panic and flee, even if it means abandoning your friends in danger.\n\n\n4. EGOTIST: Your primary concern is your own well-being and survival.\n\nUnder Distress: Your decisions prioritize your needs over others.\nBreakdown: You place your safety above everything, even denying help or betraying allies.\n\n\n5. SADISTIC: You derive pleasure from others&#039; discomfort.\n\nUnder Distress: You may enjoy causing harm or misfortune to feel better.\nBreakdown: You pursue actions that cause maximum harm to enemies, even if it jeopardizes plans or allies.\n\n\n6. PARANOID: You believe others are constantly scheming against you.\n\nUnder Distress: You see coincidences as evidence of conspiracies.\nBreakdown: You&#039;re convinced immediate events are part of a grand plot and take drastic action to counter it.\n\n\n7. PSYCHOPATHIC: You disconnect from others&#039; emotions and needs.\n\nUnder Distress: You focus solely on your goals, unable to communicate intentions or feelings.\nBreakdown: You lose the ability to cooperate, resolving problems only on your own.\n\n\n8. ANNOYING: You have habits that irritate others, like excessive talking or fidgeting.\n\nUnder Distress: These habits intensify, helping you cope with uncertainty.\nBreakdown: You struggle to concentrate, taking extra time and lacking focus.\n\n\n9. DEPENDENT: You seem independent but rely on others when stressed.\n\nUnder Distress: You cling to others for guidance and protection.\nBreakdown: You&#039;re incapable of making decisions without someone telling you what to do.\n\n\n10. MEGALOMANIAC: You have an insatiable need for power and control.\n\nUnder Distress: Feeling weak causes you anxiety and frustration.\nBreakdown: You&#039;ll stop at nothing to gain power, even embracing dangerous paths.\n\n\n11. CURIOUS: Your thirst for knowledge overrides caution.\n\nUnder Distress: You can&#039;t resist uncovering secrets, even risky ones.\nBreakdown: You&#039;re compelled to experiment with newfound knowledge, often recklessly.\n\n\n12. FIXATED: You focus on repetitive activities to escape stress.\n\nUnder Distress: You feel compelled to continue these activities.\nBreakdown: You fixate on one activity as a source of comfort, resisting attempts to stop.\n\n\n13. LOUD: You express emotions vocally.\n\nUnder Distress: You can&#039;t keep your voice down and openly share your thoughts.\nBreakdown: You make a scene, yelling or ranting, potentially wasting valuable time.\n\n\n14. ZEALOUS: A strong belief or moral code anchors you.\n\nUnder Distress: You obsess over this belief and become anxious if it&#039;s challenged.\nBreakdown: You feel your belief is under attack and will defend it fiercely.\n\n\n15. CATATONIC: You withdraw inward to cope.\n\nUnder Distress: You find it hard to speak and may shut down.\nBreakdown: You halt actions, adopt a neutral posture, and become nearly mute, passively resisting interaction.\n\n\n16. BURDENED: You carry deeper troubles than most.\n\nUnder Distress: Your underlying issues surface, affecting your behavior.\nBreakdown: Combine behaviors from two traits, intensifying your reactions.\n\n\n17. COMPULSIVE LIAR: You habitually lie, even without cause.\n\nUnder Distress: Your lies become elaborate and hard to maintain.\nBreakdown: You create a false reality and insist others accept it.\n\n\n18. MANIPULATIVE: You influence others for personal gain.\n\nUnder Distress: You resort to deceit and exploitation.\nBreakdown: You may manipulate allies into dangerous situations for your benefit.\n\n\n19. OBSESSIVE: You fixate on thoughts or ideas.\n\nUnder Distress: Obsessions dominate your actions.\nBreakdown: You can&#039;t focus on anything else until satisfying your obsession.\n\n\n20. PESSIMISTIC: You expect the worst outcomes.\n\nUnder Distress: Your negativity affects group morale.\nBreakdown: You&#039;re immobilized by hopelessness.\n\n\n21. RECKLESS: You take unnecessary risks.\n\nUnder Distress: You disregard safety measures.\nBreakdown: You engage in dangerous actions without considering consequences.\n\n\n22. JEALOUS: You envy others&#039; successes or possessions.\n\nUnder Distress: You undermine or sabotage others.\nBreakdown: You attempt to take what others have by any means.\n\n\n23. DECEITFUL: Honesty isn&#039;t your policy.\n\nUnder Distress: You lie to protect yourself or gain an advantage.\nBreakdown: You can&#039;t tell the truth, even when necessary.\n\n\n24. ARROGANT: You believe you&#039;re superior.\n\nUnder Distress: You belittle others and ignore advice.\nBreakdown: Overconfidence leads you to make poor decisions.\n\n\n25. CONTROLLING: You need to be in charge.\n\nUnder Distress: You become domineering.\nBreakdown: You attempt to control every aspect, causing conflict.\n\n\n26. STUBBORN: You refuse to change your mind.\n\nUnder Distress: You reject others&#039; ideas.\nBreakdown: You insist on your way, regardless of consequences.\n\n\n27. IMPULSIVE: You act without thinking.\n\nUnder Distress: You make hasty decisions.\nBreakdown: You take immediate action without consideration.\n\n\n28. ENVIOUS: You desire what others have.\n\nUnder Distress: You fixate on others&#039; possessions or status.\nBreakdown: You might steal or sabotage to level the field.\n\n\n29. APATHETIC: You lack interest or concern.\n\nUnder Distress: You disengage from situations.\nBreakdown: You become unresponsive to events around you.\n\n\n30. NARCISSISTIC: You have an inflated sense of self-importance.\n\nUnder Distress: You demand special treatment.\nBreakdown: You believe only you can solve problems, dismissing others.\n\n\n31. MASOCHISTIC: You find satisfaction in your own discomfort.\n\nUnder Distress: You may self-sabotage or take unnecessary risks.\nBreakdown: You engage in self-destructive behaviors.\n\n\n32. UNTRUSTING: You doubt others&#039; intentions.\n\nUnder Distress: You suspect betrayal from those around you.\nBreakdown: You isolate yourself, refusing help.\n\n\n33. GLUTTONOUS: You overindulge in pleasures.\n\nUnder Distress: You seek immediate gratification, neglecting duties.\nBreakdown: You binge excessively, ignoring consequences.\n\n\n34. IRRATIONAL: You abandon logic and reason.\n\nUnder Distress: You make illogical decisions.\nBreakdown: You cannot be reasoned with, acting unpredictably.\n\n\n35. VINDICTIVE: You hold grudges and seek revenge.\n\nUnder Distress: You dwell on past slights.\nBreakdown: You focus solely on settling scores, regardless of cost.\n\n\n36. FRACTIOUS: You&#039;re irritable and prone to conflict.\n\nUnder Distress: You pick fights over minor issues.\nBreakdown: You become uncooperative and disruptive.\n\n\n37. OBSTINATE: You&#039;re unyielding and inflexible.\n\nUnder Distress: You resist any change or compromise.\nBreakdown: You become a barrier to progress and group harmony.\n\n\n38. SUPERSTITIOUS: You believe in omens and rituals.\n\nUnder Distress: You rely on superstitions to make decisions.\nBreakdown: You refuse to act without a &#039;sign&#039; or ritual.\n\n\n39. WORKAHOLIC: You&#039;re addicted to work.\n\nUnder Distress: You immerse yourself in tasks to avoid issues.\nBreakdown: You neglect health and relationships, focusing only on work.\n\n\n40. HYPOCHONDRIAC: You fear illness excessively.\n\nUnder Distress: You misinterpret symptoms as serious ailments.\nBreakdown: You believe you&#039;re critically ill, hindering your actions.\n\n\n41. RESENTFUL: You hold onto past wrongs.\n\nUnder Distress: You bring up old grievances.\nBreakdown: You act out against perceived offenders, even if unwarranted.\n\n\n42. INDECISIVE: You struggle to make choices.\n\nUnder Distress: You&#039;re paralyzed by options.\nBreakdown: You&#039;re incapable of deciding without external intervention.\n\n\n43. GUILT-RIDDEN: You&#039;re burdened by remorse.\n\nUnder Distress: You fixate on past mistakes.\nBreakdown: You may confess to wrongs, real or imagined, distracting from current issues.\n\n\n44. SCHADENFREUDE: You take pleasure in others&#039; misfortunes.\n\nUnder Distress: You may cause or amplify others&#039; failures.\nBreakdown: You actively create situations where others will fail.\n\n\n45. COMPULSIVE CLEANER: You need cleanliness and order.\n\nUnder Distress: You focus on tidiness over urgent matters.\nBreakdown: You stop everything to clean compulsively, ignoring pressing issues.\n\n\n46. ESCAPIST: You avoid reality through distractions.\n\nUnder Distress: You retreat into fantasy or indulgent activities.\nBreakdown: You detach completely from reality, becoming unresponsive.\n\n\n47. CONTROL FREAK: You micromanage every detail.\n\nUnder Distress: You can&#039;t delegate tasks, overwhelming yourself.\nBreakdown: You try to handle everything alone, leading to burnout.\n\n\n48. PROCRASTINATOR: You delay tasks habitually.\n\nUnder Distress: You avoid responsibilities, causing delays.\nBreakdown: You refuse to act, even when action is critical.\n\n\n49. PERFECTIONIST: Nothing meets your standards.\n\nUnder Distress: You obsess over minor flaws.\nBreakdown: You&#039;re immobilized by the impossibility of perfection.\n\n\n50. EMOTIONLESS: You suppress your feelings.\n\nUnder Distress: You become detached and indifferent.\nBreakdown: You can&#039;t empathize, making cold, calculated decisions without regard for others.\n\n\n"},"01-Caroline-College/02-Setting-Rules/02-House-Rule-School-Life":{"title":"House Rule: School Life","links":["01-Caroline-College/01-Character-Creation/01-Characters-Caroline"],"tags":["TTRPG","Horror"],"content":"Recommendation: Playing a character &lt; = 39 years old is thematically appropriate. But nothing is stopping you from making a feisty middle-ager or spunky retiree. Just work with the party  to explain why these generationally disparate people are spending so much time together.\nHouse Rule: School Life\nIn this campaign, players must balance academic responsibilities with their mystery-solving adventures. Attending class not only helps avoid failing grades but also provides in-game bonuses through skill improvements.\nSee Character Creation for more details about making a character in the world of Caroline College.\nMaking The Grade\n\n\nClass Selection: Each player must choose 5 classes each semester.\n\nFreshman Fall Semester:\n\n3 required classes: One science, one history, and one language.\n2 optional classes: Chosen from the list of electives.\n\n\n\n\n\nPassing a Class:\n\nTwo exams will be held during the semester: a mid-term and a final\n\nMaking the mid-term advancement will grant a &#039;penalty&#039; die on the final\n\nAs you want to &#039;fail&#039; an advancement roll, the penalty die is a benefit\n\n\n\n\nPassing an exam involves making an advancement roll in the relative topic\n\nLuck may be used on this roll! If you use luck to pass either of the two exams, you forfeit ALL advancements rolls from the course as well as attendance bonus.\n\nSometimes passing is more important.\n\n\n\n\nCourses covering multiple skills\n\nIf a course covers multiple skills, then the player which ONE skill they will make the advancement for; not both\nDifferent skills may be selected for the mid-term and final\n\n\n\n\n\nFailing Classes\n\nTwo consecutive semesters with five or fewer classes pass may result in academic probation.\n\nThis can cause the student to lose access to campus facilities (including clubs and organizations), story line options, or other narrative consequences\n\n\n\n\n\nHonor Roll\n\nTwo consecutive semesters with 10 or more passed classes may result in being put on the honor roll.\n\nThis may cause the character to gain access to new campus facilities, people, permissions and other bonuses.\n\n\n\n\n\nClass Attendance\n\nAttending classes regularly will grant +5% to the relative skill at the end of the semester.\n\nThis is in addition to the advancements made from the mid-term and final.\nIn courses that involve more than one skill, points will be distributed between the skills as the player wishes.\n\n\nMeeting the attendance requirement, but failing a class, will still grant the bonus (you at least learned something by showing up).\nAll courses have a college required 70% attendance policy for all held classes.\n\nMeeting this requirement is determined narratively.\n\n\n\n\n\nTension Mechanic: Players must choose between attending classes or pursuing adventures, balancing academic success with their investigations.\n\n\nLimited Occupation: College Student\nAll characters at Caroline College use the occupation College Student.\n\nOccupation Skill Points: EDU × 3 (Reduced from the standard to reflect starting students but with more opportunities for advancement during the campaign).\nCredit Rating: 5–10\nSuggested Contacts: Other students.\nSkills:\n\nLanguage (Own or Other)\nLibrary Use\nListen\nThree Fields of Study (choose three academic skills relevant to your character&#039;s studies)\nAny Two Other Skills as personal or era specialties\n\n\n\n\nClass Descriptions and Schedule\nRequired Science Classes (Both lecture and lab must be attended)\n\nIntro to Biology\n\nDescription: Basic biological concepts with a focus on cellular structures, genetics, and ecology. The lab allows hands-on experience, where strange things might start to happen.\n\n\nChemistry 201\n\nPrerequisite: Chemistry 101, College Math or greater, or permission from the department chair\nDescription: Analyzing chemical bonding using atomic theory, stoichiometric methodologies, interpreting graphical chemical data and an introduction quantum mechanics. You never know when knowledge of chemical substances might help solve an occult mystery.\n\n\nTechnical Physics I\n\nPrerequisite: Calculus I, or permission from the department chair\nDescription: Calculus based introduction to physics. Topics include elementary forces, work and optics.\n\n\n\nRequired History Classes (Choose 1)\n\nWestern Civilization I\n\nDescription: A comprehensive study of Western history, covering ancient civilizations through the Renaissance, with key insights into the origins of arcane practices.\n\n\nHistory of the United States until 1855\n\nDescription: An exploration of U.S. history from colonization to modern times. Local Wisconsin history becomes relevant to uncovering the hidden past of Watashuka.\n\n\n\nRequired Language Classes (Choose 1)\n\nEnglish Composition I\n\nDescription: Focuses on writing and analysis\n\n\nIntroductory Latin\n\nDescription: Introduction to Latin\n\n\nFrench I\n\nDescription: Basics of French language\n\n\n\n\nOptional Classes (Choose 2)\n\nIntroduction to Public Speaking\n\nDescription: This course teaches students the basics of effective verbal communication, focusing on persuasive speaking techniques, managing audience perception, and developing confidence in public speaking. Students will engage in debates, presentations, and impromptu speeches.\n\n\nFoundations of Gymnastics\n\nDescription: An introduction to physical conditioning, agility, and body mechanics. The course covers basic skills in climbing, jumping, running, and balance through physical training and exercises. Designed for students looking to enhance their physical prowess.\n\n\nIntro to Parapsychology: An Introduction to the Weird\n\nDescription: This course explores the fringes of scientific inquiry, delving into phenomena such as telepathy, clairvoyance, psychokinesis, and hauntings. Students will examine case studies, historical research, and conduct their own experiments to understand the possible connections between the mind and supernatural occurrences. Expect things to get weird.\n\n\nIntroduction to Computing\n\nDescription: Students will learn the fundamentals of computing, including basic programming, data entry, and information processing. The course emphasizes practical computer applications in various fields.\n\n\nActing for Beginners\n\nDescription: This course focuses on the foundations of acting, including role-playing, physicality, and emotional expression. Students will learn how to embody different characters, effectively altering their appearance and persona through performance techniques.\n\n\nBasic Electronics\n\nDescription: An introductory course covering basic principles of electricity, circuits, and electronic components. Students will engage in hands-on projects to understand the fundamentals of building and repairing electronic systems.\n\n\nMarketing 101: Principles of Market Influence\n\nDescription: This introductory course covers the fundamental concepts of marketing, including market research, consumer behavior, advertising strategies, and product positioning. Students will learn how to craft persuasive messages and develop marketing plans, with a focus on influencing consumer decision-making in various industries.\n\n\nBasic First Aid and CPR\n\nDescription: Students will learn essential first aid techniques, including CPR, wound treatment, and emergency response. The course is hands-on and prepares students for basic medical emergencies in everyday situations.\n\n\nIntroduction to Legal Studies\n\nDescription: This course introduces the foundational concepts of law, including constitutional law, criminal justice, and civil procedures. Students will explore real-world case studies and participate in mock trials.\n\n\nInformation Research and Literacy\n\nDescription: This course teaches students how to efficiently locate, evaluate, and use information from various sources, including libraries, archives, and digital databases. Emphasis is placed on research strategies and citation techniques.\n\n\nIntroduction to Mechanics\n\nDescription: This hands-on course introduces students to the fundamentals of mechanical systems, focusing on repairing and maintaining machines, vehicles, and industrial equipment. Students will work in a lab setting, learning to use tools and heavy machinery.\n\n\nIntroduction to Medical Science\n\nDescription: Designed for pre-med students, this course introduces the basics of human anatomy, pathology, and medical ethics. Students will explore medical case studies and observe hospital procedures.\n\n\nEcology and Environmental Studies 101\n\nDescription: This course explores ecosystems, biodiversity, and environmental conservation. Students will learn about the interconnections between species and their environments through fieldwork and lab exercises.\n\n\nOrienteering 101\n\nDescription: A practical course in map reading, compass use, and wilderness navigation. Students will engage in field activities, learning how to navigate different terrains and track wildlife.\n\n\nIntroduction to Psychoanalytic Theory\n\nDescription: This course introduces the basic principles of psychoanalytic theory, including concepts such as the unconscious, repression, and dream interpretation. Students will examine foundational case studies from Freud and Jung.\n\n\nForensic Science 101\n\nDescription: Students will learn basic forensic techniques, focusing on crime scene investigation and evidence gathering. Emphasis is placed on attention to detail and spotting hidden clues during investigations.\n\n\nWilderness Survival Techniques\n\nDescription: This course teaches the fundamentals of wilderness survival, including shelter building, fire-making, and finding food and water in the wild. Students will participate in hands-on field exercises.\n\n\nSwimming for Lifelong Health\n\nDescription: Students will learn swimming techniques, water safety, and endurance training. This course is ideal for beginners or those looking to improve their swimming skills.\n\n\nIntroduction to Anthropology\n\nDescription: This course explores human cultures, ancient practices, and the development of civilizations. A particular focus is placed on the cultural practices of indigenous groups, such as the Ho-Chunk Nation, providing key insights into their sacred sites and traditions.\n\n\nIntroduction to Psychology\n\nDescription: This course studies the human mind and behavior, including key psychological theories on cognition, perception, and social behavior. It is particularly useful for understanding the motivations of NPCs and evaluating mental health or sanity during investigations.\n\n\nPublic Speaking\n\nDescription: This course provides instruction on developing persuasive speaking skills, helping students gain confidence in communication. It covers techniques for influencing and convincing others, skills that are useful during interactions with NPCs and negotiations.\n\n\nIntroduction to Philosophy\n\nDescription: A deep dive into metaphysical questions and esoteric thought, this course examines classical and modern philosophical theories. Special attention is given to occult philosophies and ancient belief systems, making it ideal for players interested in occult knowledge.\n\n\nIntroduction to Theater\n\nDescription: This course introduces students to improvisation, performance, and role-playing. Students will learn how to quickly adapt their personas and use verbal techniques to deceive or convince others, perfect for moments when quick thinking and fast talk are essential.\n\n\nDrawing and Painting I\n\nDescription: This studio-based course teaches the basics of drawing and painting techniques. Students will develop their skills in artistic expression, which can be used for sketching clues, analyzing artworks, or interpreting occult symbols found during investigations.\n\n\nIntroduction to Music Appreciation: From Cavemen to Chopin\n\nDescription: A broad survey of music history, from ancient rhythmic traditions to classical compositions. This course hones students’ listening skills, making them more attuned to subtle auditory cues, which are often crucial during investigations where sound plays a role.\n\n\nCollege Math\n\nDescription: This course covers essential mathematical principles such as algebra, trigonometry, and basic calculus concepts. It serves as a foundation for students pursuing science, engineering, or economics, offering problem-solving techniques applicable to various fields.\n\n\nCalculus I\n\nDescription: An introduction to differential and integral calculus, focusing on limits, derivatives, and applications of the derivative in real-world contexts. This course is required for students pursuing technical fields such as physics, engineering, and economics.\n\n\n\nClass Schedule\n\n"},"01-Caroline-College/03-The-College/00-Information/00-Admissions-Letter":{"title":"Admissions Letter","links":["01-Caroline-College/03-The-College/00-Information/Caroline-College","01-Caroline-College/03-The-College/02-People/Dr.-Daniel-J.-Stanton"],"tags":["TTRPG","Horror"],"content":"Caroline College\nOffice of the President\nWatashuka, Wisconsin 53586\n(608) 555-1234\nMay 20, 1983\nDear Student,\nIt is with great pride that I extend my warmest congratulations on your admission to Caroline College for the Fall 1983 semester. As an alumnus of the Class of 1937, I recall the excitement that comes with the opportunity to begin a new academic journey. You are about to join a close-knit community where students, faculty, and staff come together to explore ideas, develop talents, and forge lasting friendships.\nCaroline College has been a beacon of learning since its early days as Prairieville Academy. Whether your passion lies in the sciences, the arts, technology, or the humanities, you will find a home here. For those pursuing scientific research, our cutting-edge Qubit Tower and Brown Science Complex provide state-of-the-art facilities that will push the boundaries of your understanding. Students drawn to music and the arts will find inspiration in the Don Peachy Center for the Performing Arts, where creativity thrives.\nIf your heart lies in the study of history, philosophy, or religious traditions, you will have the chance to engage deeply with our Bowstein Center for Philosophy and Religious Research and Revival Study Center, exploring questions that have shaped human thought for centuries. Whatever your interests—be it the humanities, liberal arts, agriculture, or even modern technology—Caroline College offers a broad academic experience that nurtures both intellectual curiosity and personal growth.\nThough we are no longer a religious institution, our deep spiritual heritage remains an integral part of the Caroline College experience. Our campus fosters a thoughtful environment where students are encouraged to reflect not just on academic challenges, but on their place in the world and their potential to impact it.\nIn the coming weeks, you will receive further details about your orientation, class registration, and housing assignments. Should you have any questions, feel free to reach out to our Admissions Office at (608) 555-5678.\nOnce again, welcome to Caroline College. I look forward to meeting you this fall and witnessing the new chapter you will write in our shared history.\nWarm regards,\nDr. Daniel J. Stanton\nPresident, Caroline College\nClass of 1937"},"01-Caroline-College/03-The-College/00-Information/01-Campus-Directory":{"title":"Campus Directory","links":["01-Caroline-College/03-The-College/01-Locations/Prairie-Hall","01-Caroline-College/03-The-College/01-Locations/Sister-Sarah’s-Teaching-Hospital","01-Caroline-College/03-The-College/01-Locations/Applied-Health-and-Nursing-Center"],"tags":["TTRPG","Horror"],"content":"Caroline College: Campus Directory\n\n\nPrairie Hall\n\nBuilt: 1856\nDescription: The oldest structure on campus, Prairie Hall was the first building constructed for the original Prairieville School. Now a historic museum, it houses artifacts from early Wisconsin life and stands as a testament to the school’s origins in education. The building sits atop an elaborate basement which houses most of the artifacts.\n\n\nFounder&#039;s Hall\n\nBuilt: 1862, relocated 1945\nDescription: Founder&#039;s Hall, originally constructed after the rebuilding of the Prairieville School in 1862, now serves as the college&#039;s alumni center. It was relocated in 1945 to make way for campus land expansion and construction.\n\n\nMorgan Lafayette Liberal Arts Center\n\nBuilt: 1950\nDescription: A bustling center for liberal arts, the Lafayette Center encourages interdisciplinary collaboration and intellectual discourse. Its modernist architecture was funded through significant post-war grants, supporting the growth of liberal education.\n\n\nDuff Business Center of Excellence\n\nBuilt: 1949\nStudent Nickname: DBC\nDescription: The Duff Business Center is home to the esteemed business program, offering real-world opportunities for students through partnerships with local industries. Its growth was fueled by post-WWII funding aimed at developing future leaders in business.\n\n\nRite Hall\n\nBuilt: 1875\nStudent Nickname: Admin\nDescription: Serving as the administrative core of Caroline College, Rite Hall houses student services, faculty offices, and administrative departments. This stately building has long been the backdrop for important college events and student support services.\n\n\nBrown Science Complex\n\nBuilt: 1945-1954\nStudent Nickname: The Dungeon\nDescription: The Brown Science Complex consists of interconnected buildings dedicated to advancing scientific inquiry. The complex was developed with government support to enhance STEM education post-WWII.\nBuildings Include:\n\nCastelaz Building and Observatory (physical sciences): the crown jewel of the Brown complex, the observatory houses a stunning 30-inch refractor telescope, the Wright Telescope; one of the largest student-operated telescopes in the Midwest.\nGardner Mathematics Hall (mathematics and parapsychology):  Gardner Hall is a  striking example of modern architectural prowess that houses a thriving mathematics department. At the heart of Gardner Mathematics Hall lies the Great Hall, a breathtaking three-story atrium with soaring ceilings and intricate glasswork that bathe the space in natural light. Here, students gather to collaborate on complex problems, attend guest lectures, and engage in spirited debates – all within an atmosphere of intellectual rigor and camaraderie.\nLuttermoser Science Hall (biological and chemical sciences): The centerpiece of Luttermoser Science Hall is the Atrium of Discovery, a vast open-plan space that encourages interdisciplinary collaboration and exchange among faculty and students. Here, you&#039;ll find interactive exhibits, artwork inspired by scientific concepts, and even a living wall of plants.\nThe Obelisk of Nekhbet (monument): On permanent loan from Cairo University. Installed in 1954, the Obelisk stands as a symbol of the college’s commitment to global cultural awareness and intellectual exchange.\n\n\n\n\nScarlet Center for Women’s Studies\n\nBuilt: 1970\nDescription: A focal point for research and study of gender studies, law, forensic science and social justice issues, the Scarlet Center is a progressive space dedicated to intellectual exploration. Its development was part of a post-war expansion to support diverse academic programs.\n\n\nAdda F. Howie Center for Agricultural Theory\n\nBuilt: 1958\nDescription: Named after a trailblazing figure in agricultural science, the Howie Center connects theoretical agricultural studies with practical applications. The center’s programs have been instrumental in modernizing regional agricultural practices.\n\n\nC.D. Levi Agriculture Science Complex\n\nBuilt: 1901\nStudent Nickname: The Farm\nDescription: Known for its extensive greenhouses and experimental farms, &quot;The Farm&quot; provides hands-on experience in agriculture. The complex’s expansion after WWII reflects the nation’s emphasis on sustainability and food security.\n\n\nLantern Memorial Park, Reflecting Pool, and Cemetery\n\nEstablished: 1939\nStudent Nickname: The Swinging Tree\nDescription: A serene spot for reflection, Lantern Memorial Park commemorates the life of visiting artist Elijah Kane. It offers a peaceful place for students to gather, surrounded by nature and tranquility.\n\n\nPrairie Dog Stadium\n\nBuilt: 1914\nDescription: Home to the Prairie Dogs baseball team, this stadium fosters community spirit and competition. The facility is also used for various campus events, including intramural sports and large gatherings.\n\n\nThe Burrow\n\nBuilt: 1968\nStudent Nickname: Student Center\nDescription: As the social hub of campus, The Burrow provides spaces for student organizations, recreational activities, and events. This lively center encourages students to engage with their peers and build lasting friendships.\n\n\nHo-Chunk Cultural Heritage Museum\n\nBuilt: 1955\nStudent Nickname: HCC\nDescription: The HCC museum showcases the rich history and cultural contributions of Wisconsin&#039;s Ho-Chunk Nation. It serves as an educational space where students and visitors can learn about indigenous heritage.\n\n\nS. Fields Building\n\nBuilt: 1885\nStudent Nickname: SFB\nDescription: This building houses the departments of anthropology and sociology. It offers students the opportunity to explore societal structures and human behavior through comprehensive research programs.\n\n\nPhilip Love Aquatic Center\n\nBuilt: 1975\nStudent Nickname: The Pool\nDescription: The newest facility on campus, the Philip Love Aquatic Center boasts both indoor and outdoor pools, offering opportunities for recreational swimming, water sports, and scuba certification.\n\n\nRutherford-Walsh Mann Track and Sport Field\n\nBuilt: 1901\nDescription: A key athletic facility, this complex supports track and field events, intramural sports, and physical education classes. Its construction reflected the post-war emphasis on physical fitness and community well-being.\n\n\nMcElhenney Journalism School and Communications Center\n\nBuilt: 1955\nDescription: A center for media and communications studies, McElhenney School trains students in modern journalism practices. The school’s graduates have gone on to work in national media outlets, reflecting its reputation for excellence.\n\n\nBowstein Center of Philosophy and Religious Research\n\nBuilt: 1869\nDescription: The Bowstein Center engages students with global philosophical and religious traditions. The center’s vast library and connections with international scholars make it a vibrant hub for intellectual exchange.\n\n\nGale Veterinary Hospital and Training School\n\nBuilt: 1957\nDescription: This hospital specializes in the treatment of large animals, providing students with hands-on veterinary training. It serves both the campus and the surrounding agricultural community.\n\n\nResearch Greenhouses (Plant Science Research)\n\nBuilt: 1953\nDescription: The Research Greenhouses offer state-of-the-art facilities for plant science and agriculture. Students here work on projects related to sustainability, conservation, and crop development.\n\n\nWest Maintenance Building\n\nBuilt: 1946\nStudent Nickname: The Dump\nDescription: Housing the campus facilities management team, this building ensures the maintenance and smooth operation of the entire campus, from heating systems to grounds keeping. A few industrial arts courses are even taught here. The students who choose to engage are given the opportunity to learn and help their school!\n\n\nCampus Security Station\n\nBuilt: 1888\nStudent Nickname: The Jail\nDescription: The security station monitors the campus 24/7, offering students and staff a sense of safety and peace of mind. Its modern surveillance systems keep the campus secure.\n\n\nFonseca Power Systems Research Facilities\n\nBuilt: 1960\nStudent Nickname: The Nightlight\nDescription: This engineering research facility provides students with unparalleled opportunities in civil, electrical, and mechanical engineering. Its advanced labs and technology help foster the next generation of engineers.\n\n\nDon Peachy Center for the Performing Arts\n\nBuilt: 1956\nDescription: A vibrant space for theater and music, the Don Peachy Center is home to numerous student performances and cultural events. Its folk and ethnic music programs are renowned in the region.\n\n\nFine Arts Building\n\nBuilt: 1899\nStudent Nickname: The Fab\nDescription: The Fine Arts Building, constructed in 1899, stands as one of the oldest structures on campus, housing studios, galleries, and classrooms for the college’s art programs. Originally named after a prominent local patron, its title was quietly changed in 1923 following a scandal that has since been buried, leaving it now known simply as the Fine Arts Building.\n\n\nJ. Sawyer Amphitheater\n\nBuilt: 1937\nStudent Nickname: The Pit\nDescription: This expansive outdoor venue hosts concerts, guest speakers, and campus-wide events. Its open-air design provides a picturesque setting for graduation ceremonies.\n\n\nPrairie Academy Teacher Training Center\n\nBuilt: 1965\nStudent Nickname: The Academy\nDescription: The Academy is a center for teacher training, returning the college to its roots. The facility is also home to the E. Rowe School for the Gifted, providing specialized education for exceptional students.\n\n\nSterling Men’s Dormitory and E. Root Women’s Dormitory\n\nBuilt: 1950\nDescription: These dormitories provide comfortable housing for students from all corners of the country. Their location in the heart of campus ensures students are close to academic and social life.\n\n\nDennis W. Dark Ecology Research Center\n\nBuilt: 1961\nDescription: This research station offers students the opportunity to study the region’s native ecology, with advanced technology for weather tracking and ecological research. Advanced ecology and environmental laboratory work is performed here.\n\n\nAnnex Buildings\n\nBuilt: 1863\nStudent Nickname: The Attics\nDescription: Originally constructed to house soldiers during the Civil War, these buildings are now used for storage. They stand as a reminder of the college&#039;s long history and connection to national events.\n\n\nQubit Tower\n\nBuilt: 1968\nStudent Nickname:  The Brain\nDescription: Qubit Tower is home to two of the most powerful supercomputers in the Midwest, offering students unique opportunities in computational research and data science.\n\n\nRevival Study Center (Classical Studies)\n\nBuilt: 1870\nDescription: A center for the study of classical languages, archology and ancient civilizations, this facility hosts a comprehensive collection of rare texts and artifacts, fostering academic excellence in classical studies.\n\n\nJ. W. Midnight Library\n\nBuilt: 1955\nDescription: The campus library offers extensive resources for students, including rare books, archives, and study spaces. Librarians are available to assist students in their academic pursuits. Library science courses are offered in basement levels 1 and 2.\n\n\nSister Sarah’s Teaching Hospital\n\nBuilt: 1927\nDescription: A teaching hospital providing top-notch medical services to the campus and community, as well as training opportunities for healthcare students in clinical settings. It offers coursework in pre-med as well as provide facilities for biological labs.\n\n\nApplied Health and Nursing Center\n\nBuilt: 1966\nDescription: The Applied Health and Nursing Center is a modern, multi-story facility that serves as the hub for Caroline College’s nursing and health education programs. Equipped with state-of-the-art simulation labs, clinical classrooms, and research spaces, the center provides hands-on training for students pursuing careers in healthcare. Its proximity to Watashuka’s teaching hospital ensures a seamless integration of academic learning with real-world clinical experience, preparing students for immediate entry into the healthcare field.\n\n\nSt. John&#039;s Lutheran Chapel\n\nBuilt: 1890\nDescription: The oldest Lutheran chapel on a public college campus in the region, St. John’s offers classes in religious studies and serves the spiritual needs of the student body. Graduate work in comparative religion and philosophy is offered here.\n\n\n[WCTU](WCTU Radio Station)\n\nOverview: The campus radio station at Caroline College. It is housed in the McElhenney Journalism School.  The station is run by a mix of students and fulltime staff. Fulltime staff includes:\n\nMichelina Plum, who hosts the late-night show &quot;Night Vibes.&quot; from 10:00pm to 5:00 am. The show focuses on classical musical to sleep and study to.\nAlbert Hawkins, who hosts the early morning news and Americana program &quot;News and Roots&quot; from 5:00 am to noon.\n\n\nWCTU AM Radio (Public Radio On The Campus Of Caroline College)\n\n\n\n\nClubs and Societies\nBelow are 20 clubs and societies with you might engage with in and around the college. Each includes associated Call of Cthulhu skills.\n\nGreat Lakes Archaeological Society\n\nSkills: Archaeology, History\nStory Hooks: Discovering Native American artifacts linked to ancient rituals; uncovering local historical sites.\n\n\nCaroline College Debate Club\n\nSkills: Persuade, Fast Talk\nStory Hooks: Debating controversial topics that stir up hidden tensions; uncovering faculty secrets.\n\n\nPeach Street Library Occult Studies Group\n\nSkills: Occult, Library Use\nStory Hooks: Access to obscure local folklore; accidental involvement with real supernatural forces.\n\n\nFolklore and Mythology Circle\n\nSkills: Anthropology, History\nStory Hooks: Exploring regional legends; finding connections between myths and current strange occurrences.\n\n\nCaroline Science Association\n\nSkills: Science (choose one), Mechanical Repair\nStory Hooks: Experiments affected by mysterious phenomena; encountering anomalies in nature.\n\n\nLiterary Appreciation Society\n\nSkills: Language (Own or Other), Art/Craft (Literature)\nStory Hooks: Uncovering hidden messages in classic literature; meeting reclusive authors with dark secrets.\n\n\nPsychology and Wellness Club\n\nSkills: Psychology, Psychoanalysis\nStory Hooks: Exploring the minds of troubled students; encountering mind-altering experiences.\n\n\nOutdoor Adventure Club\n\nSkills: Navigate, Survival\nStory Hooks: Organizing trips into the nearby forests; discovering hidden places and strange happenings.\n\n\nThespian Troupe of Caroline\n\nSkills: Acting, Disguise\nStory Hooks: Performing plays that have unexpected effects; blurring lines between roles and reality.\n\n\nAstronomy Enthusiasts of Caroline\n\nSkills: Astronomy, Spot Hidden\nStory Hooks: Observing unexplained celestial events; contact with cosmic entities.\n\n\nStrategy Games Club\n\nSkills: Strategy Game (Chess), Spot Hidden\nStory Hooks: Strategic contests with unusual stakes; deciphering patterns that hint at larger schemes.\n\n\nCaroline Art Collective\n\nSkills: Art/Craft (Painting, Sculpture)\nStory Hooks: Art that seems to come alive; students disappearing after creating certain pieces.\n\n\nMusic Appreciation Group\n\nSkills: Art/Craft (Music), Listen\nStory Hooks: Composing or playing music that has strange effects; instruments with mysterious origins.\n\n\nWatashuka Historical Preservation Society\n\nSkills: History, Library Use\nStory Hooks: Efforts to preserve local history uncover hidden truths; dealing with those who want the past forgotten.\n\n\nLakeview Cryptid Hunters\n\nSkills: Natural World, Track\nStory Hooks: Searching for legendary creatures said to inhabit local areas; encounters with the unknown.\n\n\nPhilosophical Inquiry Club\n\nSkills: Philosophy, Occult\nStory Hooks: Discussions that lead to unsettling realizations; questioning reality itself.\n\n\nLanguage and Culture Exchange\n\nSkills: Language (Other), Anthropology\nStory Hooks: Connecting with international students; discovering ancient languages with hidden power.\n\n\nSelf-Defense and Martial Arts Club\n\nSkills: Fighting (Brawl), Dodge\nStory Hooks: Learning techniques with unexpected origins; defending against unseen threats.\n\n\nPhotography and Journalism Society\n\nSkills: Photography, Spot Hidden\nStory Hooks: Capturing images that reveal more than meets the eye; investigating stories that others avoid.\n\n\nOur Earth Group\n\nSkills: Biology, Survival\nStory Hooks: Protecting local environments leads to strange discoveries; nature behaving unpredictably.\n\n\n\nKeeper&#039;s Note: Involvement in clubs can provide:\n\nSkill Bonuses: Gain a +5% bonus to associated skills while active in the club.\nStory Opportunities: Clubs can introduce unique quests, NPCs, and resources.\nPotential Risks: Groups can grant mechanical benefits as well as possible contacts. But some clubs may be fronts for groups your character may not wish to draw attention from.\n"},"01-Caroline-College/03-The-College/00-Information/02-Academic-Calendar":{"title":"Academic Calendar","links":[],"tags":["TTRPG","Horror"],"content":"1983 - 1984\nFall Semester\n\nAugust 18 - Registration for late afternoon, evening, and Saturday classes.\nAugust 19-20 - Registration\nAugust 20 - Last day to withdraw from classes with a full refund of tuition and fees.\nAugust 22 - Classes begin\nAugust 24 - Last day for late registration\nAugust 26 - Last day for Program Change\nSeptember 5 - Labor Day holiday\nSeptember 6 - Last day to withdraw from classes with a full refund minus service fee\nSeptember 9 - Last day for undergraduate students to apply and pay fee for graduation in December\nSeptember 20 - Last day to withdraw from classes with a partial refund\nSeptember 30 - Last day to withdraw with a mandatory &#039;W&#039; grade from a full semester class\nOctober 1 - Parent&#039;s Day\nOctober 14 - Fall Break\nOctober 17 - Classes resume at 8 a.m.\nOctober 29 - Homecoming\nNovember 18 - Last day to withdraw from a class or from the University, and to remove the Credit/No Credit option\nNovember 23 - Thanksgiving vacation begins at 5:30 p.m.\nNovember 28 - Classes resume, 8 a.m.\nDecember 12-16 - Finals\nDecember 21 - Final grades posted by 5:30 p.m.\n"},"01-Caroline-College/03-The-College/00-Information/Caroline-College":{"title":"About Caroline College","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka"],"tags":["TTRPG","Horror"],"content":"Welcome to Caroline College: Rooted in Tradition, Driven by Innovation\nFounded in 1856 as Prairieville Academy, Caroline College has been at the heart of Wisconsin&#039;s frontier history for over a century. Located in the picturesque town of Watashuka, nestled between rolling hills and just a short drive from Lake Geneva, our campus offers the perfect blend of historic charm and cutting-edge facilities. We honor our heritage while embracing the future—just as the founders of Prairieville Academy envisioned.\nGo Prairie Dogs! At Caroline College, we take great pride in our mascot, the Prairie Dog. Just like our tenacious mascot, our students are known for their resilience, teamwork, and school spirit. Whether you&#039;re cheering on our teams at Prairie Dog Stadium or collaborating with classmates on a project, you&#039;ll feel the energy and camaraderie that define Caroline College.\nAcademic Excellence Meets Technological Advancement While we celebrate our rich frontier past, Caroline College is home to modern, world-class facilities. Our Qubit Tower, housing two of the most powerful supercomputers in the Midwest, stands as a testament to our commitment to cutting-edge research and technological innovation. In addition, our Brown Science Complex, including the Castelaz Building and Observatory and the Luttermoser Science Hall, equips students in the physical, biological, and chemical sciences with the tools they need to thrive in their fields. Whether you&#039;re stargazing at the Wright Telescope or conducting hands-on experiments, Caroline College is a hub for discovery.\nSpiritual Legacy Though no longer a religious institution, Caroline College remains deeply tied to its spiritual roots. The school’s founding as a religious teaching academy continues to shape our values and traditions. Our campus reflects this legacy, fostering an atmosphere of intellectual curiosity and ethical reflection, grounded in our shared history.\nA Scenic and Connected Campus Our idyllic campus combines serene, tree-lined walkways with modern conveniences, offering students the best of both worlds. Located just 100 miles from Chicago and 60 miles from Milwaukee, Caroline College provides access to vibrant city life while offering a peaceful, focused environment for learning and personal growth.\nJoin Us at Caroline College At Caroline College, tradition meets innovation. We invite you to become part of a proud legacy that began with Prairieville Academy and continues today with unmatched academic opportunities, a vibrant campus life, and a commitment to student success.\nExplore Caroline College, where you’ll find your place in history and your path to the future. Go Prairie Dogs!"},"01-Caroline-College/03-The-College/01-Locations/Applied-Health-and-Nursing-Center":{"title":"Applied Health and Nursing Center","links":["01-Caroline-College/03-The-College/00-Information/Caroline-College","01-Caroline-College/03-The-College/01-Locations/Sister-Sarah’s-Teaching-Hospital"],"tags":["TTRPG","Horror"],"content":"Overview\n\nDescription:\nThe Applied Health and Nursing Center is a modern, multi-story facility constructed in 1966 as part of the college’s post-war expansion. It is located in the Northeast section of Caroline College campus. Designed to support the growing demands for healthcare education, this building is the central hub for nursing and health sciences programs at Caroline College. It houses state-of-the-art simulation labs, clinical classrooms, and research spaces, all designed to provide students with hands-on experience.\nThe building’s functional, modernist design reflects the utilitarian architectural style of the era. Large, rectangular windows and light grey concrete panels define the exterior, while the interior offers fully equipped medical training rooms, including emergency response simulators, basic care labs, and anatomy study rooms. Its proximity to Sister Sarah’s Teaching Hospital allows students to easily transition between classroom learning and clinical practice, enhancing their preparation for careers in healthcare.\nDepartment Heads:\n\nDr. Rachel Tomlin – Director of Nursing: An experienced healthcare professional, Dr. Tomlin leads the department with a focus on emergency medicine, patient care, and public health training. She also teaches Basic First Aid and CPR, as well as advanced nursing skills .\n\nFacilities:\n\nSimulation Labs: Designed to mimic real-world healthcare settings, these labs allow students to practice patient care, emergency response, and diagnostic techniques in a controlled environment.\nClinical Classrooms: Equipped for both lecture-based and hands-on learning, these rooms support courses ranging from nursing fundamentals to advanced medical procedures.\nResearch Areas: The center includes spaces dedicated to health sciences research, where students collaborate on projects related to public health and nursing innovation.\n\nThe Applied Health and Nursing Center provides a robust learning environment that integrates academic instruction with real-world medical training, ensuring graduates are fully prepared to enter the healthcare workforce ."},"01-Caroline-College/03-The-College/01-Locations/Prairie-Hall":{"title":"Prairie Hall","links":["01-Caroline-College/03-The-College/00-Information/Caroline-College"],"tags":["TTRPG","Horror"],"content":"Overview\n\nPrairie Hall with the Qubit Tower in the background.\nPrairie Hall is a small, historical log cabin located at the heart of Caroline College campus. Originally built in 1856 as part of Prairieville Academy, it holds the distinction of being the first permanent structure associated with the college. Over the years, it has served various functions but is now preserved as a museum celebrating the early history of the school and the surrounding region.\nThe building is 20&#039; x 12&#039; and features simple, frontier-style construction with logs and a stone chimney. Inside, visitors will find artifacts from the 19th century, including tools, books, and furnishings that reflect early Wisconsin pioneer life. The museum provides a glimpse into the lives of the school’s founders and the region’s history. Below the cabin, two basement levels house additional exhibits and storage, where older records and artifacts are carefully maintained for educational purposes.\nThe Prairie Hall Museum is a favorite among history majors and tourists alike, offering a quiet retreat from the busier parts of campus. Some students debate whether the current building is the original cabin or a reconstruction following its near destruction during the 1860 conflict that devastated the academy. While it’s a topic of discussion, no official documents confirm either theory."},"01-Caroline-College/03-The-College/01-Locations/Sister-Sarah’s-Teaching-Hospital":{"title":"Sister Sarah’s Teaching Hospital","links":["01-Caroline-College/03-The-College/00-Information/Caroline-College","01-Caroline-College/04-Watashuka/00-Information/Watashuka"],"tags":["TTRPG","Horror"],"content":"Overview\n\nBuilt: 1927\nLocation: West side of Caroline College campus\nOriginal Purpose: Teaching hospital and medical training facility for Caroline College\nCurrent Role: Active medical center for both the Caroline College campus and the wider Watashuka community, with a focus on medical research and healthcare education.\nHistory\nSister Sarah’s Teaching Hospital was founded in 1927 to support Caroline College’s expanding medical programs and provide healthcare services to the town of Watashuka . Named after Sister Sarah Wilkins, a nurse and philanthropist who dedicated her life to improving healthcare access in the region, the hospital has served as a vital teaching and treatment center for nearly a century. In its early years, the hospital specialized in nursing education and general medical care, while supporting the growing medical and biological sciences programs at Caroline College.\nThe hospital expanded significantly in the 1950s, adding new laboratories for advanced biological research. Since then, Sister Sarah’s has become a key part of Caroline College’s pre-medical and biological sciences programs, offering students hands-on training in medicine, human biology, and health sciences.\nModern Role\nToday, Sister Sarah’s Teaching Hospital is both a working medical facility and a teaching hospital for students in various healthcare fields. The hospital includes state-of-the-art labs used for medical research, nursing education, and biology classes. Many of Caroline College’s pre-med students receive their training here, working alongside healthcare professionals to gain practical experience. The hospital’s facilities include general medical wards, maternity services, and medical science classrooms that are frequently used by college faculty and students.\nNotable Features\n\nBiology Labs: A key location for the college’s biology courses, these labs provide hands-on experiences for students studying human, animal and plant biology.\nGeneral Practice: Sister Sarah&#039;s is more than a teaching faculty, it provides the region with all of its primary medical care. If a situation requires more advanced equipment or specialized staff, the hospital maintains connections with hospitals in Milwaukee and Madison.\nMaternity Ward: The maternity ward serves the Watashuka community, providing obstetric and prenatal care. It is also used for teaching purposes in medical courses related to childbirth and women’s health.\nMedical Classrooms: These rooms host a variety of courses in human anatomy, medical ethics, and healthcare procedures, offering students an opportunity to learn in a professional medical setting.\n\nCommunity Impact\nSister Sarah’s Teaching Hospital plays a significant role in both the college and the town of Watashuka. It is a trusted healthcare provider for the local community and a critical part of the educational infrastructure at Caroline College. The hospital continues to innovate in medical research while maintaining its longstanding commitment to training the next generation of healthcare professionals."},"01-Caroline-College/03-The-College/01-Locations/WCTU":{"title":"WCTU","links":["01-Caroline-College/03-The-College/00-Information/Caroline-College","01-Caroline-College/03-The-College/02-People/Michelina-Plum"],"tags":["TTRPG","Horror"],"content":"Overview\n\nWCTU is the student-run radio station of Caroline College, broadcasting on AM radio. Its slogan, &quot;The Heartbeat of Watashuka,&quot; highlights its connection to the campus and the surrounding community. WCTU features a wide range of shows, from music to talk radio, often showcasing indie bands and student discussions. The station is a popular place for college students to unwind, either by tuning in or by participating as DJs.\n\n\nLocation: Housed in the basement of the McElhenney Journalism School, the WCTU studio is small, cluttered, and packed with old records, tapes, and broadcasting equipment. The walls are lined with posters of bands and events, creating a vibrant yet somewhat chaotic atmosphere. The station operates 24/7, with students rotating shifts.\n\n\nPopular Programs:\n\n&quot;Night Vibes&quot;: A late-night show hosted by Michelina Plum that plays classical and ambient music, providing a calm, relaxing soundtrack for late-night studying or sleep.\n&quot;News and Roots&quot;: A morning show hosted by Albert Hawkins, blending local news, weather, and folk music. It&#039;s a favorite for students and early risers who prefer a mellow start to their day.\n&quot;College Chaos&quot;: A high-energy, student-hosted talk show featuring the latest in college gossip, pranks, and music. It’s often the go-to for Caroline College students looking to blow off steam.\n\n\n\n\nWCTU Radio Station Weekly Program Schedule (Fall 1983)\n5:00 AM – 9:00 AM: &quot;News and Roots&quot; (Mon-Fri)\n\nHost: Albert Hawkins\nDescription: A morning blend of local news, weather, and Americana/folk music to kick off the day. Albert keeps students and locals informed on current events in both Watashuka and the Caroline College campus.\n\n\n9:00 AM – 9:30 AM: &quot;Morning Report&quot; (Mon-Fri)\n\nHost: Various (Student Contributors)\nDescription: A quick local news segment that covers campus life, community updates, and interviews with key figures from the college and the town.\n\n\n9:30 AM – 12:00 PM: &quot;Lunch Break Jams&quot; (Mon-Fri)\n\nHost: Julia Richards (Replaced in March 1983 after Sam Lang’s disappearance)\nDescription: Popular music and song requests to brighten up midday. College students and staff often phone in with quirky stories and requests for shout-outs.\n\n\n12:00 PM – 12:30 PM: &quot;Midday Report&quot; (Mon-Fri)\n\nHost: Various (Student Contributors)\nDescription: Midday news featuring sports, events, and some talk of local politics. A casual but informative show for those needing a brief update during lunch.\n\n\n12:30 PM – 2:00 PM: &quot;The Study Hour&quot; (Mon-Fri)\n\nHost: Carl Yates\nDescription: Classical music and instrumental tracks meant to help students focus on their studies. Quiet, thoughtful commentary with minimal interruptions.\n\n\n2:00 PM – 4:00 PM: &quot;College Chaos&quot; (Mon-Fri)\n\nHost: Rotating student hosts (Current: Matt and Liz)\nDescription: A high-energy, fun show focusing on gossip, college life, and pop culture. Call-ins from students make this show an unpredictable favorite.\n\n\n4:00 PM – 4:30 PM: &quot;Evening Report&quot; (Mon-Fri)\n\nHost: Various (Student Contributors)\nDescription: A late-afternoon news update covering the day&#039;s headlines, local happenings, and student events. Quick interviews with students and staff cap off the day.\n\n\n4:30 PM – 6:00 PM: &quot;Golden Oldies&quot; (Mon-Fri)\n\nHost: Jack Carter (Replaced Ron Sterling&#039;s)\nDescription: A nostalgic trip through classic rock, jazz, and &#039;50s/&#039;60s hits. Jack shares fun facts and stories behind the music.\n\n\n6:00 PM – 8:00 PM: &quot;The Alternative&quot; (Mon-Fri)\n\nHost: Annie Tran\nDescription: Alternative, underground music that introduces students to up-and-coming bands and unique tracks not heard on mainstream radio.\n\n\n10:00 PM – 5:00 AM: &quot;Night Vibes&quot; (Mon-Fri)\n\nHost: Michelina Plum\nDescription: A late-night show of classical, ambient music to relax or study by. Michelina’s soft voice and ethereal playlists help late-night listeners unwind.\n\n\nSaturday and Sunday Weekend Programming\n\n5:00 AM – 7:00 AM: &quot;Watashuka Lutheran Hour&quot; (Sundays Only)\n\nHost: Pastor Daniel Mueller\nDescription: A weekly sermon, religious music, and reflections from Pastor Mueller, the head of All Saints Church in Watashuka. He delivers community prayers and thoughtful messages.\n\n\n7:00 AM – 9:00 AM: &quot;Reflections of Faith&quot; (Sundays Only)\n\nHost: Father Jeremy Rotten (from Caroline College’s St. John’s Chapel)\nDescription: Discussions on faith, philosophy, and classical religious texts. Father Rotten engages with a more academic audience, blending religious reflection with college life.\n\n\n9:00 AM – 11:00 AM: &quot;Soundtrack Saturdays/Sundays&quot; (Sat-Sun)\n\nHost: Linda Myers (Replaced Mark Philips)\nDescription: Focused on scores from movies, television, and video games, Linda explores the historical and musical significance of iconic soundtracks.\n\n\n11:00 AM – 1:00 PM: &quot;Community Voices&quot; (Saturdays Only)\n\nHost: Various Local Guests\nDescription: A community program where Watashuka locals discuss their interests, from town issues to local hobbies. Mothers Opposing Metal often make appearances, passionately decrying the influence of heavy metal on the town&#039;s youth.\n\n\n1:00 PM – 3:00 PM: &quot;Live from Campus&quot; (Saturdays Only)\n\nHost: Various Campus Musicians\nDescription: Live performances by Caroline College students, showcasing the diversity of talent on campus. Students submit their music or perform live for listeners.\n\n\n3:00 PM – 5:00 PM: &quot;The Vinyl Vault&quot; (Sat-Sun)\n\nHost: Fred Hollister\nDescription: Rare and forgotten records, covering everything from old jazz and blues to 1960s folk music. Fred&#039;s deep knowledge of music history makes this a hit with collectors.\n\n\n5:00 PM – 7:00 PM: &quot;Mystery Hour&quot; (Sat-Sun)\n\nHost: Greg Tanner (Replaced in Melissa Young)\nDescription: Radio drama featuring serialized detective stories and thrillers. Sometimes features scripts written by students or adaptations of classic mysteries.\n\n\n7:00 PM – 9:00 PM: &quot;Midnight Musings&quot; (Sundays Only)\n\nHost: Alice Graves\nDescription: Poetry readings, quiet jazz, and philosophical discussions to end the week on a reflective note.\n\n\n9:00 PM – 12:00 AM: &quot;Underground Echoes&quot; (Saturdays Only)\n\nHost: David Scott (Replaced Amy Lewis)\nDescription: A showcase of obscure, underground tracks from local and international scenes. This show is beloved by students who enjoy experimental and offbeat music.\n"},"01-Caroline-College/03-The-College/02-People/Dr.-Daniel-J.-Stanton":{"title":"Dr. Daniel J. Stanton","links":["01-Caroline-College/03-The-College/00-Information/Caroline-College","01-Caroline-College/04-Watashuka/00-Information/Watashuka"],"tags":["TTRPG","Horror"],"content":"Dr. Daniel J. Stanton\nPresident, Caroline College\nClass of 1937\n\nDr. Daniel J. Stanton has been the president of Caroline College since 1974. A proud alumnus, Dr. Stanton returned to his alma mater to lead the college into a new era of growth and innovation. Under his leadership, Caroline College has expanded its programs, modernized its facilities, and strengthened its ties with the local community. His contributions to the college’s advancements include the development of the Philip Love Aquatic Center.\nDr. Stanton earned his doctorate in internal business affairs, building on his successful career in international trade and commerce. He holds and honorary doctorate in education from a major university in Massachusetts.  After World War II, he established a thriving import business, focusing on Asian markets, which supported post-war economic recovery efforts. Through his business acumen, Dr. Stanton has made significant contributions to both the educational and business worlds, and his leadership has helped Caroline College rise to new heights.\nKnown for his charismatic leadership style and business expertise, Dr. Stanton is a vocal proponent of small government, believing in the power of private enterprise and individual initiative. His commitment to both the college and the greater Watashuka community reflects his deep sense of duty and dedication to education."},"01-Caroline-College/03-The-College/02-People/Katherine-Coates":{"title":"Professor Katherine Coates","links":["01-Caroline-College/03-The-College/00-Information/Caroline-College"],"tags":["TTRPG","Horror"],"content":"\nProfessor Katherine Coates\nIn a cluttered office filled with stacks of newspapers and journalism textbooks, a woman is angry; very angry. She sits at her desk, tapping her pencil against a file of student stories. Her short, curly hair bounces slightly as she leans forward to read an article submission more closely. &quot;This needs more depth,&quot; she mutters to herself before scribbling notes in the margins. She pushes her glasses up the bridge of her nose and looks out the window. She is fuming. She&#039;s going to reject this article for the Crier. She knows it. She also knows its wrong. &quot;Not enough reference material. No interviews. Topic is not worth exploring further.&quot; Stacy is a good student and she&#039;ll be hurt that her article was rejected for unfair reasons but she&#039;ll get over it. She&#039;ll rise above it.\nCoates puts the marked up document in her out box. The title &quot;What Happens On Campus After Midnight?&quot; can be seen sticking out. The professor turns on the campus radio and calms down. &quot;College Chaos&quot;. Right show, right time. No interruptions.\nRole/Title:\nHead of the Journalism Department at Caroline College, Faculty Advisor for The Crier (student newspaper)\nDescription:\nProfessor Katherine Coates is the head of the Journalism Department at Caroline College, where she teaches investigative journalism and ethics. Known for her no-nonsense approach to journalism, Katherine is deeply passionate about the role of the press in society and its potential to expose corruption and inspire change. Her idealism and dedication to journalistic integrity make her a well-respected figure among students, though some find her methods rigid. Katherine also serves as the faculty advisor for The Crier, the college’s student-run newspaper, where she pushes students to dig deeper and challenge the status quo."},"01-Caroline-College/03-The-College/02-People/Michelina-Plum":{"title":"Michelina Plum","links":["01-Caroline-College/03-The-College/01-Locations/WCTU","01-Caroline-College/05-Factions/Mothers-Opposing-Metal-Keeper","01-Caroline-College/04-Watashuka/00-Information/Watashuka"],"tags":["TTRPG","Horror"],"content":"\nMichelina Plum\n\n\nAge: 36 (in 1983)\n\n\nRole: Michelina Plum is the sultry host of Night Vibes, a late-night radio show on WCTU, Watashuka’s college radio station. Her program, running from 10:00 p.m. to 5:00 a.m., features soothing instrumental music and classical tracks aimed at helping her listeners relax during the long, quiet hours of the night. Michelina’s smooth, calming voice has earned her a dedicated following, particularly among students and night-shift workers.\n\n\nAppearance: Michelina is an attractive woman with striking red hair that falls in loose waves around her shoulders. She has sharp features and bright green eyes that stand out against her glamorous, if somewhat disheveled, appearance. Often dressed in silky, low-cut blouses, she exudes an air of confidence and mystery, especially when she’s behind the microphone. On air, Michelina’s polished, professional persona is in contrast to the sharp, more intense side of her character that only those close to her see.\n\n\nPersonality: On the radio, Michelina is known for her calm, reassuring tone, a voice that seems to ease the worries of her late-night listeners. Off-air, however, she is a different person entirely—witty, foul-mouthed, and with a sharp sense of humor. Michelina is highly political, frequently expressing her admiration for President Reagan and her disdain for the local counterculture.\n\n\nPublic Role:\n\nWCTU Radio Host: Michelina is well-known in the community for her late-night radio show, which provides a soothing soundtrack to the town’s quieter hours. She is regarded as an intellectual and a voice of reason, offering a space for Watashuka’s insomniacs, students, and night workers to find comfort in the music she plays.\nMothers Opposing Metal (MOM): Michelina is a vocal member of Mothers Opposing Metal, a conservative group that fights against the influence of heavy metal music and other perceived corruptions of youth. She frequently speaks out against the local pirate radio DJ, Dave, and the Metalheads, blaming them for the town’s moral decline.\n\n\n\nPublic Perception: Most people in Watashuka see Michelina as a respected, conservative figure who upholds traditional values and provides a calming presence through her radio show. She is known for her intelligence and her involvement in MOM, which reinforces her image as a defender of the town’s moral standards. Her sharp political views and vocal support for Reagan resonate with many of the town’s conservative residents, though there are whispers about her hidden wild side from those who know her better.\n\n"},"01-Caroline-College/04-Watashuka/00-Information/History-of-Watashuka":{"title":"History of Watashuka","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/06-Events/Blizzard-of-1888","01-Caroline-College/05-Factions/Lutheran-Church","01-Caroline-College/05-Factions/Ho-Chunk","01-Caroline-College/03-The-College/00-Information/Caroline-College","01-Caroline-College/05-Factions/Watashuka-Initiative"],"tags":["TTRPG","Horror"],"content":"History of Watashuka\n\nMay 1856 – Founding of Prairieville Academy\n\nPrairieville Academy is established as a teacher-training school (normal school) to educate future educators. The academy becomes the heart of the town of Prairieville, which later becomes Watashuka. The academy was the dream of three educators Walter Mann, Eleazar Root and John W. Sterling. There dream was to work with the local Ho-Chunk people to bring forth a new era for the region. That dream is still alive today despite setbacks.\nFounding Members\n\nWalter Mann: German immigrant, artist, head founder of the academy\nEleazar Root: Co-founder. Massachusetts school teacher, relocated\nJohn W. Sterling: Co-founder, English businessman, relocated\nElias Haskins: Co-founder, local prominent cavalrymen\nJonathan Whitmore: Co-founder, local esteemed teacher and theologian\nSarah Johnson: Co-founder, local wealthy widow and philanthropist\n\n\n\n\nAugust 1860 – Destruction of Prairieville Academy\n\nThe academy is destroyed during a violent conflict between the settlers and a rogue native tribe who attacked the school. During the attack many of the educators and founders were killed; only Eleazar Root and John Sterling survived. The academy burned down. Many blame local tensions with indigenous people on the attack. Most records from this time are lost, and it remains a tragic, but poorly understood, event in local history.\n\n\nSeptember 1862 – Rebuilding of Prairieville School\n\nIn the wake of the academy’s destruction, the Prairieville School is built to continue the region’s educational mission. Under the leadership of Eleazar Root and John W. Sterling the school thrives and grows as part of the effort to revitalize education in the region, attracting settlers to the area. Eleazar served as the school&#039;s first principal while John provided the financial and political support.\n\n\nBlizzard of 1888 - Humanitarian Aid\n\nAfter the Blizzard of 1888, large numbers of members of the Lutheran Church immigrate to the region. The first settlers arrive to provide humanitarian assistance but soon took to calling the region home.\n\n\nApril 1895 – Caroline Religious Teaching College Founded\n\nDue to the influence of Lutheran immigrants, the Caroline Religious Teaching College is established, expanding the former school into a larger institution focused on religious education. This school subsumed the Prairieville School and most agree that this was more of a renaming than a new school.\nAt the same time, the town of Prairieville is renamed Watashuka out of respect of the native peoples.\n\nA minor controversy emerged years later when it was found that name was a wild misinterpreted of the Ho-Chunk language. The intend was to have the name mean friendship or unity; symbolizing the area&#039;s different cultural influences. By the time the mistake was found the name had stuck.\n\n\n\n\n1939-1945 – World War II Efforts\n\nCaroline Religious Teaching College contributes to the war effort, with local industry and students engaging in patriotic duties. The college’s science and engineering departments grow due to wartime funding. After the war, the college continues expanding its academic programs.\n\n\n1943 – Caroline College Renamed\n\nThe college is officially renamed Caroline College after WWII, reflecting its role as a modern liberal arts institution. The post-war years brought growth and new facilities, including Sister Sarah’s Medical Center, a teaching hospital for nursing and healthcare students.\n\n\n1969 – Population Decline\n\nWatashuka’s population begins to decline in the late 1960s due to changing economic conditions; notably the closing of several government projects now deemed complete. People start leaving for larger cities like Madison and Milwaukee. The closing of some industries and the general economic downturn are seen as the reasons for this decline.\nThe Watashuka Initiative&#039;s ending dealt a major blow to the region.\n\n\n1983-Present – Present Day Watashuka\n\nWatashuka is a quiet rural town with Caroline College as its centerpiece. The town struggles economically, but the college brings new students and some level of vibrancy. Residents are largely unaware of any significant issues beyond normal small-town troubles.\n\n\n"},"01-Caroline-College/04-Watashuka/00-Information/Watashuka-Business-Directory":{"title":"Watashuka's Business Directory","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/04-Watashuka/02-People/Margaret-Wilkins","01-Caroline-College/04-Watashuka/02-People/Norm-Habersham","01-Caroline-College/04-Watashuka/01-Locations/Frozen-Cow","01-Caroline-College/04-Watashuka/02-People/Mike-and-Ruth-Garrison","01-Caroline-College/03-The-College/00-Information/Caroline-College","01-Caroline-College/04-Watashuka/01-Locations/The-Prince-New--and--Used-Books","01-Caroline-College/04-Watashuka/02-People/Dexter-Colby","01-Caroline-College/04-Watashuka/01-Locations/Berg-Farm-House","01-Caroline-College/04-Watashuka/01-Locations/Peach-Street-Library","01-Caroline-College/04-Watashuka/02-People/Sly-Coolstein"],"tags":["TTRPG","Horror"],"content":"Town of Watashuka Directory\n\n{Feel: Small-town America, where even those better off economically are still considered disadvantaged by the standards of most of the country.}\nMain Street\n\nThe Press Newsstand\n\nOwner: Margaret &quot;Marge&quot; Wilkins, a no-nonsense woman in her late 50s.\nDescription: Located on Main Street, The Press Newsstand has been a fixture in Watashuka for decades. Marge, the gruff but friendly owner, runs the small shop, which offers everything from local newspapers and national magazines to candy and cigarettes. Though small, the newsstand sees plenty of foot traffic, especially from old-timers and curious teenagers who like to pick up the latest gossip. Marge has a sharp eye for detail and always seems to know what’s going on in town.\n\n\nThe Prairie Press\n\nOwner: Norm Habersham\nEstablished: 1932\nDescription: The Prairie Press is the town’s local newspaper, and Norm has been its senior editor for over 30 years. The building is a modest, single-story office with a big front window displaying the latest headlines. Norm’s dedication to local journalism keeps the small office buzzing with activity despite the declining readership.\n\n\nFrozen Cow Burger Stand\n\nOwner: Mike and Ruth Garrison\nDescription: Mike and Ruth run this nostalgic 1950s-style burger stand. The small, red-and-white building is a summertime favorite, offering burgers, shakes, and fries to locals and tourists. But even during winter months, the place stays hopping thanks to students from Caroline College. Mike is the talkative type, while Ruth ensures everything in the kitchen runs smoothly. They frequently hire local high school and college students to help meet customers who have been known to line up out the door.\n\n\nThe Prince: New &amp; Used Books\n\nOwner: Dexter Colby\nDescription: A charming, slightly dusty bookstore filled with a carefully curated selection of new and used books. The Prince, often misidentified by students as &#039;The Prints&#039;, is known for its quiet, cozy atmosphere, with shelves that seem to go on forever. Dexter Colby, the reserved and knowledgeable owner, has been running the shop for as long as anyone can remember. He has a reputation for always being able to find rare or hard-to-find books, making The Prince a favorite spot for local book lovers and collectors alike. The store’s resident cat, Poe, is often found napping in a sunbeam near the front window.\n\n\nCreek Music Store\n\nOwner: Tom Creek\nDescription: A small, cramped store filled with violins, horns, guitars, records, and old music equipment. Tom is a gruff, middle-aged musician who loves to chat about the glory days of rock and roll. The store&#039;s walls are covered with band posters from decades past.\n\n\nDiane&#039;s VCR/TV/Typewriter Sales, Service and Movie Rental\n\nOwner: Diane Forrester\nDescription: Diane’s shop is a catch-all for aging electronics, VCR rentals, and typewriter repairs. The cluttered storefront is an intimidating mess, but Diane’s expertise keeps her loyal customers coming back. She’s known to be friendly, but a bit of a technophobe when it comes to modern computers.\n\n\nDance With Us! Studios\n\nOwner: Beth Carmichael\nDescription: Beth runs this small dance studio with passion, teaching ballet, jazz, and tap to children and adults alike. The building is an old converted warehouse with wooden floors and mirrored walls. Beth is energetic and upbeat, always encouraging her students to do their best.\n\n\nThe Hut (Electronics And Appliance)\n\nOwner: Jerry &quot;Buzz&quot; Horton\nDescription: The Hut is a compact store crammed with everything from radios to refrigerators. Buzz is a gadget enthusiast and knows every feature of the appliances he sells. The store’s slightly disorganized appearance reflects Buzz’s chaotic but friendly personality.\n\n\nWatashuka Public Services Building (City Hall, Courthouse, jail, police, fire)\n\nOwner: Public Services\nDescription: This imposing brick building serves as the town’s administrative hub. It’s home to the town’s municipal government, police, fire station, and courthouse. The staff is small but efficient, handling everything from zoning permits to civil disputes.\n\n\nWatashuka Post Office\n\nOwner: U.S. Postal Service (Postmaster: Linda Neal)\nDescription: The post office is a simple, utilitarian building with a friendly atmosphere. Linda Neal, the town’s long-serving postmaster, oversees a small team who know most customers by name. The building also serves as a gathering spot for older residents picking up their mail.\n\n\nBergmann’s Drugstore\n\nOwner: Henry Bergmann\nDescription: A classic, small-town drugstore with a soda fountain counter that harks back to the 1950s. Henry is a kindly older man who has run the pharmacy for over 40 years. His gentle demeanor makes him a favorite among locals, who rely on his store for medications and sundries.\n\n\nAlbert’s General Goods\n\nOwner: Albert “Al” Ralston\nDescription: A catch-all general store selling everything from canned food to gardening tools. Al is a no-nonsense man in his 50s with a gruff exterior but a heart of gold. The store is packed with shelves of goods, and Al seems to know where everything is in his well-worn shop. \n\n\n\nDowntown Side Streets and Alleys\n\nHanson&#039;s Hardware &amp; Building Supplies (Closed, relocated)\nFreeman &amp; Burke Attorneys at Law\n\nOwner: Sarah Freeman and Michael Burke\nDescription: A small general practice law firm specializing in family law, real estate, and business contracts. Sarah and Michael are both serious and professional but maintain a friendly rapport with their clients. Their office is located in a charming converted house on a side street near the town center.\n\n\nFixer’s Supply Co.\n\nOwner: Roy and Jean Fixer\nDescription: Roy and Jean run this well-stocked hardware and building supply store. Known for their friendly service and practical advice, the couple has made Fixer’s a go-to spot for home improvement supplies. The large building on a side street still has an old-school charm, with its wood-paneled walls and hand-painted signage.\n\n\nBlue Heron Pub &amp; Grill\n\nOwner: Paul Erickson\nDescription: A classic pub with a comfortable, lived-in feel. The Blue Heron serves as a gathering place for locals, offering simple but tasty pub food. Paul is a laid-back owner who enjoys a good conversation with his patrons, often sitting at the bar during slow hours.\n\n\nLocal Savings &amp; Loan\n\nDescription: The oldest financial institution in town, Local Savings &amp; Loan has provided banking services to residents for generations. The building is an imposing 1930s structure located off Main Street.\n\n\nWatashuka Fitness &amp; Recreation Center\n\nOwner: Jenny and Todd Mills\nDescription: A modest fitness center with an attached community gym. Jenny and Todd are fitness enthusiasts who returned to Watashuka after college to open the center. They host fitness classes and recreational leagues for the town’s youth.\n\n\nSmileWorks Dental Care\n\nOwner: Dr. Ellie Chambers\nDescription: A cheerful dental office with bright, kid-friendly décor. Dr. Ellie is a warm and caring dentist who returned to her hometown after dental school. The small building offers basic dental services with a personal touch.\n\n\nEyes on Watashuka Optometry\n\nOwner: Dr. Michael Larson\nDescription: A small, neat optometry office where Dr. Larson provides eye exams and glasses. He is soft-spoken but knowledgeable, making him a trusted figure in the community. The office has a quiet, calming atmosphere, with vintage eyeglass frames displayed as décor.\n\n\nSpin Cycle Laundry &amp; Dry Cleaners\n\nOwner: Margaret and Earl Jacobs\nDescription: A family-run laundromat with attached dry cleaning services. Margaret manages the dry cleaning side, while Earl runs the laundromat. The building is a little worn, but it’s a reliable place where locals come to clean their clothes or chat while waiting for the spin cycle to end.\n\n\nThe Stand: Community Theatre\n\nOwner: Watashuka Theatre Group (Managed by Mary Cline)\nDescription: A charming little community theater housed in a renovated church. Mary Cline is the passionate director of the theater group, which puts on performances throughout the year. The space is intimate, with just enough room for an enthusiastic crowd.\n\n\nFrontier Life History Center\n\nOwner: Watashuka Historical Society (Curator: Alan Graves)\nDescription: A small museum dedicated to Watashuka’s pioneer history. Alan Graves, the curator, is an eccentric historian who loves sharing stories of the town’s early days. The building itself is an old cabin-like structure, restored to give visitors a sense of what life was like in the past.\n\n\nWatashuka WP (Water and Power)\n\nDescription: A functional, no-nonsense utility building where the town’s water and power systems are managed. The employees are friendly but busy, ensuring that the town’s essential services run smoothly without interruption.\n\n\nAll Saints Church of Watashuka (Lutheran Church)\n\nBuilt: 1897\nHead: Pastor Daniel Mueller\nDescription: A modest but well-maintained Lutheran church with a tall steeple. Pastor Mueller is a kind and soft-spoken man who has served the congregation for over a decade. The church is a cornerstone of the community, hosting services, events, and local outreach programs.\n\n\nBakers&#039; Creamery &amp; Bakery\n\nOwners: Clint and Amanda Baker\nDescription: Located just off Main Street, this neighborhood grocery is known for its fresh-baked bread and local dairy products. Bakers&#039; is a quiet spot where locals often run into one another after church for ice cream or cookies.\n\n\nPrairie Realty\n\nOwner: Jim Halushka\nDescription: A local real estate office handling everything from farmland to residential properties. Prairie Realty has deep roots in Watashuka and plays a key role in selling historic homes and new development areas.\n\n\nRiver’s End Funeral Services\n\nOwner: The Hansen Family\nDescription: A family-run establishment that provides personalized funeral services. Known for its caring staff and beautifully maintained grounds just outside the town center.\n\n\nPetals &amp; Posies\n\nOwner: Stanley Romano\nDescription: A quaint little flower shop nestled on one of the side streets off Main. Petals &amp; Posies is beloved for its affordable, custom flower arrangements and its personal touch for every event.\n\n\nWhich In The Wardrobe\n\nOwner: Rebecca Covell\nDescription: A charming boutique offering affordable clothing and accessories for women and men. It&#039;s a place where locals can find everything from casual wear to outfits for special occasions.\n \n\n\n\nAtmosphere:\n\nWatashuka’s Main Street is the lifeblood of the town, though it has seen better days. Lined with small businesses and family-owned shops, it exudes a nostalgic charm. During the day, it bustles with locals running errands and small talk flowing between shopkeepers and customers. The sounds of typewriters, local radio, and the clinking of glasses at the Blue Heron Pub fill the air. However, as the sun sets, Main Street takes on a different tone. Shadows seem to stretch longer here, and the empty streets echo with an eerie silence. The old brick buildings, now weathered and fading, whisper of past prosperity, but there’s a creeping unease.\nThe side streets add to the town’s atmosphere of quiet decay, with narrow, cobbled roads leading to forgotten businesses like old law firms and shuttered hardware stores. These roads seem darker at night, and there’s a sense that they have stories of their own.\n\nNorthwest &quot;Sterling Hills&quot;\n {Notes: State Route 89 marks the town&#039;s western border}\n {Feel: Mostly affluent, not wealthy, but doing better than the rest of the town.}\n\nNorth High School\n\nPrincipal: Mr. Peter Clarke, a stern but fair educator who has been principal for over a decade.\nDescription: As the only remaining high school in Watashuka, North High School is vital to the town’s educational system. The building is old, with some sections dating back to the 1950s, but it&#039;s well-maintained thanks to Principal Clarke&#039;s efforts. The mysterious destruction of South High School years ago in a boiler explosion haunts the faculty, with rumors still swirling about whether it was an accident or spiteful former students.\n\n\nJack&#039;s Surfer: Comics &amp; Games\n\nOwner: Jack Hastings, an eccentric man in his 40s with a deep love for comics, tabletop role-playing games, and 80s pop culture.\nDescription: Jack’s store is a haven for local teenagers and college students. Its walls are lined with comic books, old action figures, and game paraphernalia. Jack often hosts Dungeons &amp; Dragons nights and has a hidden stash of rare comics and RPG sourcebooks for special customers. The store has a loyal following among the town’s youth, particularly those interested in metal music and counterculture, making it a target for the &quot;Mothers Opposing Metal&quot; group.\n\n\nLinda’s Beauty &amp; Hair Salon\n\nOwner: Linda Novak, a no-nonsense hairdresser in her late 50s who has been cutting hair in Watashuka for as long as anyone can remember.\nDescription: The salon is a small, cozy space with a few chairs, and Linda prides herself on knowing everyone&#039;s business. It’s where gossip spreads, and rumors about the oddities in Watashuka often start or grow here. Linda is friendly but doesn’t shy away from offering her opinion on anything. Her clients trust her judgment, making her an informal source of local news.\n\n\nWatashuka Bus Depot\n\nManager: Frank Holloway, a quiet, middle-aged man who has worked at the depot for over 20 years.\nDescription: The bus depot is a small, utilitarian building that serves as a hub for both passengers and cargo deliveries. The depot connects Watashuka to nearby cities, but the service has seen a decline over the years due to the shrinking population.\n\n\nHomes of Caroline College Faculty and Staff\n\nResidents: Various faculty and staff members from Caroline College, with a mix of younger professionals and older professors who have lived in Watashuka for decades.\nDescription: The homes in this area are modest but well-kept, mostly occupied by college faculty who commute to the campus. The homes here are older, with a sense of quiet respectability, but at night, the streets can feel eerie, as though those that stroll the quiet streets are always being watched.\n\n\nHomes of Government Staff\n\nResidents: Various staff connected to Project Caroline and other secretive government initiatives.\nDescription: On the surface, these homes seem perfectly ordinary, blending in with the rest of the northwest. However, these government workers are often more reclusive, keeping their personal lives secret due to work regulations. It&#039;s not uncommon for new families to move in suddenly without much introduction, and neighbors have learned not to ask too many questions.\n\n\n\nOutside of the town limits to the Northwest\n\nCaroline College\n\nAtmosphere\n\nSterling Hills is a peaceful and affluent part of Watashuka, home to Caroline College faculty, government staff, and some of the town’s more well-off residents. The streets are lined with mature trees and stately homes, giving the neighborhood an air of quiet respectability. On the surface, Sterling Hills feels safe and orderly, but there’s an underlying tension among the residents, particularly those with ties to the college or government projects.\nCaroline College’s campus stands apart from the town of Watashuka, its stately buildings and green lawns giving it an air of academia and history. A distance of several miles, through dense woods, separate the school from its town.\n\nNortheast &quot;Farmer&#039;s Ridge&quot;\n {Feel: Very rural, farm focused} \n\nHanson’s Hardware &amp; Building Supplies (Relocated from Downtown)\n\nOwner: Jack Hanson\nDescription: After closing the downtown location, Jack Hanson moved his hardware store to the northeast of town, closer to the rural community it serves. Jack is a gruff but helpful man, always willing to offer advice on home repairs and farming tools.\n\n\nWatashuka Co-Op Farming Supplies\n\nOwner: Co-Operative (Manager: Fred Yoder)\nDescription: A bustling co-op that provides farming supplies to local dairy farmers and crop growers. Fred Yoder, a practical man with deep roots in the Amish community, manages the co-op. The building is large and utilitarian, but always busy.\n\n\nYoder’s Amish Goods Market\n\nOwner: The Yoder Family\nDescription: A rustic market selling handmade Amish goods, including baked items, furniture, and crafts. The Yoders are a quiet but friendly family, well-known for their traditional methods and quality products. The market is a charming wooden structure with a welcoming atmosphere.\n\n\n\nOutside of the town limits to the Northeast\n\nAmish Community Border\nWatashuka Farmers\n\nAtmosphere\n\nFarmer’s Ridge is the agricultural heart of Watashuka, where life revolves around the seasons, livestock, and the land. The area feels timeless, with endless rows of crops and farmhouses dotting the landscape. There’s a peacefulness here, but also a sense of isolation. The farmers are proud and self-reliant. The Amish community nearby maintains a watchful eye while keeping their deeper knowledge to themselves.\nThe Amish lands to the northeast of Watashuka are serene and picturesque, with rolling hills, wide fields, and carefully maintained farms that seem untouched by time. Horse-drawn buggies travel along dirt roads, and the simple wooden homes and barns give the area a peaceful, pastoral quality. The air smells of fresh-cut hay and wood smoke, and the rhythmic sound of hammering and livestock creates a sense of calm industry. Life here feels slower and more purposeful, far removed from the chaos that pervades the rest of the town.\n\nSouthwest &quot;Prairieview Downs&quot;\n {Notes: Corner of State Route 89 and State Route 11 marks the town boarder} {Notes: Boarder of Ho-Chunk native people&#039;s land (further to the south west)} {Feel: Very rural, keep to themselves type people} \n\nK Squared Gas Station\n\nOwner: Kevin and Kyle Kilgore, twin brothers who run the station.\nDescription: Located on the way out of town, heading towards Caroline College, K Squared is more than just a rural gas station. It serves as a morning pit stop for students and faculty on their way to class. In addition to fuel, the store offers coffee, breakfast snacks, and basic supplies. The Kilgore brothers are known for their friendly banter and keeping tabs on the local happenings.\n\n\nAnnie&#039;s Animal and Game Processing Plant\n\nOwner: Annette &quot;Annie&quot; Martin, a tough, no-nonsense woman in her early 60s.\nDescription: Annie’s processing plant serves the rural hunting and farming communities around Watashuka. She processes everything from livestock to wild game for local farmers and hunters. The plant, located just off State Route 89, is a sprawling complex that smells of blood and meat. Annie has worked here her whole life.\n\n\nStreamwader&#039;s Hunting Goods\n\nOwner: Jim Watson, a grizzled Vietnam War vet and experienced outdoorsman.\nDescription: Streamwader’s shop is a small, rugged building filled with hunting rifles, bows, traps, and other outdoor equipment. Jim has lived in Watashuka for decades and loves to share his stories with the younger generation of hunters, though his more chilling tales are often dismissed as the ramblings of an old soldier.\n\n\nRural Communities\n\nResidents: Dairy farmers, crop growers, and livestock ranchers.\nDescription: The sprawling farmland to the southwest is home to families who have lived in Watashuka for generations. These farmers are mostly self-sufficient, and many have an unspoken rule to mind their own business.\n\n\nHo-Chunk Information Center\n\nCurator: Mary Whitecloud, a knowledgeable and reserved Ho-Chunk woman in her late 40s.\nDescription: This small center serves as an educational hub about the Ho-Chunk people, their history, and their culture. The building is humble but welcoming, with displays about Ho-Chunk traditions and artifacts. Mary runs the center, offering tours and answering questions from visitors.\n\n\n\nOutside of the town limits to the Southwest\n\nThe Wet Spot\n\nOwner: “Big” Tony D’Amato, a business-savvy man in his 50s.\nDescription: Despite its seedy reputation, The Wet Spot is a popular hangout for college students, known for cheap drinks and live music. The club, located just outside town limits near Lake Mary. Tony, the owner, loves catering to the college crowd, offering student discounts and hosting wild theme nights. Locals mostly avoid the place, but for Caroline College students, it’s a spot to unwind away from prying eyes. Though rumors swirl about shady dealings, Tony keeps a tight lid on any trouble, preferring to keep things legal—and profitable.\n\n\nBorder of Ho-Chunk Native People&#039;s Lands\n\nAtmosphere\n\nThe Downs are a mix of sprawling farmlands and quiet, isolated properties. The air is thick with the smell of fresh hay and the sound of distant tractors, creating a rural, down-to-earth feel. It’s a hard-working community where people keep to themselves and don&#039;t ask too many questions.\nThe Ho-Chunk lands are sacred and revered, with a strong connection to the spiritual. The area is quiet, peaceful, and somewhat eerie. The trees here seem older, and the wind carries with it the weight of ancient history. Many in Watashuka avoid this part of the land.\n\nSouth East &quot;Lakeview&quot;\n {Feel: Working Class mixes with impoverished housing and abandoned lots}\n {Note: You cannot see the lake from the neighborhood.}\n\nLakeview Elementary And Jr. High School\n\nOwner/Principal: Principal Nancy Doyle, a stern yet caring woman who has run the school for over 20 years, is known for her no-nonsense attitude.\nDescription: The school serves the local working-class families of Watashuka. It&#039;s an aging building, with outdated facilities, but a dedicated staff. Known for its tight-knit community, teachers often go above and beyond to help students who face difficult circumstances at home.\n\n\nMackie Recreational Park\n\nCaretaker: Gary “Old Man” Dutton, a retiree who volunteers his time to maintain the park, always seen with his trusty rake in hand.\nDescription: Once a bustling park for families, Mackie Recreational Park now has overgrown fields and outdated playground equipment. Despite its wear, it’s a gathering place for children after school and hosts occasional community events.\n\n\nBerg Farm House\n\nOwner: Unknown and in dispute. The Watashuka Historical Society is attempting to take ownership but they lack the funds.\nDescription: The oldest surviving building in the region, the Berg Farm House was built before 1876. This is known from a surviving watercolor painting dated from 1876. It is suspected that the structure may have an older origin. The building is currently abandoned and opinions are mixed as to whether the town should restore it or demolish it.\n\n\n19th Street Apartments\n\nOwner: The elusive Mr. Ronald Maddox, a local landlord notorious for neglecting property repairs while still demanding rent on time.\nDescription: A low-income apartment complex filled with diverse residents. The building is run down, with peeling paint and unreliable plumbing, but it&#039;s home for many who can’t afford better housing.\n\n\nJackie&#039;s East Side Pizza\n\nOwner: Jackie Leone, a friendly, middle-aged man with a deep love for pizza (even if he cannot eat it himself due to lactose intolerance). He’s known for giving free slices to kids who can&#039;t afford them in exchange for odd jobs (washing dishes, cleaning, etc.).\nDescription: Known for its greasy, but delicious pizza, Jackie’s East Side Pizza is a local favorite for a quick bite. The interior is simple and clean, with checkered tablecloths and neon signs that have seen better days.\n\n\nDominick&#039;s Grocery\n\nOwner: Dominick Santoro\nDescription: The largest grocery store in the region, it is a family owned store with shelves that are always stocked with local produce and staples. Dominick&#039;s caught between the norms of a simpler time and the pull of the modern world. In a struggle to stave off outside commercial interests, the pull of the modern is winning.\n\n\nCobblers &amp; Threads\n\nOwner: Betty Whitehall, a no-nonsense seamstress, and her brother Frank Whitehall, the cobbler. They’ve run the shop together for decades, known for their efficient teamwork.\nDescription: A dual-purpose shop offering both shoe repair and clothing alterations. Known for its fast service, it’s a favorite for residents who want to make their clothes and shoes last a little longer.\n\n\nTony’s Barber Shop\n\nOwner: &#039;Little&#039; Tony McKivett\nDescription: A classic barber shop where the men of Watashuka gather for haircuts and town gossip. Tony’s father ran the shop before him, and Tony knows just about everyone’s secrets. The shop has old-fashioned leather chairs and a timeless feel.\n\n\nNickel Quick-Mart\n\nOwner: Rick Graves, a friendly, overworked man who runs the store mostly on his own. He’s known for always greeting customers with a smile despite the long hours.\nDescription: A small, rundown convenience store that carries everything from snacks to household items. It’s open late and frequented by everyone in the neighborhood for last-minute purchases.\n\n\nMetal Circle Apartments\n\nOwner: Martha Hale, a widow who inherited the building from her late husband and struggles to keep it maintained on her own.\nDescription: A small apartment complex, known for its circular layout which follows what was once the boundary Prairieville. The apartments are affordable but come with frequent maintenance issues. It&#039;s popular with students from Caroline College looking for off campus housing.\n\n\nAnderson&#039;s Shady Tree Mechanics and Auto Sales\n\nOwner: Jed Anderson, a gruff but likable mechanic who’s been fixing cars in Watashuka for as long as anyone can remember.\nDescription: A combination auto repair shop and used car dealership, located just on the road out of town. It’s known for doing quick, cheap repairs and offering used cars at prices that make people suspicious. The junk yard in the fields behind the shop are expansive.\n\n\nMid-City Apartments\n\nOwner: Marie Jennings, a tough but fair property manager who tries to do what she can with the limited resources she has.\nDescription: A crumbling, multi-story apartment building. The elevator is always broken, and the halls are filled with peeling wallpaper. Despite this, it’s always full of tenants; especially the town&#039;s aging population who do not have family to stay with.\n\n\n3 Ball Pawn\n\nOwner: Roy “Three Ball” Smith, a shrewd businessman who claims he can sell anything.\nDescription: A dark, cramped pawn shop filled with odd trinkets, used electronics, and questionable items. The shop is always busy, with people haggling over prices. It has frequently in trouble with local law enforcement for selling items with a &#039;questionable&#039; past.\n\n\nPR’s (Poor Richard’s) Bar\n\nOwner: Richard “Rich” Mulligan, a man whose nickname, Poor Richard, comes from his tendency to drink away his own profits.\nDescription: A local dive bar with a dimly lit interior, cheap drinks, and live music that is popular with college students.\n\n\nCornerstone Center (Community Center)\n\nManager: Clara Williams, a passionate social worker who does her best to keep the center running with limited funds.\nDescription: A rundown community center that offers free classes and activities for local kids and adults. The building is in desperate need of repairs, but it’s still a hub for the neighborhood.\n\n\nWatashuka Chamber of Commerce\n\nHead: Alan Peterson, an optimistic businessman who believes Watashuka’s best days are still ahead, despite the overwhelming evidence to the contrary.\nDescription: The town’s business association, housed in a small, non-descript building. The Chamber tries to encourage economic development, but the town’s declining fortunes make it an uphill battle.\n\n\nPeach Street Library\n\nLibrarian: Sly Coolstein\nThe Peach Street Library is the only public library in town. While the number of volumes available are limited, they do cover a wide range of topics not usually found in a rural town library. This is due to the donations of enthusiasts in the region.\n\n\nGarrison &amp; Sons Law Office\n\nOwner: Jack Garrison and Sons (Ted and Wayne)\nDescription: A family-run law office, Garrison &amp; Sons handles wills, property disputes, and other local legal matters. Jack is semi-retired, leaving much of the day-to-day work to his sons, Ted and Wayne. The office is a small, simple building with old wooden floors and dusty bookshelves.\n\n\n\nOutside the town limits to the Southeast: &quot;Lakeview Shores&quot;\n {Feel: Resort attractions that have seen better days.}\nOnce a thriving vacation destination, Lakeview Shores has seen better days. Nestled along the edge of Lake &quot;View,&quot; this aging resort area was once popular with families seeking outdoor recreation, but a combination of economic decline and neglect has left it in a state of disrepair. The area is now frequented by locals, campers, and the occasional nostalgic visitor, though the glory days are long gone.\n\nSit n&#039; Eat Diner and Motel\n\nOwner: Doris Larkin, a friendly but world-weary woman in her 60s who runs the place single-handedly.\nDescription: This diner and attached motel are classic roadside Americana, with faded neon signs and a cracked parking lot. Once a bustling stop for tourists, the rooms are now sparsely occupied, and the diner serves mostly local regulars. Despite the wear and tear, Doris keeps the food hot and the coffee flowing. The motel rooms are clean but dated, with décor that hasn’t been updated since the 1970s.\n\n\nThe Lake (Public House)\n\nOwner: Tom &quot;Big T&quot; Lawson, a burly man in his 50s with a passion for local history and cheap beer.\nDescription: The Lake is a weathered lakeside tavern that once thrived on summer tourism. Now, it’s mostly filled with locals looking for a cheap drink. The tavern has a large deck overlooking the water, though the view is often shrouded in mist, adding an eerie ambiance. Inside, fishing trophies and old photos of Lakeview’s heyday decorate the walls. Big T is always ready to share stories of the lake’s supposed mysteries, though most patrons dismiss them as drunken ramblings. It is almost never visited by college students and is considered a &#039;locals only&#039; establishment. &quot;Its the only place in town where a good Lutheran can get a drink.&quot;\n\n\nLakeside RV Park &amp; Campground\n\nOwner: Marty and Sue Briggs, an aging couple who have managed the site for over 30 years.\nDescription: The RV park and campground sit on the fringes of Lakeview Shores, offering both short-term and long-term stays. Once a vibrant vacation spot, the campground now attracts a more transient crowd, with only a handful of RVs and tents set up at any given time. The facilities are outdated but functional, and the lake’s shoreline is overgrown with weeds.\n\n\nAll Wet Market &amp; Deli\n\nOwner: Jane and Bob Wheeler, a friendly couple in their late 40s trying to revive the area.\nDescription: This small market and deli caters to the remaining campers, RV dwellers, and the few vacationers that still trickle in. Despite the area’s decline, Jane and Bob are optimistic and do their best to offer fresh sandwiches and snacks, even though their stock sometimes sits for weeks before being sold. The building is quaint but worn, with a cheery atmosphere inside.\n\n\nLakeview Lakeside Fun Center (Mini Golf &amp; Arcade)\n\nOwner: Dave and Cathy Arnold, a laid-back couple in their 50s who refuse to let the place die.\nDescription: The Lakeview Fun Center was once a bustling family attraction, complete with mini golf, an arcade, and boat rentals. These days, the mini golf course is overgrown, and most of the arcade machines are out of order, save for a few that still function—barely. Dave and Cathy are known for their easygoing attitudes, keeping the place open even if it only gets a few visitors a day.\n\n\nThe Playhouse on the Lake\n\nOwner: Nancy Bright, a former actress who settled down after her career ended.\nDescription: This small theater once hosted local plays, musicals, and live performances for vacationers. Now, it’s mostly abandoned, with only a few amateur productions each year. Nancy, an eccentric woman with a flair for the dramatic, still dreams of restoring the theater to its former glory, though few share her enthusiasm. The Playhouse is said to be haunted by the ghost of a former actor who died during a performance, but Nancy waves off such rumors with a smile.\n\n\nThe View New Age Shop\n\nOwner: Lucinda &quot;Luce&quot; Moore, a free-spirited woman in her 40s with a deep interest in the supernatural.\nDescription: This small, quirky shop offers crystals, tarot readings, and other New Age paraphernalia. Luce is one of the few people in Lakeview Shores who embraces the strange energy of the area, and she’s always ready to discuss local legends or offer advice on warding off spirits. The shop is popular with college students and visitors interested in the occult, though locals are often skeptical of Luce’s claims about the lake’s mystical powers. She’s known to host moonlit gatherings by the lake, though only a few daring souls ever attend.\n\n\n\nAtmosphere:\n\n\nDespite its decline, Lakeview Shores holds a certain charm for those who appreciate faded beauty and quiet reflection. The lake, once a source of joy, now seems shrouded in fog and whispers of the unknown. Once a bustling summer retreat, Lakeview Shores has an air of forgotten grandeur. The overgrown paths, weathered motels, and silent campgrounds hint at better days, but now the area feels haunted by time. Despite its decline, Lakeview Shores retains a nostalgic charm for those who remember its heyday.\n\n\nLakeview is a working-class neighborhood with a sense of faded optimism. Many of its residents are struggling to make ends meet, and the area’s rundown houses and overgrown lots are signs of its slow decline. Yet, there’s a strong community spirit here, where neighbors help each other out, and children still play in the streets. The boarded-up windows and crumbling facades tell the story of a once-thriving part of town, but the people hold onto hope that better days are coming.\n\n"},"01-Caroline-College/04-Watashuka/00-Information/Watashuka":{"title":"About Watashuka","links":["01-Caroline-College/05-Factions/Ho-Chunk","01-Caroline-College/05-Factions/Amish","01-Caroline-College/03-The-College/00-Information/Caroline-College","01-Caroline-College/04-Watashuka/00-Information/History-of-Watashuka","01-Caroline-College/04-Watashuka/00-Information/Watashuka-Business-Directory"],"tags":["TTRPG","Horror"],"content":"Watashuka\n\nOverview\n\n\nLocation: Watashuka is a small town located at the intersection of US-14 W and Hwy 11 W in Wisconsin. It lies approximately 54 miles southeast of Madison, 60 miles southwest of Milwaukee, and 100 miles northwest of Chicago. The town is also 20 miles from Lake Geneva.\n\n\nTagline: &quot;Quiet country life, for honest people.&quot;\n\n\nPopulation (1983):\n\nTotal Region: ~10,359 (as of 1983)\nWithin Town Limits: ~5,280\nTrend: Decline since 1969 due to closing of government projects.\n\n\n\nDemographics:\n\nEthnicity and Diversity:\n\nPredominantly white, with a notable Native American population, primarily members of the Ho-Chunk tribe as well as a large Amish community.\nWhite: ~75%\nNative American (Ho-Chunk): ~15%\nAfrican American: ~5%\nAsian: ~3%\nHispanic/Latino: ~1%\nOther: ~1%\n\n\nAge: The town has an aging population, but the influx of students from Caroline College brings the average age down to below 27.\nReligion:\n\nLutheran: ~50% (of total population)\nAmish: ~20%\nNon-Christian Faiths: ~15% (including Native American spiritual beliefs and other minor religions)\nOther Christian Denominations: ~10%\nOther: ~5%\n\n\n\n\n\nEconomy\n\nPrimary Industry: Education: Caroline College\n\nCaroline College is the primary economic driver for Watashuka, employing a significant portion of its workforce and attracting substantial but mysterious funding.\n\nImpact:\n\nDirect employment: ~40% of the town&#039;s workforce\nIndirect employment through supporting businesses: ~30%\nLarge public and private financial support, with an unknown source\n\n\n\n\n\n\nSecondary Industry:\n\nAgriculture plays a vital role in Watashuka&#039;s economy, with dairy products and cranberries being the primary crops.\nAgriculture: Primary Products:\n\nDairy: Milk and cheese\nCranberries\n\n\nImpact: Supports ~15% of the town&#039;s workforce\n\n\nTertiary Industries:\n\nLumber and crafts contribute to Watashuka&#039;s economy by providing additional employment opportunities.\nLumber: Supports ~5% of the workforce\n\nPrimary Activities: Logging, sawmills, woodworking\n\n\nCrafts: Supports another ~3%\n\nPrimary Activities: Artisan workshops, galleries, and small-scale manufacturing\n\n\n\n\n\n\n\nRecent Economic Developments/Challenges:\n\nIncreased Funding for Caroline College: The recent influx of funds has helped revitalize the town but has also raised questions about its source\nAging Population: Many farmers and craftspeople are approaching retirement age, which may lead to a skills gap in the future\n\n\n\nHistory of Watashuka\n\n\nWatashuka Business Directory\n\n"},"01-Caroline-College/04-Watashuka/01-Locations/Berg-Farm-House":{"title":"Berg Farm House","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka"],"tags":["TTRPG","Horror"],"content":"Berg Farm House\n\nThe Berg Watercolor, evidence backing up the claim of the Berg Farm House&#039;s history.\nHistory\nRecords have been lost regarding the origin of the structure known as the &quot;Berg Farm House&quot;, but it undisputedly the oldest surviving building in Watashuka. This is based on the &quot;Berg Watercolor&quot;. The watercolor has been dated to at least 1876 but historian suspect the painting is much older. From the condition of the building in the painting, and the suggestion of community around the farm house via the existence of other structures (long since lost), the farm is assumed to have been built on or around the 1850&#039;s or 1860&#039;s.\nCurrent State\n\nThe building, which sits on an overgrown lot on 14th street, has survived demolition numerous times in the past decades thanks to the efforts of the Watashuka Historical Society. The rightful owner of the land cannot be determined. The most likely owner, Henry Bergmann, a distant ancestor of the last known Berg family member, claims no ownership. He has actively sought to distance himself, and his family, from the claim. The building is currently abandoned and the Historical Society is attempting to raise funds for renovation and legal work associated with recovering the property."},"01-Caroline-College/04-Watashuka/01-Locations/Frozen-Cow":{"title":"Frozen Cow","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/04-Watashuka/02-People/Mike-and-Ruth-Garrison"],"tags":[],"content":"\nThe Frozen Cow Burger Stand is a charming, retro 1950s-style diner with a nostalgic flair, located in the heart of Watashuka. Run by Mike and Ruth Garrison, the small, rectangular building is painted in bright red and white stripes, with a large neon sign on the roof that proudly displays the stand&#039;s quirky name, &quot;Frozen Cow,&quot; in bold, glowing letters. The diner has a few chrome-trimmed windows on the front, offering a peek inside where you can see the grill sizzling and the staff bustling.\nThe exterior is simple but inviting, with a large awning providing shade for a row of vintage-style picnic tables outside, perfect for customers to enjoy their burgers and milkshakes in the open air. The smell of sizzling beef patties, fresh-cut fries, and sweet milkshakes always wafts through the air, drawing people in.\nInside, the décor is a time capsule of mid-century Americana: red vinyl stools line the stainless-steel counter, and the black-and-white checkered floor gives the place an old-school diner feel. The walls are adorned with framed photos of Watashuka from past decades, along with a few posters of classic cars and rock ‘n’ roll icons. A small jukebox sits in the corner, though it’s often drowned out by the sounds of happy customers and sizzling grills.\nDespite its small size, the Frozen Cow Burger Stand is always busy, with lines of locals and college students often extending out the door. It’s known for its simple but delicious menu of burgers, fries, and thick milkshakes, all served with a generous side of nostalgia."},"01-Caroline-College/04-Watashuka/01-Locations/Peach-Street-Library":{"title":"Peach Street Library","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/04-Watashuka/02-People/Sly-Coolstein","01-Caroline-College/04-Watashuka/02-People/Ronnie-Regan"],"tags":["TTRPG","Horror"],"content":"\nPeach Street Library\nOn a quiet Tuesday afternoon, the creaky wooden floors of the Peach Street Library echo with the sound of shuffling footsteps. Sly adjusts his thick glasses, squinting as he scans the shelves, seemingly lost in thought. The faint smell of old paper fills the air as Ronnie bounces from stack to stack, eager to organize a new section of books. A patron walks in, the familiar bell above the door jingling softly. &quot;Looking for something in particular?&quot; Sly asks absentmindedly, not looking up from his pile of reference materials. The library may be old and worn, but its charm and peaceful atmosphere are undeniable.\nThe Peach Street Library is Watashuka&#039;s only public library and has been a quiet cornerstone of the town for decades. Located in an older brick building downtown, the library is a small but cherished institution, offering a modest collection of books ranging from local history to classic literature. Its shelves are packed with aging volumes and dog-eared paperbacks, giving the place a comforting, nostalgic atmosphere. While its resources may not be extensive, the Peach Street Library serves as a peaceful retreat for readers, students, and the occasional researcher looking for information on Watashuka’s history.\nThe library is run by Sly Coolstein, its head librarian for over thirty years. Despite his often distracted, absent-minded demeanor, Sly knows the library&#039;s collection inside and out. He is occasionally assisted by high school student Ronnie Regan, whose enthusiasm for the odd has led to some unusual conversations with patrons from all walks of life. Together, they keep the library running, helping patrons find whatever they need, whether it&#039;s a popular novel or a dusty, obscure text."},"01-Caroline-College/04-Watashuka/01-Locations/The-Prince-New--and--Used-Books":{"title":"The Prince-New & Used Books","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka"],"tags":["TTRPG","Horror"],"content":"\nThe Prince: New &amp; Used Books is a beloved local bookstore located in the heart of Watashuka, a fixture of the town since the late 1800s. The shop is a cozy and slightly dusty haven for readers and collectors alike, with wooden shelves filled to the brim with both new and rare titles. The shop has a timeless charm, from its creaky wooden floors to the large front windows that let in the warm glow of sunlight, making it an inviting spot for visitors to spend hours browsing the shelves.\nOne of the shop’s most famous residents is Poe, the small black cat who can usually be found lounging lazily on the counter or curled up in a sunny window. Named after Edgar Allan Poe, the store&#039;s mascot is adored by locals and is known for his calm, quiet demeanor, adding to the peaceful atmosphere of the store. Dexter Colby, the current owner, is always ready to recommend a book or help customers find that elusive rare edition.\nThe Prince is the place to go for literary treasures. Its shelves seem to hold more stories than just what’s in the books themselves, and some regulars say there’s something almost magical about how they always find exactly what they’re looking for, even if they didn’t know they wanted it."},"01-Caroline-College/04-Watashuka/02-People/Bernard-Miller":{"title":"Bernard Miller","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/04-Watashuka/02-People/Jan-Ducochik"],"tags":["TTRPG","Horror"],"content":"\nCaptain Bernard Miller\n\n\nAge: 44 (in 1983)\n\n\nRole: Captain Bernard Miller is the head of the Watashuka Police Department, a position that makes him one of the town’s most prominent figures. He is known around Watashuka for his charm and boasts of romantic escapades, often regaling his colleagues and townsfolk with stories of his supposed conquests. However, he maintains a mostly hands-off leadership style, preferring to let his officers handle the day-to-day operations of the department.\n\n\nAppearance: Bernard is a ruggedly handsome man with a strong build, which gives him an imposing and confident presence. His neatly styled brown hair and clean-shaven face complement his polished look, adding to his overall image of authority. Bernard’s sharp features and athletic frame make him a figure of attention both in uniform and out. His eyes, however, often carry a subtle, distant sadness, a hint of inner conflict beneath his otherwise composed demeanor. Despite his polished exterior, he tends to carry an air of detachment, especially in moments of quiet reflection.\n\n\nPersonality: Outwardly, Bernard presents himself as confident and charming, playing up his reputation as a womanizer to distract from any suspicions about his private life. He’s known for his laid-back approach to his role, which allows him to maintain his comfortable position without making too many waves. Beneath this, Bernard is a man constantly managing inner turmoil, struggling to balance his public image with the pressures of his personal life.\n\n\nPublic Role:\n\nWatashuka Police Department: As captain of the police force, Bernard is viewed by most as a competent leader, if somewhat distant. He often delegates the bulk of police work to his officers, including more thorough investigations, while he focuses on maintaining order and appearances. His leadership has kept the town functioning smoothly, but his reluctance to confront strange occurrences has led to some tensions within the department, particularly with officers who want to dig deeper into the town’s mysteries.\n\n\n\nRelationships:\n\nSgt. Jan Ducochik: While Bernard respects Jan’s investigative skills, he finds Jan’s obsession with the town’s stranger cases frustrating. Bernard’s desire to avoid conflict often leads him to dismiss Jan’s concerns, especially when they veer into the realm of the unexplained. He sees Jan’s persistence as a threat to the delicate balance he maintains with town leadership.\n\n\n\nPublic Perception: Watashuka views Bernard as a charismatic, if somewhat complacent, police captain. His reputation as a charming womanizer and hands-off leadership style are well-known, and while some view him as disengaged, most of the town is content with his approach, especially as the town has avoided major incidents—at least, so far.\n\n"},"01-Caroline-College/04-Watashuka/02-People/Dave":{"title":"Dave","links":["01-Caroline-College/03-The-College/01-Locations/WCTU","01-Caroline-College/03-The-College/00-Information/Caroline-College","01-Caroline-College/05-Factions/Mothers-Opposing-Metal-Keeper","01-Caroline-College/05-Factions/Metalheads","01-Caroline-College/05-Factions/Mothers-Opposing-Metal","01-Caroline-College/05-Factions/Watashuka-Initiative","01-Caroline-College/05-Factions/Amish","01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/05-Factions/Ho-Chunk"],"tags":["TTRPG","Horror"],"content":"\nDave\n\nName: Unknown (only referred to as &quot;Dave&quot;)\nAge: Unknown\nRole: Dave is the enigmatic, and elusive, pirate radio host of the underground show Metal At Midnight. He hijacks WCTU, Caroline College&#039;s AM radio station, for sporadic, late-night broadcasts that combine heavy metal music with wild, conspiracy-laden rants about the government, secret societies, cults, and the supernatural forces lurking in Watashuka. The show starts at exactly midnight and runs until it is abruptly cut off, never airing past 6:14 a.m. Despite multiple attempts by the college and local authorities to trace his signal, no one has successfully uncovered Dave&#039;s identity or location.\nPersonality: Dave is a charismatic and chaotic presence on the airwaves, blending metal anthems with conspiracy theories. His rants are erratic and filled with stoner slang like &quot;bro,&quot; &quot;man,&quot; and &quot;dude.&quot; He jumps between topics with manic energy, often weaving real-world issues with his paranoid theories about government surveillance, cult activity, and the occult. Dave frequently laughs maniacally during his broadcasts and mocks those in positions of power, particularly conservative figures like Mothers Opposing Metal|MOM and the local police.\nBeliefs: Dave believes shadowy forces are tracking him, particularly the government and various secret societies. He sees himself as a voice for the oppressed, fighting back against the powers that be by spreading the truth through heavy metal music. He regularly mocks the satanic panic of the era, claiming that the real evil is something far worse, hiding in plain sight within Watashuka.\nAppearance: No one knows what Dave looks like. His identity remains a mystery to the authorities, students, and his listeners. Rumors swirl about who Dave might be—some believe he’s a former student or professor, others think he’s an outsider who’s taken up residence on the outskirts of town.\nPublic Role:\n\nPirate Radio Host: Dave’s show, Metal At Midnight, has a devoted following among the town’s Metalheads and outcasts. His broadcasts encourage rebellion and defiance against Watashuka’s conservative forces, particularly Mothers Opposing Metal. Through his rants, Dave inadvertently reveals pieces of truth about the town’s occult activity, though listeners must wade through his chaotic monologues to find useful information.\nCounterculture Symbol: To many of Watashuka’s younger, more rebellious residents, Dave is a symbol of defiance against the town’s conservative establishment. His show has become a rallying point for the town’s metalheads, who see him as a voice speaking out against the hypocrisy and hidden darkness of the town.\n\n\nPublic Perception: To most of the town, Dave is nothing more than a nuisance, a conspiracy-theorist pirate radio host whose broadcasts are both hard to find and hard to take seriously. While his rants seem like wild paranoia, some of Watashuka’s youth have come to idolize him as a champion of their anti-establishment mindset. Most adults, particularly those in positions of authority, view him as a disruptive force, but they can’t seem to track him down.\nRumors About Dave:\n\nThe Ghost Broadcaster: Some say Dave died years ago in a car accident, and his spirit now broadcasts from beyond the grave, using old radio frequencies.\nAn Old Professor: One theory suggests Dave is a disgruntled former professor from Caroline College, possibly one who dabbled in occult studies.\nIn League with the Occult: Some residents claim Dave is a Satanist himself, using his broadcasts to send coded messages to his followers.\nA Rebel Student: Others believe Dave is a current student, using the college’s equipment to run his show without the administration’s knowledge.\nGovernment Spy: A few conspiracy theorists think Dave is actually an undercover agent for the secret Project Caroline, secretly monitoring the town under the guise of a pirate radio host.\nLives in the Tower: A rumor persists that Dave broadcasts from Qubit Tower, hiding in its unused rooms.\nThe Forgotten Son: Some believe Dave is the illegitimate child of a prominent family, using his show to exact revenge on the town.\nAmish Defector: There’s speculation that Dave fled the local Amish community and now rebels against his former life.\nA Dark Ritual Survivor: Some claim Dave was the only survivor of a failed occult ritual in the 1970s and now uses his show to expose the supernatural forces in Watashuka.\nA Ho-Chunk Teacher: A rumor that Dave is a member of the Ho-Chunk people who is trying to share secret knowledge.\n\n\n"},"01-Caroline-College/04-Watashuka/02-People/Dexter-Colby":{"title":"Dexter Colby","links":["01-Caroline-College/04-Watashuka/01-Locations/The-Prince-New--and--Used-Books","01-Caroline-College/06-Events/Great-Influx"],"tags":["TTRPG","Horror"],"content":"\nDexter Colby\nThe bell above the door jingles as a customer steps into The Prince. Dexter, with his salt-and-pepper hair neatly combed, looks up from the old novel he’s been reading, offering a subtle smile. &quot;Looking for something in particular?&quot; he asks in his calm, deep voice. He moves gracefully around the shelves, his fingers brushing the spines of books that seem older than the building itself. Dexter may not be the most outgoing shopkeeper, but there’s something about him that makes his quiet bookstore feel like a timeless haven.\nDexter Colby is the owner of The Prince: New &amp; Used Books, a charming, slightly dusty bookstore filled with an eclectic selection of literature. Dexter is known for his vast knowledge of rare and antique books, and his quiet but engaging presence behind the counter. According to local lore, the Colby family has been running the store for generations; arriving shortly after the Great Influx. Dexter often speaks fondly of his ancestors who established the business in the late 1800s. While Dexter can be a bit reclusive, preferring the company of books over people, he’s always willing to help a customer find that perfect read."},"01-Caroline-College/04-Watashuka/02-People/Jan-Ducochik":{"title":"Sgt. Jan Ducochik","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/04-Watashuka/02-People/Norm-Habersham"],"tags":["TTRPG","Horror"],"content":"\nJan Ducochik\nSergeant Jan Ducochik, in his early 30s, cuts an imposing yet composed figure in Watashuka’s police department. Standing tall and well-groomed, Jan’s sharp blue eyes reflect both his intense focus and the quiet burdens he carries. His chiseled face, framed by a thick, well-kept mustache, lends him an air of authority that is only heightened by his neatly pressed police uniform. His dark blonde hair is meticulously combed, and every aspect of his appearance speaks to a man who values discipline and precision. Jan’s build is athletic, with the lean strength of someone who remains physically active and ready for whatever may come his way. There is a seriousness to his demeanor, his sharp gaze constantly observing and assessing his surroundings, as though he’s always alert for something more than the everyday crimes of small-town life.\nIn the station or on patrol, Jan moves with a purpose that reveals his deep sense of duty. His uniform, spotless and well-fitted, reflects his commitment to his role as a protector of Watashuka. He speaks little but listens intently, giving off a sense of calm, calculated vigilance.\n\nRole: Sergeant Jan Ducochik serves in the Watashuka Police Department. Since joining the force in 1980, he has become a reliable officer, well-liked by the community for his professionalism and dedication. Over the last few years, he has taken a more active interest in the town’s safety, particularly focusing on strange events that others dismiss as coincidences. He has earned a reputation for being diligent, though some colleagues find him overly suspicious.\nAge: Early 30s (1983)\nAppearance: Jan is a sharp, well-groomed man with striking blue eyes, a chiseled face, and a thick mustache. His dark blonde hair is neatly combed, and his police uniform is always pristine, reflecting his disciplined nature. He has an intense gaze, which locals find reassuring in his position of authority.\nPersonality: Jan is serious, dutiful, and moral. He is devout in his Catholic faith, though respectful of Watashuka’s predominantly Lutheran traditions. His strict moral code shapes his work, and he often views things in black-and-white terms, always striving to protect the town. However, his more focused approach to uncovering unusual events in Watashuka makes him stand out from his colleagues, some of whom think he is overreacting.\nPublic Role: Jan is a respected sergeant who actively investigates unusual occurrences around town. His suspicions have led him to dig deeper into strange events, but he presents himself as calm and controlled. He collaborates with the local newspaper editor, Norm Habersham, when needed, gathering tips on town rumors and unexplained occurrences.\n"},"01-Caroline-College/04-Watashuka/02-People/Margaret-Wilkins":{"title":"Margaret 'Marge' Wilkins","links":["01-Caroline-College/06-Events/The-Baptism-of-'39","01-Caroline-College/04-Watashuka/02-People/Norm-Habersham"],"tags":["TTRPG","Horror"],"content":"\nMargaret Wilkins\nMargaret Wilkins, at 66 years old (in 1983), stands behind the counter of her cozy newsstand on the corner of Main Street in Watashuka. Her silver-gray hair is neatly styled in a short, no-nonsense bob, with a few loose strands framing her face. Margaret&#039;s sharp brown eyes, still full of keen observation, peer out from behind thick, square-framed glasses, giving her a serious yet approachable look. Her face is lined with years of both worry and laughter, showing the deep creases of someone who has lived a life full of quiet contemplation and unspeakable experiences. She wears a patterned cardigan over a light blouse, a modest but practical outfit fitting for the fall weather. A string of pearls around her neck adds a touch of elegance, a reminder of her former stature as Watashuka&#039;s first female senior editor. Her posture is slightly hunched from age, but her hands, still quick and steady, sort through newspapers and magazines with practiced ease. Margaret’s fingers are adorned with a simple gold wedding band, though she was never married—an object of curiosity among the townsfolk.\nThe newsstand itself is a tight space packed with neatly stacked papers, magazines, and candy bars. The shelves behind her are filled with rows of unsold copies of The Prairie Press, each one a piece of history she refuses to part with. She is a woman who knows far more than she lets on, standing guard over the town’s stories with both caution and care.\n\nAge: 66 (in 1983)\nRole: Former journalist and the first female senior editor of The Prairie Press (retired in 1950), Margaret Wilkins is a fixture of Watashuka’s history. She now runs the Press Newsstand in town, selling magazines, newspapers, and small sundries. Despite her seemingly mundane post-retirement life, Margaret’s keen eyes and sharp mind have never dulled.\nBackground: Margaret began her career as a young and determined journalist in the late 1930s, starting with a pivotal assignment at the age of 22. Her story on the infamous Baptism of &#039;39 was her first major piece for The Prairie, setting the stage for her future career. Margaret went on to cover some of the town’s most notable events during her tenure at the paper, gaining a reputation as a diligent, brave, and sometimes tenacious reporter. She eventually became the first female senior editor of The Prairie Press, a position she held until her retirement in 1950, when she passed the role to Norm Habersham.\nPress Newsstand: Since retiring, Margaret runs the small Press Newsstand in downtown Watashuka, quietly observing the town she once wrote about. She’s known for hoarding unsold copies of newspapers, often storing them in the back of her shop. Locals see her as a curious relic of a bygone era, but Margaret continues to follow the news and keeps up with local happenings, even if she no longer writes about them.\nPublic Perception: To the town, Margaret is a beloved figure from Watashuka’s journalistic past, a pioneer in her field and a woman who stood her ground in a male-dominated profession. Though she no longer engages in investigative journalism, many still remember her early work and come to her newsstand for both gossip and news. She is respected, if occasionally pitied for her reclusive nature.\n"},"01-Caroline-College/04-Watashuka/02-People/Max-and-Maxine-McElhenney":{"title":"Max and Maxine McElhenney","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/03-The-College/00-Information/Caroline-College","01-Caroline-College/05-Factions/Metalheads"],"tags":["TTRPG","Horror"],"content":"\nMax and Maxine McElhenney\nMax McElhenney\nOverview:\nMax McElhenney, 19, returned to Watashuka with his twin sister, Maxine, after inheriting their late parents&#039; home. Max enrolled at Caroline College at 18 but put his studies on hold to work as a janitor at the local hospital. With his laid-back demeanor, slow speech, and love of heavy metal, Max is often mistaken for a stoner, a misconception he is quick to correct. He plays drums and frequently jams with Maxine. Despite his carefree appearance, there’s a quiet depth to him that most people overlook.\nPublic Perception:\nMax is viewed by the locals as quiet, if somewhat aloof. His decision to step away from college is seen as &quot;wasting potential,&quot; though those who know him at the hospital recognize him as dependable and diligent. His reputation as a metalhead and his easygoing attitude make him popular with the town’s youth, who appreciate his relaxed, nonjudgmental nature.\n\nMaxine McElhenney\nOverview:\nMaxine McElhenney, also 19, is Max’s twin sister and the more academically inclined of the two. She continues her education at Caroline College, majoring in sociology, while Max works. Though she’s sharp-witted and focused on her studies, Maxine shares her brother’s passion for heavy metal, playing bass guitar alongside him. Maxine is intelligent and driven, but she keeps a certain emotional distance from others, often hiding behind her calm and composed exterior.\nPublic Perception:\nSeen as the more &quot;responsible&quot; twin, Maxine is well-regarded by her professors and peers for her academic achievements. Despite her success, there’s a certain air of aloofness about her—people find her both intriguing and a bit intimidating. Her musical tastes and love for metalheads make her stand out, but she’s never quite fit in with the scene as much as she would like to."},"01-Caroline-College/04-Watashuka/02-People/Mike-and-Ruth-Garrison":{"title":"Mike and Ruth Garrison","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka"],"tags":[],"content":"Mike and Ruth Garrison\n\nIt’s another sunny afternoon at the Frozen Cow Burger Stand. The line stretches down the sidewalk as locals and students eagerly await their favorite meals. Mike stands at the counter, laughing with customers and cracking jokes, his long-ago hippie roots showing in his relaxed demeanor. Ruth, ever the efficient one, works the grill with practiced ease. She glances at Mike, shaking her head with a fond smile. Despite all the hustle, the two seem perfectly in sync, their connection a comforting fixture in the town of Watashuka.\nMike and Ruth Garrison are the proud owners of the Frozen Cow Burger Stand, a beloved 1950s-style diner in Watashuka. Mike, a former hippie who drifted into town in the late 60s, fell in love with Ruth when he stopped at a burger stand where she worked. Mike was lost and in need of a meal. When taking his order, Ruth asked Mike what he was doing in town. Mike said, under the influence, that he was on his way to Alaska. &quot;Why would you want to go way up there?&quot; she asked politely.  “I&#039;m heading up north to check out a free commune.” Ruth misheard him over the noise of the diner - thinking he said he was &quot;heading up north to check out a frozen cow.&quot; This was the funniest thing she ever heard and busted out laughing. Mike thought the sound of her laughter was the most beautiful thing he ever heard.\nFrom that moment on, Mike worked hard to buy Ruth her own burger stand. That misunderstanding has become a staple in the community for decades now. And while he gave the drugs up a long time ago, his memory never fully recovered. He readily admits that Ruth is the brains of the outfit.\nMike Garrison is in his early 60s, with a stocky build and a weathered, easygoing face that often carries a big, friendly smile. His thick, silver-gray hair still hints at the carefree days of his youth, and he usually sports a well-worn ball cap or the classic paper diner hat while working at the stand. Mike&#039;s style is a blend of practical and nostalgic, often seen wearing a white short-sleeved button-up shirt, tucked into his faded jeans or diner uniform. His voice is warm and booming, quick to share a joke or story from his hippie days, though his past drug use often leads to some comically hazy recollections.\nRuth Garrison is in her late 50s, shorter and more slender than Mike, with neatly styled salt-and-pepper hair often tied back in a simple bun. Her face has a warm yet practical expression, and while she doesn’t smile as often as Mike, when she does, it’s with a quiet, knowing grace. Ruth’s sharp blue eyes seem to notice everything around her, including the details Mike often misses. Her attire is always neat and functional, typically a white blouse beneath a striped apron, making her look like the efficient, hardworking heart of the Frozen Cow. While Ruth is more reserved, she’s also quick-witted and known for her dry sense of humor, especially when it comes to teasing Mike.\nTogether, they’re a contrasting but complementary pair—Mike, the talkative charmer, and Ruth, the quiet but sharp backbone of the operation."},"01-Caroline-College/04-Watashuka/02-People/Norm-Habersham":{"title":"Norm Habersham","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/04-Watashuka/02-People/Margaret-Wilkins"],"tags":["TTRPG","Horror"],"content":"\nNorm Habersham\nNorm Habersham, now in his early-60s, stands at the editorial desk of The Prairie Press, a figure both familiar and respected in Watashuka. His graying hair is neatly combed, though thinning on top, and his face bears the wrinkles of a life spent both in service and in thought. His sharp blue eyes, which once scanned the horizon as a Navy sailor, now focus intently on the papers and notes before him, always keen and observant. His serious expression give him the look of a man who has seen more than he lets on. Norm is dressed simply, wearing a button-down shirt with short sleeves, the look of someone who values practicality. His well-worn brown slacks show the signs of a man who has spent years in the field. His once-strong frame has diminished with age, but there is still a sense of purpose in the way he carries himself. A wristwatch and a leather notebook always seem to be at hand, tools of a journalist who is ever ready to document a story.\n*Behind Norm is the cluttered office of The Prairie Press, where stacks of newspapers and files lie in organized chaos. The atmosphere is one of quiet focus, much like Norm himself—calm, thoughtful, and always working, whether it’s on the next headline or a small-town mystery.\n\nAge: 61 (in 1983)\nRole: Norm Habersham is the senior editor of The Prairie Press, Watashuka&#039;s local newspaper. A WWII Navy veteran, Norm returned to his hometown after the war and dedicated himself to journalism. He has been at The Prairie for over 30 years, gaining a reputation as a reliable and steadfast figure in the town’s media landscape. Norm is highly respected for his thorough reporting, calm demeanor, and no-nonsense approach to both journalism and life.\nPublic Career: Over the decades, Norm has covered countless events, both big and small. His dedication to documenting the town’s history, from civic improvements to local tragedies, has made him an integral part of Watashuka’s fabric. He succeeded Margaret Wilkins as senior editor in 1950 and has carried on the paper’s legacy with diligence. Norm’s focus is primarily on local news, keeping residents informed about school board meetings, town hall decisions, and community events.\nKey Events Covered:\n\nThe Cold Flames at Stratton Mill (1955): Norm was one of the first on the scene after the historic Stratton Mill burned down in a mysterious cold fire. Official reports attribute the blaze to a malfunction in the mill’s equipment, but Norm’s careful documentation of eyewitness accounts—mentioning ghostly flames that neither spread nor consumed—has left some readers puzzled to this day.\nDestruction of South High School (1971): South High School’s destruction in a boiler explosion shook the town. The official story points to students tampering with the boiler after a heated basketball game against Delavan High School, but Norm’s in-depth investigation at the time raised questions about unusual circumstances surrounding the incident.\nThe Parade Storm (1959): A freak storm hit Watashuka during a summer parade, injuring several attendees. Norm reported on the suddenness of the storm and the way it seemed to focus on the parade route. Witnesses spoke of strange winds and a sensation of being watched, though Norm’s article stuck to the basics, leaving the oddities out of print.\nThe Harvest Moon Disappearance (1967): A local farmer vanished without a trace during the annual Harvest Moon Festival. Norm’s story was the first to suggest that his disappearance might be linked to strange symbols found on his land—a detail the police chose not to publicize.\n\n\nPublic Perception: Norm is widely seen as the last of the old guard in Watashuka. To the townspeople, he is a fixture of the community—someone who has always been around and who is trusted to get the facts straight. He is known for being reliable, discreet, and composed, even in the face of strange occurrences. Many see him as the voice of reason, especially when bizarre rumors circulate through town.\n"},"01-Caroline-College/04-Watashuka/02-People/Ronnie-Regan":{"title":"Ronnie Regan","links":["01-Caroline-College/04-Watashuka/01-Locations/Peach-Street-Library","North-High-School","01-Caroline-College/04-Watashuka/02-People/Sly-Coolstein"],"tags":["TTRPG","Horror"],"content":"\nRonnie &quot;Moonglow&quot; Regan\nAs the afternoon sun filters through the dusty windows of the Peach Street Library, Ronnie hums softly to herself while shelving a stack of books. Her fingers trace over the spines of old volumes as if they hold untold secrets waiting to be discovered. She pushes her glasses up her nose, curls falling across her face as she eagerly flips through a dusty tome of local legends. &quot;Have you ever heard of the Cold Flames at Stratton Mill?&quot; she asks Sly, her green eyes lighting up with curiosity. It&#039;s clear that Ronnie&#039;s passion for the unknown runs deep, and those who know her find it hard not to get caught up in her excitement.\nRole/Title: Assistant Librarian at Peach Street Library, Junior at North High School\nDescription: Ronnie Regan, a 17-year-old junior at North High School, has a vibrant personality and an infectious curiosity about the world, especially the mysteries hidden within it. With her cascade of curly red hair and her round glasses, Ronnie is known for her distinctive thrift-store style, inspired by her parents&#039; hippie past. She spends most of her free time volunteering at the Peach Street Library, assisting the head librarian, Sly Coolstein, in organizing books and cataloging old manuscripts. Though young, Ronnie is already becoming somewhat of a local expert on Watashuka’s folklore, thanks to her boundless enthusiasm for the occult."},"01-Caroline-College/04-Watashuka/02-People/Sly-Coolstein":{"title":"Sly Coolstein","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/04-Watashuka/01-Locations/Peach-Street-Library"],"tags":[],"content":"\nSly Coolstein\nOn any given day, Sly can be found behind the library’s main desk, surrounded by stacks of old books and the faint smell of aging paper. He adjusts his glasses and peers at an ancient tome, engrossed in its contents, oblivious to the children giggling behind him as they whisper yet another teasing nickname. One of the kids calls out, &quot;Hey, Sly Foolstein!&quot; He mumbles something incomprehensible under his breath but doesn’t look up. He’s too deep into a translation of an obscure 15th-century manuscript to care. Ronnie, his bright-eyed assistant, pokes her head out from between the shelves and gives him a grin. She knows Sly’s mind is a maze of ancient knowledge, and though she tries her best to keep up, she’s content to let him get lost in his books.\nDescription: Sly Coolstein, the head librarian of Watashuka’s Peach Street Library, has been a fixture in the town for decades. With thinning gray hair, large round glasses, and a perpetually ink-stained vest, Sly is the picture of a bookish recluse. His unassuming nature and deep knowledge of obscure literature make him a quiet, though essential, part of the community. Despite his awkward demeanor and forgettable appearance, Sly is always willing to help those who share his love for books and history."},"01-Caroline-College/05-Factions/Amish":{"title":"Amish","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/03-The-College/00-Information/Caroline-College"],"tags":["TTRPG","Horror"],"content":"Amish Community\n\n\nOverview:\nThe Amish in the Watashuka region are known for their simple, agrarian lifestyle, adhering to traditional values and shunning modern technology. They live in close-knit, self-sufficient communities and are largely seen as peaceful, humble farmers who avoid interacting with the outside world except for essential trade and commerce. To the people of Watashuka, the Amish represent a way of life removed from the complexities of modern society, focused on faith, family, and farming.\n\n\nHistory in the Region:\nThe Amish first arrived in the Watashuka region in the late 19th century, following the destruction of Prairieville Academy in 1860. Drawn to the fertile farmlands and the opportunity to live a quiet, devout life, the Amish settlers established their community on the outskirts of town. Their migration to the region was seen as part of a broader movement of Amish groups across the Midwest, seeking isolated areas where they could practice their faith and maintain their traditional ways without interference from modern society.\nThe Amish quickly became a respected part of the community, known for their hardworking nature and their ability to produce high-quality agricultural goods. Over the years, they have maintained their cultural and religious identity, staying separate from most of Watashuka’s daily life, though their presence at local markets and interactions with the townspeople have remained constant. Their farms, with their iconic horse-drawn buggies and simple wooden houses, have become a familiar sight in the area, adding to the rural character of the region.\nDespite their isolation, the Amish have seen the area change drastically around them, especially with the expansion of Caroline College and the growing influence of modern technology in Watashuka. While they have largely avoided getting involved in the town’s political or social issues, their commitment to their way of life remains steadfast.\n\n\nPublic Role:\nThe Amish are respected by many in Watashuka for their hard work and strong moral principles. They are seen as devout Christians who have little interest in the town’s social or political matters, preferring to remain isolated within their own communities. They maintain a small presence at local markets, where they sell produce, handmade goods, and dairy products to the townspeople. While they are a part of the fabric of Watashuka life, the Amish keep a polite distance from most public affairs, rarely involving themselves in town events or controversies.\n\n\nTraditional Values:\nThe Amish are known for their emphasis on family, religious devotion, and a lifestyle free from modern conveniences. Their plain clothing, horse-drawn buggies, and lack of electricity make them stand out, but their dedication to their faith earns them the respect of the broader community. They are seen as honest, hardworking people who live simply and avoid the distractions and corruptions of modern life.\n\n\nPublic Perception:\nWhile they are generally well-regarded, the Amish are often seen as mysterious by the people of Watashuka. Their strict separation from modern society leads to occasional rumors and misconceptions, with some townspeople viewing them as overly rigid or old-fashioned. However, most interactions with the Amish are positive, and their contributions to the local economy through farming and crafts are appreciated. Their quiet, humble presence adds a sense of rural tranquility to the area.\n\n"},"01-Caroline-College/05-Factions/Ho-Chunk":{"title":"Ho-Chunk","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/03-The-College/00-Information/Caroline-College"],"tags":["TTRPG","Horror"],"content":"Ho-Chunk People\nOverview:\nThe Ho-Chunk Nation, also known as the People of the Sacred Voice, are the original inhabitants of the land surrounding Watashuka. Their ancestors have lived in the region for centuries, long before European settlers arrived. The Ho-Chunk have a deep connection to the land, its natural resources, and its spiritual significance. Though their population has diminished over time, the Ho-Chunk remain an integral part of the region’s cultural and historical landscape.\nCultural Significance:\nThe Ho-Chunk people have long believed that the land around Watashuka is sacred. Their traditions emphasize harmony with nature, and they hold regular ceremonies to honor the spirits of the earth. For generations, they have passed down their knowledge of the land’s unique spiritual energy, teaching that certain locations are sites of great power. These beliefs continue to influence the Ho-Chunk’s way of life, as they strive to preserve their cultural heritage and protect the land from further exploitation.\nCommunity and Economy:\nIn modern times, the Ho-Chunk maintain a presence in the region through their cultural centers and participation in local events. They are known for producing traditional crafts, offering educational programs on Ho-Chunk history, and organizing cultural festivals that attract visitors from surrounding areas. The Ho-Chunk people also operate businesses in and around Watashuka, including agriculture and tourism, which provide them with economic stability while preserving their connection to the land.\nChallenges:\nThe Ho-Chunk community, like many Indigenous groups, faces ongoing challenges related to land rights, cultural preservation, and the encroachment of modern society. Government projects, such as the construction of Caroline College and various agricultural developments, have threatened Ho-Chunk sacred sites over the years. Despite these challenges, the Ho-Chunk remain resilient, working to protect their traditions while engaging with local and state authorities to ensure that their voice is heard in decisions impacting the region.\nCultural Preservation:\nThe Ho-Chunk Cultural Heritage Museum in Watashuka serves as a focal point for preserving and sharing their history. It offers exhibits on traditional Ho-Chunk life, artifacts from the past, and explanations of their spiritual beliefs, providing both locals and visitors with an opportunity to learn about their culture. Educational programs are also offered to local schools, helping to ensure that future generations understand the importance of the Ho-Chunk people’s connection to the land."},"01-Caroline-College/05-Factions/Lutheran-Church":{"title":"Lutheran Church","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/06-Events/Great-Influx","01-Caroline-College/06-Events/Blizzard-of-1888","01-Caroline-College/05-Factions/Watashuka-Initiative","01-Caroline-College/05-Factions/Ho-Chunk"],"tags":["TTRPG","Horror"],"content":"Lutheran Church\n\n\nRole: The Lutheran Church represents the largest religious institution in Watashuka and is seen as a stabilizing force in the community. With half of the town’s population attending services, the church plays a crucial role in maintaining the spiritual and moral framework of the town. The congregation is unaware of any real supernatural forces at work and believes their primary concern is protecting the town from ‘devil worshipers’ and cultural shifts infiltrating the college and community.\n\n\nHistory: The Lutheran Church’s influence in Watashuka dates back to the Great Influx following the Blizzard of 1888, when large numbers of Lutheran settlers arrived in the region to offer humanitarian aid. Many of these settlers were recent immigrants from Germany, and after helping the region recover from the devastating storm, they decided to make Watashuka their home. Their arrival significantly shaped the town’s religious and cultural identity, as they established churches, schools, and community centers that reflected their Lutheran values. Over time, the church grew to become the dominant religious institution in the area, cementing its place as a cornerstone of Watashuka&#039;s life.\n\n\nCommunity Involvement: The church is actively involved in organizing charity events, supporting local families, and fostering engagement with youth. They are also quietly helping protect the community, providing sanctuary to troubled individuals and maintaining the town’s cemetery with a sense of reverence. Their work has helped maintain a strong moral foundation in Watashuka, particularly as the town faces economic decline.\n\n\nProtecting Congregants: The church leadership has noticed strange behavior among some congregants and is taking steps to protect the flock from potential outside influences, including what they perceive as destructive and unholy. Pastors occasionally perform exorcisms, trying to rid people of what they believe are signs of demonic possession. In each case, those subject to possession all share two common traits; heavy metal music and role-playing games.\n\n\nSupporting the Watashuka Initiative: Some church leaders previously supported the Watashuka Initiative, a government project designed to bring economic and technological development to the region, officially ending in 1969. They believed it was beneficial to the community and even offered prayers for its success. However, with the initiative&#039;s end, the church has continued to focus on local outreach, charity efforts, and new government initiatives being considered.\n\n\nEngaging with the Ho-Chunk: In recent years, some members of the Lutheran Church have cautiously engaged with the local Ho-Chunk people, seeking to understand their traditions. These interactions are seen as efforts to foster cross-cultural respect, though some view these efforts with suspicion.\n\n"},"01-Caroline-College/05-Factions/Metalheads":{"title":"Metalheads","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/05-Factions/Mothers-Opposing-Metal"],"tags":["TTRPG","Horror"],"content":"MOM Newsletter: Special Edition – URGENT ALERT\n\nMOTHERS OPPOSING METAL\nDefending Watashuka’s Morals and Protecting Our Children\nSeptember 1983 Special Edition: The Metalhead Threat Escalates!\n\nDear Concerned Parents and Members of the Watashuka Community,\nWe write to you today with the utmost urgency regarding a disturbing and dangerous trend that has emerged in our beloved town. As you know, our mission in Mothers Opposing Metal (MOM) has always been to protect the innocence of our children and safeguard our community from the ever-present threat of Satanic influence. It is with great sadness and alarm that we must report on a new development in the alarming behaviors of the so-called &quot;Metalheads&quot; in our midst.\nWe have long been aware of the corrupting influence of heavy metal music and role-playing games, but recent events have revealed that these youths—already steeped in the glorification of violence, Satanism, and rebellion—are now engaging in criminal activity. Their actions are more than just a public nuisance; they represent a grave danger to our children, our families, and our way of life.\n\nMetalheads Target Local Children: Reports of Kidnapping in Mackie Recreational Park!\nIt has come to our attention that children in Mackie Recreational Park have been approached and, in some cases, lured away by members of the Metalhead subculture. These individuals, easily identifiable by their long hair, black leather jackets, and offensive band logos, have been seen loitering near the playgrounds and picnic areas, targeting our most vulnerable. Multiple concerned parents have reported strange behavior from these Metalheads, who reportedly entice children with promises of &quot;fun&quot; and &quot;games,&quot; only to disappear with them into the wooded areas surrounding the park. Parents tell us that their children were abused, forced to bless Satan, and then hypnotized to forget the event.\nAlthough no children have officially been reported missing yet, we believe this is only the beginning. The Watashuka Police Department has been notified, and we urge all parents to keep a close watch on their children, especially as Halloween approaches—a time when these devil-worshiping youths are known to celebrate their twisted rituals. We believe the Metalheads are using role-playing games as a way to indoctrinate children into their dark world, encouraging them to escape reality and immerse themselves in dangerous fantasies of occult power and rebellion.\n\nSatanic Rituals and Stolen Farm Animals: A New Horror on the Outskirts\nDisturbingly, we have also received multiple reports from local farmers who have found their livestock missing or mutilated in recent weeks. It is no coincidence that these incidents coincide with an increase in Metalhead activity in the area. Eyewitness accounts describe groups of these Metalheads gathering near remote barns and abandoned buildings late at night, playing their demonic music at high volumes and conducting what can only be described as ritualistic ceremonies.\nOur sources indicate that the Metalheads are using these stolen animals in Satanic rituals, mimicking the horrific sacrifices described in their heavy metal lyrics and the darkest of their role-playing games. These games, which often feature blood magic, demon-summoning, and the sacrifice of innocent creatures, have desensitized these youths to real-life violence and depravity. What starts as a game can easily become reality, and the lines between fantasy and real-life horror are quickly disappearing for those trapped in this lifestyle.\n\nHow You Can Protect Your Children and Our Community:\nWe urge all parents and concerned citizens to take the following steps to protect our town from the influence of the Metalheads:\n\nStay Vigilant in Public Spaces: Do not allow your children to wander alone in parks or public areas, especially after dark. The Metalheads are known to operate under the cover of night.\nMonitor Your Children’s Activities: Keep a close eye on the music your children are listening to and the games they are playing. If you see any signs of involvement with heavy metal music or role-playing games, intervene immediately.\nReport Suspicious Activity: If you see Metalheads congregating near schools, parks, or your neighborhood, do not hesitate to contact the police. Together, we can put an end to their criminal activity.\nSpread the Word: Share this newsletter with your friends and neighbors. The more people are aware of the Metalhead threat, the better we can defend our community.\nAttend Our Next Meeting: Join us at All Saints Lutheran Church this Friday evening for a special prayer service and strategy session on how we can continue to fight back against these dark influences. We must show these Metalheads that our community will not stand for their wicked behavior!\n\n\nClosing Thoughts:\nRemember, fellow mothers and fathers, we stand on the front lines in the battle for our children’s souls. The threat posed by these Metalheads is real and growing. Their music, their games, and their lifestyle glorify Satanic rituals and violent rebellion. We cannot let this evil take root in Watashuka.\nLet us continue to pray for our town, for our children, and for the courage to stand strong in the face of darkness. Together, we will protect Watashuka from the corruption that seeks to destroy it.\nWith steadfast resolve,\nNancy Mueller\nPresident, Mothers Opposing Metal\n\nRemember: Our children are watching. Our future depends on us."},"01-Caroline-College/05-Factions/Mothers-Opposing-Metal":{"title":"Mothers Opposing Metal","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/05-Factions/Metalheads","01-Caroline-College/03-The-College/02-People/Michelina-Plum","01-Caroline-College/03-The-College/01-Locations/WCTU","01-Caroline-College/04-Watashuka/02-People/Dave"],"tags":["TTRPG","Horror"],"content":"Mothers Opposing Metal (MOM)\n\n\nOverview:\nMothers Opposing Metal (MOM) is a highly vocal, conservative group based in Watashuka, comprised of concerned mothers, fathers, and other community members who believe that heavy metal music, role-playing games, and youth counterculture are gateways to devil worship and societal decay. Founded in response to the growing popularity of metal music and games like Dungeons &amp; Dragons, MOM seeks to protect the town’s youth from what they perceive as occult influences, primarily targeting the local Metalheads and their culture.\n\n\nRole in Town:\nMOM has a strong influence over local politics, religious organizations, and the school system. Their efforts are centered on pressuring the Lutheran Church, the school board, and law enforcement to crack down on what they see as &quot;satanic&quot; influences in the town. Their public demonstrations, prayer vigils, and moral crusades often succeed in getting certain music, books, and games banned from schools and public spaces.\n\n\nBase of Operations:\nMOM holds regular meetings at All Saints Lutheran Church, where its members gather for prayer, discussion of moral values, and the planning of public demonstrations. They also meet in the living rooms of prominent members for smaller organizing sessions. These gatherings are focused on protecting the youth and ridding the town of what they see as satanic influences.\n\n\nNotable Figures:\n\nNancy Mueller (Leader): Nancy is the founder of MOM and the wife of Pastor Daniel Mueller. She believes that Watashuka’s moral decay is a result of allowing corrupt influences like metal music and role-playing games to take root in the community. Nancy is deeply religious and sees herself as the moral protector of the town.\nSandra Pike: Sandra is Nancy’s second-in-command, known for her fiery speeches and ability to mobilize the group’s members. She often leads public rallies and demonstrations against the metalhead culture.\nKaren Albright: A zealous member of MOM, Karen is obsessed with monitoring the actions of the local Metalheads, particularly because her own son has secretly joined the group. Her personal vendetta fuels much of her crusade.\nMichelina Plum: Local radio personality at WCTU. Michelina is obsessed with the corrupting impact of heavy metal music and has  special hatred for the pirate radio host known only as &quot;Dave&quot;.\n\n\n\nPublic Activities:\n\nPublic Demonstrations: MOM frequently organizes protests and prayer vigils at events they see as promoting occult influences, including concerts, game nights at Jack’s Surfer, and gatherings of local Metalheads. These events draw attention from the local media and further the group’s agenda of moral purity.\nMoral Crusades: The group has successfully lobbied local authorities to raid Jack’s Surfer, confiscating records, game books, and other materials they deem to be satanic. They have also convinced the school board to ban certain music and literature from North High School, believing these materials to be dangerous for the youth.\nSurveillance of Youth: MOM members keep a close eye on the town’s teenagers, monitoring their activities and friendships. They report any &quot;suspicious&quot; behavior—such as listening to metal music or playing role-playing games—to local authorities, often resulting in unwarranted crackdowns on harmless teenage rebellion.\n\n\n\nPublic Perception:\nMOM is respected by many of the older, more religious townspeople, who see the group as a moral force protecting the town from corruption. However, younger generations—particularly the Metalheads—view them as overbearing and out of touch with reality. While they succeed in banning certain materials, many see their activities as distractions from more serious issues.\n\n"},"01-Caroline-College/05-Factions/Watashuka-Initiative":{"title":"Watashuka Initiative","links":["01-Caroline-College/03-The-College/00-Information/Caroline-College"],"tags":["TTRPG","Horror"],"content":"The Watashuka Initiative\n\nReport Summary:\nProject Title: Watashuka Initiative, colloquially &#039;Project Caroline&#039;\nDuration: 1940 - 21 December 1969\nLocation: Watashuka, Midwest U.S.\nPrimary Focus: Scientific Research into Agricultural Development and Food Preservation\n\nBackground and Purpose:\nThe Watashuka Initiative was established in the early 1940s under the auspices of the U.S. government&#039;s Office of Scientific Research and Development (OSRD), as part of a broader effort to investigate and develop underutilized rural regions in America. Officially framed as an agricultural research and development project, the Watashuka Initiative focused on improving farming techniques, soil fertility, and maximizing land usage in the fertile Midwest. The program, initially spurred by the needs of wartime agricultural production during World War II, aimed to harness new technologies and scientific advancements to benefit local farming communities, particularly around the Caroline Religious Teaching College. The teaching college always had a strong agricultural program so it made a logic choice. Under government directive, the school was renamed to Caroline College.\nBeyond agricultural research, the project also explored regional geological and meteorological phenomena, seeking to understand the unusual weather patterns and natural occurrences reported in the area. The combination of scientific curiosity, wartime necessity, and regional investment helped the Initiative gain a reputation as a forward-looking, government-backed research project.\nMajor Accomplishments:\n\nAgricultural Development: The Watashuka Initiative was responsible for significant advancements in agricultural practices in the region. It introduced new crop rotation systems, irrigation methods, and fertilizer technologies that helped increase yields for local farmers. These developments were quickly adopted by the broader Midwest agricultural community.\nCommunity Engagement: The Initiative fostered strong ties between the government and the local population. In addition to improving agricultural output, it funded the construction of local infrastructure, including roads, irrigation systems, and educational facilities associated with Caroline College.\nScientific Research: While primarily focused on agriculture, the Watashuka Initiative also conducted research into unusual environmental phenomena reported in the area. These studies were part of an effort to explain the strange occurrences observed by local residents, though no official explanations were ever publicly released.\nFood Preservation: In support of the space race, the program began to research new methods of food preservation for long term space travel.\n\nClosure of the Watashuka Initiative:\nIn 1969, amid growing public scrutiny, and concerns over government overreach, the Watashuka Initiative was officially terminated under the directive of President Richard Nixon. The decision came as part of a broader effort to scale back federal programs and reduce government intervention in local affairs. Publicly, the closure was framed as a result of the project’s success in modernizing the region’s agriculture and a shift in national priorities following the end of the space race.\nHowever, rumors circulated that the real reason for the closure involved internal government reports indicating the program had strayed from its original purpose. Allegedly, some researchers had begun investigating anomalous phenomena in the Watashuka area, raising concerns about the safety and ethics of continuing such research. Despite these rumors, the official explanation remained that the Initiative had completed its goals and was no longer necessary.\nLegacy:\nThough officially ended, the legacy of the Watashuka Initiative can still be seen today in the local infrastructure and agricultural techniques implemented during the program. Watashuka remains a hub of rural farming activity, with many of the advancements introduced by the Initiative continuing to benefit the local economy. Additionally, the Initiative&#039;s closure led to a lingering sense of mystery in the region, with residents occasionally referencing the program in relation to the strange and unexplained events that continue to occur. To this day, some locals speculate that the government’s decision to close the project may have been influenced by more than just agricultural successes, though no official records support these claims.\n\nFinal Status: Terminated (1969) under presidential directive. All research and operational activities officially ceased."},"01-Caroline-College/06-Events/Blizzard-of-1888":{"title":"Blizzard of 1888","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/06-Events/Great-Influx","01-Caroline-College/05-Factions/Lutheran-Church","01-Caroline-College/03-The-College/00-Information/Caroline-College"],"tags":["TTRPG","Horror"],"content":"Blizzard of 1888\nThe Blizzard of 1888 is remembered as one of the most devastating natural disasters in Watashuka&#039;s history. In January 1888, a sudden and violent snowstorm swept across the region, burying homes, freezing livestock, and leaving the town struggling for survival. The storm was so intense that temperatures dropped to dangerous levels within hours, and snowdrifts reached several feet, isolating entire communities. The storm lasted for days, leaving a landscape of snow and ice that destroyed much of the area’s infrastructure.\nImpact on the Town: Entire families were trapped in their homes, and the storm claimed the lives of many who couldn’t escape its reach. Farmers lost livestock, crops were ruined, and the town’s growing population faced severe food shortages in the weeks that followed. For many, the blizzard was seen as a sign of the region’s unforgiving nature, with settlers wondering whether the land could truly be tamed.\nRelief Efforts and the Great Influx: The disaster triggered a humanitarian response from Lutheran settlers, particularly from German immigrant communities who traveled to the region to provide aid. These settlers brought food, supplies, and the knowledge needed to survive such harsh conditions. Known as the Great Influx, this movement of Lutheran immigrants not only helped the region recover but also led many to stay and settle in Watashuka, laying the foundation for the town’s strong Lutheran presence.\nBy 1890, many of these settlers had established churches and schools, and their contributions helped Watashuka rebuild after the storm. The Caroline Religious Teaching College was founded as a direct result of their efforts to educate future generations and provide spiritual guidance to the region. This period marked the beginning of a new era for the town, with the Lutheran Church playing a key role in shaping its cultural and religious identity.\nLegacy: The Blizzard of 1888 is still spoken of with awe and respect by the people of Watashuka. It is remembered as a turning point in the town’s history, not only for the lives lost but for the resilience and community spirit it inspired. The storm solidified the town’s Lutheran roots and marked the arrival of a new chapter in its development, as settlers turned tragedy into opportunity. The blizzard is commemorated in local history as a testament to the strength and faith of those who survived."},"01-Caroline-College/06-Events/Great-Influx":{"title":"The Great Influx","links":["01-Caroline-College/04-Watashuka/00-Information/Watashuka","01-Caroline-College/06-Events/Blizzard-of-1888"],"tags":["TTRPG","Horror"],"content":"January 12, 1897\nWatashuka, Wisconsin, United States\nDear Brother Heinrich,\nI trust this letter finds you in good health, and I pray the Lord’s blessings continue to rest upon your ministry in Germany. It has been nearly nine years since I arrived in this distant land, and I feel it is finally time to recount for you the story of our Great Influx into what we now call Watashuka - a story of both hardship and divine providence.\nAs you may recall, in January of 1888, a terrible blizzard struck this region. The storm was like none we had ever seen, a merciless torrent of snow and ice that swallowed entire homes and froze men, women, and livestock in their place. It was a catastrophe that left the land paralyzed, and many of the early settlers here wondered if God had forsaken this place.\nBut it was in the midst of this devastation that the Lord called us, His faithful servants, to action. Word of the suffering reached our Lutheran congregations scattered across neighboring states, and we knew we could not stand idle. The people of Watashuka were in dire need—not only of food and shelter but of hope. I, along with many other brothers and sisters in the faith, packed our wagons with what provisions we could muster and set out for this desolate land.\nWhat we found upon our arrival was a sight of utter ruin. Fields that had once been fertile lay buried under the snow, and the faces of those we came to help were gaunt with despair. Yet, through their trials, we saw a flicker of light—the potential for a new community to rise from these ashes. With the Lord’s guidance, we brought what aid we could, but more importantly, we brought with us the message of His love and salvation.\nBy the grace of God, many of us chose to stay. What began as a mission of relief soon turned into something far greater—a new beginning. We built churches, schools, and homes, binding ourselves to this land and to one another. In the years since, we have seen Watashuka grow. The Caroline Religious Teaching College was established just two years ago in 1895, and it has already become a beacon of learning and faith for the region. Here, young men and women are being trained not only in the ways of the world but in the Word of God, ensuring that this land will continue to be a place of faith and righteousness.\nThe trials we faced during that dreadful winter were not in vain. We now see that the Lord used the blizzard not as a punishment but as a test, a crucible through which this community could be forged. Those of us who arrived in the wake of the storm have come to be known as the Great Influx, and though we did not seek such recognition, it is clear that God had a plan for us. We were His hands and feet in a time of great need, and now we are the foundation of a growing and devout Lutheran community. This morning alone we have lain the cornerstone for our new church.\nI write all this to you, dear Heinrich, not to boast of our works but to testify to the Lord’s faithfulness. He has turned a great disaster into an opportunity for His glory to shine, and it is with a grateful heart that I share this story with you.\nMay God continue to bless you in your ministry, as He has so richly blessed us here in Watashuka. I look forward to hearing news of your work in Germany, and I pray that one day you might visit this place to see with your own eyes what the Lord has accomplished through us.\nIn His Service,\nPastor Wilhelm Kraus"},"01-Caroline-College/06-Events/The-Baptism-of-'39":{"title":"The Baptism of '39","links":["01-Caroline-College/04-Watashuka/02-People/Margaret-Wilkins"],"tags":["TTRPG","Horror"],"content":"Tragedy at Lake Mary: Baptism Ceremony Ends in Disaster\nOctober 14, 1939\nBy Margaret Wilkins, The Prairie Press\nA serene autumn evening on the shores of Lake Mary turned tragic yesterday as a mass baptism led by Reverend Frederick Olsen ended in disaster. What should have been a joyous occasion for the Lutheran Church has left the Watashuka community reeling, with several parishioners still unaccounted for.\nThe ceremony, intended to baptize new members of the church, began around dusk. Reverend Olsen, a man beloved by many in the congregation, led a group of thirteen down to the water’s edge, accompanied by the hymns and prayers of fellow churchgoers. The atmosphere was one of peace and spiritual renewal.\nThat peace was shattered when a thick fog rolled in from the lake, obscuring the shore. Witnesses reported strange lights hovering above the water and a sudden, unnerving stillness. What had been a calm and sacred moment swiftly turned to chaos.\n“Something wasn’t right,” said Helen Thomas, one of the witnesses standing on the shore. “The fog wasn’t natural. It felt... alive. And those lights, they weren’t lanterns or reflections. It was like they were floating just above the lake, and the air felt wrong.”\nSeveral of the parishioners, including Reverend Olsen, had entered the lake when the waters began to swell unnaturally, rising higher than anyone had seen before. According to witnesses, the water seemed to pull at those in the lake, dragging them in despite their efforts to return to shore.\n“I heard them calling out for help, but we couldn’t reach them,” said Peter McKenzie, another witness. “It was like the water was alive, pulling them in.”\nAs the fog thickened, those still on the shore were frozen in place, unable to move or speak. Some reported seeing strange shapes in the mist, distorted reflections that did not match the figures standing at the lake.\n“I saw myself,” said Judith Harper, one of the survivors, trembling. “But it wasn’t me. It was like a shadow of what I could have been—older, sadder. It didn’t make any sense.”\nBy the time the fog cleared, several of the participants had vanished into the lake, including longtime church member Thomas Pierce and new convert Ellen Linton. Reverend Olsen himself was pulled from the water by nearby parishioners, but several others were not so fortunate. Rescue efforts continued late into the night, but as of this morning, five parishioners remain missing.\nThe exact cause of the incident remains unclear. Sheriff Albert Reynolds described it as a “freak natural occurrence,” though he admitted that the suddenness and intensity of the fog were unusual for this time of year.\n“It was a terrible accident,” said Reverend Olsen in a brief statement this morning. “We were there to celebrate God’s grace, and something went terribly wrong. I ask the community to join me in prayer for the missing and their families.”\nThe Lutheran Church is urging the public to avoid speculation, though whispers of supernatural interference have already begun to circulate. Some locals recall past stories of strange happenings at Lake Mary, though they have long been dismissed as folklore.\nAs the search for the missing continues, Watashuka is left grappling with the mystery of what truly happened at the lake. What was meant to be a peaceful baptism has turned into a chilling reminder that not all is as it seems beneath the surface of our town.\nMargaret Wilkins\nThe Prairie Press"},"02-Terra-Mortuum/!Intro-Terra":{"title":"The World of Terra Mortuum","links":[],"tags":["TTRPG","Fantasy"],"content":"&quot;You had to go and learn for yourself, didn&#039;t you?&quot;\nA look of anger, panic and fear each fought to control his mother&#039;s face as she moved the hair from his ashen brow. Dobbin had seen each of these emotions overtake her before. His mother was nothing if not... excitable. OK, she was a lot excitable. But there was always some subtle tell; some sly hint that she wasn&#039;t truly angry or panicked or afraid. He always thought that she just liked making a scene. The over-the-top warnings, her cries of feigned fear when he got in a fight and her sobs over the dangers her &#039;stupid baby boy&#039; faced in his trades was just her excuse to be heard.\nThis was different. There was no cocked smile or quick wink now. There was only raw emotion.\nTime passed but he could not tell how long. As the young man&#039;s hands began to stiffen, and his vision clouded, he could just make out the tears that flowed down her face as she stood from where she was kneeling by his bed. She left his room quickly. As he tried to call out to her, tried to say he was sorry, only a wet grumble came from his throat. A mass fell from his mouth and his face began to twitch uncontrollably.\nHe was so cold. Cold and starving.\n\nA lifetime later she returned. The raw emotion replaced with cold, sterile, determination. In one hand she held the family&#039;s felling axe. In the other, the Beams of God that usually stayed above the hearth.\nAs she knelt once more by his bed, she whispered.\n&quot;I am so sorry baby.&quot;\nShe choked back the tears and continued.\n&quot;How many tales did we tell you? How many warnings to stay out of the Northern Fields? We didn’t do enough.&quot;\nThe battle with her emotions was taking a turn as her words began to take on the wet, fluid sound of uncontrollable loss.\nIt was then that Dobbin realized he had been holding his breath. As he tried to fill his lungs with air he found no heady relief; no soothing of the burning in his chest.\nHis eyes went wide as his heart began to slow.\nHis muscles started to twitch and break the bones of his toes.\nHis ears felt like they have been stuffed full of dandelion seeds.\nShe never let go of the hand of his hand. Even as the flesh pulled away from his nail bed and his convulsions tore through him with enough strength to break her little finger she held fast. She had failed him before. The least she could do now was to be with him while he was still … her baby.\nAnd then it stopped.\nLike a candle snuffed out, the boy... the human … died. She freed her damaged hand and stood.\nIn her good hand she reached down and cradled the Beams of God and tried to remember the ‘Prayer of the Good Death’. Slowly the words came to mind.\n&quot;O Spirit, As Dobbin journeys through the Sheltered Route&#039;s serene domain, Let him find rest from his mortal travels.&quot;\nAs she started, so too did the transformation. The human had left and the gravling was arriving much sooner than expected. He had spent too long in their domain. The days she had hoped the family had to mourn was quickly turning into minutes of terror.\n&quot;Gu-Gu-Guarded him from the clutches of a sleepless second life, so his soul may bask in the dreams of everlasting night.&quot;\nNever letting the sign of her family&#039;s faith slip from her good hand, she took up the axe in her broken one...just in case her prayer wasn&#039;t enough.\n&quot;In the Sheltered Route&#039;s Haven, let my little boy find reprieve,&quot;\nAs the broken shell of her only son started to rise, she thought of her daughters. The pain in her hand as she gripped the handle for the blow made the last line tear from her mouth like storm.\n&quot;Where eternal rest he shall achieve.&quot;"},"02-Terra-Mortuum/02-Setting-Rules/Potion-Brewing":{"title":"Potion Magic","links":[],"tags":["TTRPG","Fantasy"],"content":"Potion-Based Magic Mechanics\n\nThe magic of potions is the magic of the common people. Unlike &#039;True&#039; magic, potion magic is available to all species. Recipes must be learned or researched. The appropriate equipment must be available.\nThe intent is to provide a system similar to magic in Shadowdark, Old-School Essentials or other OSR system that works for this world. My goal was to make the system flavorful but still keep with the spirit of the systems.\n\nBrewing is a downtime activity\nUse can occur during action scenes\nSuccess/Failure is not a binary - partial success during use is possible.\n\nBrewing Potions\n\nPotion Brewing Skill: Characters with the &quot;Potion Mastery&quot; talent (or equivalent) can brew potions. To brew a potion, make a brewing check by rolling 1d20 + your Intelligence (or Alchemy) modifier.\nBrewing Difficulty: The DC to successfully brew a potion is 10 + the potion’s tier. Failure results in wasted ingredients and a potential mishap (similar to spellcasting mishaps).\nLong Brew Times: Brewing a potion typically takes several hours to several days, depending on the potion’s tier and complexity. This is a downtime activity.\nIngredients: More powerful potions require rarer, and more quest-worthy, ingredients.\n\nUsing Potions\n\nDelivery Methods: Potions must be consumed, splashed, inhaled, or otherwise applied to deliver their effects. When using a potion, the player rolls an &quot;Application Check,&quot; which determines whether the potion&#039;s effects succeed.\n\nCheck Type: Roll 1d20 + Dexterity (for thrown potions like splash vials) or opposed Constitution (for consumed or inhaled potions).\nDifficulty: The DC is 10 + the potion’s tier. On success, the potion works as intended.\nFailure: The potion fails to activate, potentially wasting the dose or having reduced effects.\n\n\n\nCritical Success &amp; Failure\n\nCritical Success (Natural 20): Double one of the potion’s numerical effects, such as increased damage, longer duration, or enhanced healing.\nCritical Failure (Natural 1): The potion backfires or has an unintended consequence. Roll on a mishap table specific to potion use (e.g., causing an explosion, poisonous vapors, or incorrect effect).\n\nPotion Tiers\n\nPotions, like spells, are divided into tiers (1–5). Higher-tier potions require rarer ingredients, more complex brewing processes, and longer preparation times.\n\nExample Tier 1 Potions: Healing Draft (equivalent to Cure Wounds), Fire Flask (equivalent to Burning Hands when splashed), Potion of Invisibility (mimics Invisibility).\nExample Tier 2 Potions: Acid Flask (equivalent to Acid Arrow), Levitation Brew (equivalent to Levitate), Paralysis Toxin (equivalent to Hold Person).\n\n\n\nDuration &amp; Range\n\nPotion Duration: Varies depending on the type. A healing draft may be instant, while a strength-enhancing potion may last several rounds. For splash potions like a Fire Flask, the effect is instantaneous.\nPotion Range: &quot;Self&quot; range means the potion must be consumed or applied by the user, while &quot;Near&quot; or &quot;Far&quot; potions (such as a splash vial) can be thrown up to a specific distance.\n\nIngredient Gathering\n\nPotions require specific ingredients, which players must gather during their adventures or purchase from specialists.\n\nRarity &amp; Cost: Higher-tier potions require rarer, more expensive ingredients.\nForaging Check: Players can search for ingredients in the wild by making a Nature or Survival check (DC depends on environment and ingredient rarity).\n\n\n\nPotion Mishaps Table\n(When rolling a natural 1 or failing critically on brewing/application)\nThe following are for inspiration.\n\nVolatile Reaction: The potion explodes in your hands, dealing 1d6 damage to you and anyone within close range.\nSpoiled Brew: The potion spoils, releasing a rancid odor that attracts nearby creatures within a near range.\nWrong Effect: The potion takes on the properties of a completely different brew (roll on a random potion table or GM’s choice).\nDelayed Activation: The potion doesn&#039;t work immediately; its effects trigger 1d6 rounds later, potentially at an inopportune time.\nToxic Fumes: The potion releases poisonous vapors, causing all creatures within close range to make a Constitution saving throw or take 1d6 poison damage.\nReduced Potency: The potion works, but at half its normal strength (e.g., healing half as much or dealing half damage).\nBackfire: Instead of affecting the target, the potion affects the user (or the wrong target, if thrown).\nSticky Residue: The potion leaves a sticky film on everything it touches, halving the target’s movement speed for 1d4 rounds.\nCorrupted Brew: The potion’s magic backfires, causing the user to suffer 1d4 temporary Constitution damage for 1d4 hours.\nOverload: The potion’s effects are amplified, but in an uncontrolled way. Damage, healing, or other effects are doubled, but the user suffers 1d4 rounds of debilitating fatigue afterward.\nHallucinations: Instead of the intended effect, the potion causes vivid hallucinations lasting 1d6 rounds, making it difficult to distinguish friend from foe.\nReverse Effect: The potion has the opposite effect of what was intended (e.g., a healing potion causes damage, a fire potion creates ice).\nUnstable Mutation: The user grows an extra limb, eye, or other minor mutation for 1d4 hours, causing a -2 penalty to Dexterity-based checks.\nSpilled or Shattered: The potion container slips from your hands, shattering on the ground and becoming unusable.\nMind Numb: The potion causes the user’s mind to temporarily go blank, imposing disadvantage on Intelligence-based checks for 1d4 hours.\nFoul Taste: The potion is so foul-tasting that the user vomits immediately, losing their next action.\nCombustion: Upon application, the potion causes the target (or user, if consumed) to ignite in flames, taking 1d6 fire damage each round until extinguished.\nMagical Echo: The potion’s effect repeats uncontrollably, causing the same effect to happen again in 1d4 rounds (potentially with disastrous results).\nInversion: The potion causes all spells or magic effects on the user to invert for 1d4 rounds (e.g., healing becomes harm, protection becomes vulnerability).\nRandom Effect: The potion has an entirely random effect.\n\nTier 1 Potions (Basic and common potions)\nIt is assumed that the ingredients to prepare these are minor in cost and/or require a DC 11 (10 + 1) to forage.\n\nHealing Draft: Restores 1d6 HP when consumed.\nFire Flask: A throwable potion that deals 2d6 fire damage in a small area.\nLight Potion: Causes the drinker or thrown object to glow brightly for 1 hour.\nPotion of Feather Fall: Reduces falling speed, preventing damage from falls for 1 minute.\nSleep Mist: Creates a vapor that causes creatures in a close range to fall asleep for 1d4 rounds.\nPotion of Strength: Grants +1 to Strength for 1d4 hours.\nVenom Vial: When applied to a weapon, the next attack delivers 1d6 poison damage.\nPotion of Spider Climb: Allows the drinker to walk on walls and ceilings for 10 minutes.\nPotion of Lesser Invisibility: Grants invisibility for 1d4 rounds or until the drinker takes action.\nSonic Burst Flask: Emits a loud, disorienting sound, causing creatures in a close range to be stunned for 1 round.\nPotion of Resist Cold: Grants the drinker resistance to cold damage for 1 hour.\nPotion of Darkvision: Allows the drinker to see in complete darkness for 1 hour.\nPotion of Water Breathing: Grants the ability to breathe underwater for 1 hour.\nPotion of Speed: Increases the drinker’s movement speed for 10 minutes.\nCharm Elixir: When consumed, grants advantage on Charisma-based checks for 1 hour.\nStone Skin Oil: When rubbed on the skin, grants +2 to AC for 1d4 rounds.\nPotion of Clarity: Removes fear, confusion, or charm effects when consumed.\nFlame Oil: Coats a weapon in flames for 1 minute, adding 1d4 fire damage to attacks.\nTanglefoot Vial: A thrown vial that creates sticky vines, trapping creatures in a close range for 1d4 rounds.\nPotion of Minor Healing: Heals 1d4 HP when consumed (less potent than the Healing Draft).\n\nTier 2 Potions (More complex and powerful potions)\nIt is assumed that the ingredients would be available in a well stocked city for a reasonable cost and/or require a DC 12 (10 + 2) to forage.\n\nGreater Healing Elixir: Restores 2d6 HP when consumed.\nAcid Flask: A throwable potion that deals 3d6 acid damage to a target.\nInvisibility Brew: Grants invisibility for up to 10 minutes or until the drinker takes action.\nLevitation Draught: Allows the drinker to levitate a close range off the ground for 10 minutes.\nPotion of Giant Strength: Grants +2 to Strength for 1d4 hours.\nFrostbite Flask: Deals 3d6 cold damage in a close radius when thrown.\nPotion of Fire Resistance: Grants resistance to fire damage for 1 hour.\nParalysis Poison: When applied to a weapon, causes the next attack to paralyze the target for 1d4 rounds (save negates).\nPotion of Stone Form: Turns the drinker’s body into solid stone, making them immune to damage but unable to move for 1 minute.\nPhantom Step Potion: Allows the drinker to teleport up to near range once within 10 minutes of consuming.\nPotion of Tongues: Grants the ability to speak and understand any language for 1 hour.\nWeb Flask: A thrown potion that creates sticky webs in a close range, trapping creatures for 1d6 rounds.\nPotion of Flight: Grants the ability to fly for 10 minutes.\nPotion of Heroism: Grants +2 to all attack rolls and saving throws for 1 hour.\nPotion of Shielding: Grants +2 to AC for 1 hour.\nPotion of Mind Reading: Allows the drinker to read surface thoughts of creatures within near range for 10 minutes.\nPotion of Silence: Creates an area of magical silence in a 15-foot radius for 1d4 minutes.\nElixir of Disguise: Allows the drinker to alter their appearance for 1 hour.\nPotion of Water Walking: Grants the ability to walk on water for 1 hour.\nPotion of Blazing Aura: Surrounds the drinker in a fiery aura, dealing 1d6 fire damage to any creature within close range for 1d4 rounds.\n\nTier 3 and Higher Tier Potions (Very complex and powerful potions)\nIt is assumed that the ingredients for potions at these tiers would only be available in the largest of cities, if at all. And then only for tremendous cost. They would also require the right contacts to be made in order to purchase them. Foraging for the ingredients is assumed. The foraging missions would be the subject of quests and challenges."},"index":{"title":"'That' Randy's Stuff","links":["02-Terra-Mortuum/!Intro-Terra","01-Caroline-College/00-Information/!Intro-Caroline","00-Gaming-Thoughts/!How-I-Play"],"tags":[],"content":"\nIf you were looking for me, congratulations YOU WON. If you weren&#039;t looing for me I have to wonder why you are here. Are lost? Do you need a grown-up to help you get home? I&#039;ll try to help but I gave up being a grown up a long time ago. I&#039;m just an old man that likes to play games, make mediocre music and working on being a better person today than I was yesterday.\nWhat you will find here are links to my\n\nTTRPG gaming campaigns I tell stories in\n\nI am a proud member of the Forever DM club, and I like it that way\nYou will find some information about my two current worlds\n\nTerra Mortuum: A grim dark fantasy game about a future after a horrible mistake was made.\nCaroline College: Welcome to Wisconsin. The year is 1983, the metal is loud and all the things go bump in the night.\n\n\nAnd you&#039;ll find a little bit about how I play here . Not everyone is a good gaming match with everyone else and that&#039;s ok. Before I waste your time, see if we might vibe. Don&#039;t worry, I&#039;m flexible.\n\n\nMusic I Make\n\nI do not claim to be good. I make music for me and those who want to play with me. \n\n\nPhotographs I make\n\nI don&#039;t take pictures as often as I used to but I still love the craft.\n\n\n\nFinally I guess a bit about me isn&#039;t a bad thing to add.\n\nI&#039;m happily married to my high school sweetheart. Its been over 3 decades now and I&#039;m still enamored with her.\nI have three grown children. Two I helped make, a son and a daughter, one who I gained when she married my son.\nI write mathy-optimizey-codey-things for a living\n\nDon&#039;t worry, I&#039;m a trained professional and can use these types of professional terms safely.\n\n\nI&#039;m very liberal. And believe in love, peace, equality, sex positivity, education, reason and joy for all.\n\n"}}