{"Caroline-College/Intro-Caroline":{"title":"Welcome To Wisconsin","links":[],"tags":["TTRPG","Horror"],"content":"Two minutes till midnight in Wisconsin...\nThe chill of the evening clings to the air outside. You sit alone in your dorm room, staring at the clock radio resting atop your nightstand. The green digits on your wristwatch agree with the red digits on the clock; 11:58 PM – two minutes ‘til midnight. You pull your headphones off, set your Walkman on the desk, head over to your small bed and tune into the campus radio station on the cheap alarm clock. Light classical music can be heard fading out as the DJ talks about the next piece she&#039;s putting on the turntable.\n11:59 PM\nA minute later the radio crackles with static and an electrical buzz. Your small room is filled with an eerie hum that seems to vibrate through your very bones. You&#039;ve heard rumors of this happening before – a mysterious pirate radio station taking over the campus airwaves at precisely midnight. You&#039;ve tried to catch the show before but without success. Seems tonight you got lucky.\n&quot;Let there be METAL!&quot;\nThe sound of distorted guitars can be heard through the static. A disturbed metal tune, with a happy beat, begins to play.\nWhat have you found?\nAfter a few minutes the song ends and the host returns.\n&quot;Dave Is Back Babies! ‘Metal at Midnight’ is live and we’ve got all the music and news you need to survive this messed up little town. And speaking of news, we’ve got some real juicy nuggets for all you little pink faced freshmen joining our church of METAL for the first time. And believe me, its news that THEY do NOT want you to know.&quot;\nHe pauses only a moment to catch his breath.\n&quot;We’re going live tonight because I know some of you little metal headed sideshow freaks have got class in that torture chamber known as Sister Sarah’s. And believe me, they are trying super hard to keep this quiet. So Dave’s going all School House Rock tonight. Knowledge is power! And power is what they don’t want you to have.&quot;\nThe static hangs in the air as Dave goes quiet. Is that ... screams in the static? You lean in closer, your heart pounding in your chest as the static is broken by Dave&#039;s whispered voice.\n&quot;Yeah, that hospital’s all clean and bleachy fresh outside but in the back rooms … Oh brother, it’s Mike Myers meets that freaky little alien chest baby. Us vets know it. We&#039;ve heard the screams. We&#039;ve seen shadows moving all weird. We&#039;ve seen dumpsters getting collected late at night. Ain&#039;t no trashman working after midnight! Yeah, Sarah’s stinks alright so watch your back there. &quot;\nYou glance out your window, out across the campus, towards the hospital – or rather, what you can see of it through the dense trees. The lights seem too bright tonight, casting long, dancing shadows that seem to twist and writhe unnaturally. You swear you can hear the sound of a large truck operating.\n&quot;Worst yet, THEY know it’s there! And Dave’s got the cancelled checks to prove it; right where you’d expect. In that nasty, creepy museum all the norms pass every day on their way to class. Prairie Hall is just a 24/7, 365, all you can eat charnel house with a receptionist. But they do keep records there….&quot;\n&quot;Call Mr. King, I&#039;ve got a pitch for his next book!&quot;\nThe radio crackles again, and you swear you hear something else – a whispering beneath Dave&#039;s words, a dark alien presence pushing through the static. Music breaks through the small speaker again. For the next several hours metal music flows from the pirate station. Just before dawn the music stops and Dave cuts in again. You were dozing but the odd interference and the mad host&#039;s words stir you awake.\n&quot;Damn, they found me so it’s time to wrap. But before I bounce remember…&quot;\n&quot;We’ll fight on the land,&quot;\n&quot;We’ll fight in the fields and in the streets,&quot;\n&quot;We’ll fight in the hills,&quot;\n&quot;We’ll never surrender.&quot;\n&quot;Man, someone call in the metal MILITIA!&quot;\nThe radio begins blaring the last song of the show. The pirate station has cranked up the volume to an almost unbearable level as heavy power chords and frantic riffs cut through the airwaves. You jump back, heart racing. As the song plays you can hear the sound of equipment being thrown into boxes. Over the din, you think you can hear Dave singing along. After a few moments, the radio station fades back into quiet static, leaving you alone with your thoughts – and the chilling echoes of Dave&#039;s words. You barely notice when the campus radio comes back on the air. Looking back out the window you can see the start of the morning&#039;s false dawn.\nThe night DJ has been replaced by the morning show. Soft Americana music soothes the ringing in your ears as you listen to a sorrowful woman sing over an old guitar.\nIn shadows deep where whispers stir\nA pact is forged\nsilence unheard\nMy heart I give to the darkened sky\nTo save the fields\nto let hope fly\nOh hear my call\noh ancient dread\n\nWelcome to Wisconsin.\nWelcome to a world where truth hides behind conspiracy theories and history. A world where darkness lurks in the unlikeliest of places. A world where friend and foe are difficult to distinguish from one another.\nClass is in session and a new semester begins tonight. Are you ready to confront the truths hidden within the hallowed halls of Caroline College?"},"Caroline-College/Optional-Rules---Distress-Points-(DSP)":{"title":"Optional Rules - Distress Points (DSP)","links":["tags/","Caroline-College/Player-Guide"],"tags":["TTRPG","Horror",""],"content":"Optional Expanded Sanity Rules for Call of Cthulhu\nNote: These rules are optional and will be discussed during Session Zero. They are designed to enhance the horror experience in long-term campaigns without incapacitating characters through excessive Sanity loss.\nThese rules were heavily inspired by the work Apostol Apostolov at  Chaosium Call of Cthulhu 7th Edition House Rules\nFor details on making characters see Player Guide\nIntroduction\nThe Expanded Sanity Rules introduce a new mechanic called Distress Points (DSP) to add psychological depth and realism to our game. Like standard Sanity Points (SAN), which decrease as characters encounter supernatural horrors, Distress Points start at a maximum value and decrease as characters face stress from realistic, non-supernatural threats. This allows characters to handle man-made horrors and stressful situations without immediate risk of madness.\nDistress Points (DSP)\nWhat Are Distress Points?\n\nDistress Points represent your character&#039;s mental resilience to stress from non-supernatural situations, such as tough decisions, resource scarcity, or dangerous environments.\nEvery character starts with DSP equal to their POW (similar to how SAN is calculated).\n\nLosing Distress Points\n\nNon-Supernatural Encounters: Non-supernatural horrors cause DSP loss instead of SAN loss. This would replace the traditional sanity roll for these mundane encounters.\nStressful Situations: When facing non-horrific, but still stress situations, DSP checks may need to be made.\nSAN Rolls: Making a sanity roll, by definition, is caused by a situation that is stressful. You lose a a DSP every time a sanity roll is made; pass or fail.\nVoluntary SAN Damage: You can always choose to take SAN damage instead of losing DSP, but not the reverse.\n\nEffects of Distress Points\n\nAbove Half DSP (more than half of your maximum DSP): You remain composed; your hidden traits are under control.\nEqual to or Below Half DSP (half or less of your maximum DSP):\n\nBegin to show minor signs of stress linked to your Dark Trait.\nEach time you lose 5 or more DSP at once, roll against your current DSP. If you roll equal to or less than your DSP, you experience a Breakdown for 1d4 rounds.\n\n\nEqual to or Below One-Fifth DSP (one-fifth or less of your maximum DSP):\n\nYour behavior is noticeably affected by your Dark Trait.\nBreakdowns last longer (1d10 rounds), and the Keeper may suggest actions for your character.\n\n\nAt Zero DSP:\n\nYou suffer a Complete Breakdown.\nThe Keeper may take control of your character until DSP is recovered.\n\n\n\nMaximum DSP\n\nDSP cannot exceed your starting value (POW). Rest and recovery can help you regain lost DSP up to this maximum.\n\nExample of a Breakdown\nScenario:\nMaria, an investigator with a starting POW of 60, starts with DSP = 60. Her Dark Trait is Paranoia, which she keeps hidden from the rest of the team.\nEvents Leading to the Breakdown:\n\nInitial Stress:\n\nMaria and her team are exploring an abandoned asylum.\nShe encounters realistic but disturbing graffiti and unsettling noises.\nOver time, she loses 20 DSP, reducing her DSP to 40.\n\n\nDSP at Half Maximum:\n\nSince her DSP is now at 40 (which is two-thirds of 60), she remains composed.\n\n\nFurther Stress:\n\nThe team finds a room with detailed accounts of past tortures (non-supernatural).\nMaria loses 15 DSP due to the distressing content, bringing her DSP down to 25.\n\n\nDSP Falls to Half or Less:\n\nWith DSP at 25 (less than half of 60), she begins to show minor signs of her Dark Trait (Paranoia).\nShe starts questioning the intentions of her teammates subtly.\n\n\nTriggering a Breakdown:\n\nSuddenly, a realistic but horrific trap is sprung, causing Maria to lose 10 DSP at once, dropping her DSP to 15.\nBecause she lost 5 or more DSP at once and her DSP is below half, she must roll against her current DSP (15).\n\nShe rolls a 22, which is above her DSP.\nBreakdown Triggered: The Breakdown will last 1d4 rounds (let&#039;s say she rolls a 3).\n\n\n\n\n\nDuring the Breakdown:\n\nBehavior:\n\nFor the next 3 rounds, Maria&#039;s paranoia takes over.\nShe becomes convinced that one of her teammates is sabotaging the mission.\nShe might accuse them openly, refuse to share information, or even act defensively if approached.\n\n\nKeeper&#039;s Role:\n\nThe Keeper reminds Maria&#039;s player of her Dark Trait and suggests actions that reflect her heightened paranoia.\nThe player can choose how to role-play these suggestions within the confines of the Breakdown.\n\n\n\nAfter the Breakdown:\n\nMaria&#039;s DSP remains at 15.\nShe regains some composure but still shows signs of stress.\nThe team may notice her odd behavior, and she might need to find ways to recover DSP.\n\nDark Traits\nWhat Are Dark Traits?\n\nDark Traits are hidden aspects of your character&#039;s personality that emerge under stress.\nThey add depth to your character and provide role-playing opportunities.\n\nSelecting a Dark Trait\n\nChoose a Dark Trait during character creation. It should remain secret from other players but not the keeper.\nExamples include traits like paranoia, obsession, aggression, or compulsiveness.\nYour Dark Trait influences how your character behaves as DSP decreases.\n\nRevealing Dark Traits\n\nAs DSP decreases, subtle behaviors linked to your Dark Trait begin to surface.\nUnder severe stress or during Breakdowns, these traits may dominate your actions.\n\nManaging Distress\n\nRest and Relaxation:\n\nShort Rest: Resting for at least an hour in a safe, comfortable environment restores 1d10 DSP. This cannot be repeated until at least one point of DSP has been lost.\nExtended Rest: A full day of rest restores 10 DSP (may be repeated as needed).\n\n\nComposure Attempts:\n\nPOW Roll: Attempt a POW roll to compose yourself. If your current DSP is at or below half maximum, the roll is of Hard difficulty.\nSuccess: Restores 1d4 DSP during danger or 1d6+1 DSP when safe.\n\n\nAssistance from Allies:\n\nAnother character can use a Psychology roll to help you recover.\nSuccess has the same effects as a successful POW roll. These cannot be used in conjugation. But if one fails, the other may be attempted.\n\n\nIndulging in Manias:\n\nEngaging in a personal mania restores 1d6+1 DSP.\nRequires a Sanity roll; failure results in 1 SAN loss.\n\n\n\nPacing Stress Loss\n\nTo keep gameplay smooth, DSP losses can be accumulated over a scene and applied at the end.\nThis minimizes interruptions and maintains narrative flow.\nImmediate DSP losses may still occur during sudden shocks or critical moments.\n\nIncreased Impact of Phobias\n\nIf your character has a Phobia, encountering its trigger doubles any DSP losses.\n\nPurpose of These Rules\n\nEnhanced Role-Playing: Allows for deeper character development as hidden traits surface under stress.\nBalanced Horror Experience: Maintains the horror atmosphere without quickly incapacitating characters through massive Sanity loss.\nLong-Term Campaign Suitability: Ideal for extended play, where character arcs and psychological journeys are explored over time.\n\nConclusion\nPlease consider how these rules might enhance your gaming experience. They aim to add psychological realism and depth to our campaign, offering new challenges and role-playing opportunities without overwhelming your character with Sanity loss. We&#039;ll discuss these rules in detail during Session Zero to ensure everyone is comfortable and understands how they will be integrated into our game.\n\nList of 50 Example Dark Traits\nThe following are example dark traits; others are possible. Please discuss your choice with the keeper before finalizing your selection.\nDark Traits Table\n| Trait              | Description                                                            | Under Distress Effect                                                                      | Breakdown Result                                                                                |\n| ---------------------- | -------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------- |\n| AGGRESSIVE         | Physical action and violence are your solutions to every problem.          | You display bouts of verbal aggression and may intimidate allies who challenge your decisions. | You are unlikely to restrain yourself from combat until any perceived enemy is neutralized.         |\n| MARTYR             | You feel overwhelmed by responsibility for others.                         | You become less concerned with your own well-being and focus entirely on your allies&#039; needs.   | You&#039;re willing to sacrifice yourself for a greater goal or the survival of others.                  |\n| COWARD             | Fear dominates your actions.                                               | You become pessimistic and sarcastic, openly expecting the worst outcomes.                     | You panic and flee, even if it means abandoning your friends in danger.                             |\n| EGOTIST            | Your primary concern is your own well-being and survival.                  | Your decisions prioritize your needs over others.                                              | You place your safety above everything, even denying help or betraying allies.                      |\n| SADISTIC           | You derive pleasure from others&#039; discomfort.                               | You may enjoy causing harm or misfortune to feel better.                                       | You pursue actions that cause maximum harm to enemies, even if it jeopardizes plans or allies.      |\n| PARANOID           | You believe others are constantly scheming against you.                    | You see coincidences as evidence of conspiracies.                                              | You&#039;re convinced immediate events are part of a grand plot and take drastic action to counter it.   |\n| PSYCHOPATHIC       | You disconnect from others&#039; emotions and needs.                            | You focus solely on your goals, unable to communicate intentions or feelings.                  | You lose the ability to cooperate, resolving problems only on your own.                             |\n| ANNOYING           | You have habits that irritate others, like excessive talking or fidgeting. | These habits intensify, helping you cope with uncertainty.                                     | You struggle to concentrate, taking extra time and lacking focus.                                   |\n| DEPENDENT          | You seem independent but rely on others when stressed.                     | You cling to others for guidance and protection.                                               | You&#039;re incapable of making decisions without someone telling you what to do.                        |\n| MEGALOMANIAC       | You have an insatiable need for power and control.                         | Feeling weak causes you anxiety and frustration.                                               | You&#039;ll stop at nothing to gain power, even embracing dangerous paths.                               |\n| CURIOUS            | Your thirst for knowledge overrides caution.                               | You can&#039;t resist uncovering secrets, even risky ones.                                          | You&#039;re compelled to experiment with newfound knowledge, often recklessly.                           |\n| FIXATED            | You focus on repetitive activities to escape stress.                       | You feel compelled to continue these activities.                                               | You fixate on one activity as a source of comfort, resisting attempts to stop.                      |\n| LOUD               | You express emotions vocally.                                              | You can&#039;t keep your voice down and openly share your thoughts.                                 | You make a scene, yelling or ranting, potentially wasting valuable time.                            |\n| ZEALOUS            | A strong belief or moral code anchors you.                                 | You obsess over this belief and become anxious if it&#039;s challenged.                             | You feel your belief is under attack and will defend it fiercely.                                   |\n| CATATONIC          | You withdraw inward to cope.                                               | You find it hard to speak and may shut down.                                                   | You halt actions, adopt a neutral posture, and become nearly mute, passively resisting interaction. |\n| BURDENED           | You carry deeper troubles than most.                                       | Your underlying issues surface, affecting your behavior.                                       | Combine behaviors from two traits, intensifying your reactions.                                     |\n| COMPULSIVE LIAR    | You habitually lie, even without cause.                                    | Your lies become elaborate and hard to maintain.                                               | You create a false reality and insist others accept it.                                             |\n| MANIPULATIVE       | You influence others for personal gain.                                    | You resort to deceit and exploitation.                                                         | You may manipulate allies into dangerous situations for your benefit.                               |\n| OBSESSIVE          | You fixate on thoughts or ideas.                                           | Obsessions dominate your actions.                                                              | You can&#039;t focus on anything else until satisfying your obsession.                                   |\n| PESSIMISTIC        | You expect the worst outcomes.                                             | Your negativity affects group morale.                                                          | You&#039;re immobilized by hopelessness.                                                                 |\n| RECKLESS           | You take unnecessary risks.                                                | You disregard safety measures.                                                                 | You engage in dangerous actions without considering consequences.                                   |\n| JEALOUS            | You envy others&#039; successes or possessions.                                 | You undermine or sabotage others.                                                              | You attempt to take what others have by any means.                                                  |\n| DECEITFUL          | Honesty isn&#039;t your policy.                                                 | You lie to protect yourself or gain an advantage.                                              | You can&#039;t tell the truth, even when necessary.                                                      |\n| ARROGANT           | You believe you&#039;re superior.                                               | You belittle others and ignore advice.                                                         | Overconfidence leads you to make poor decisions.                                                    |\n| CONTROLLING        | You need to be in charge.                                                  | You become domineering.                                                                        | You attempt to control every aspect, causing conflict.                                              |\n| STUBBORN           | You refuse to change your mind.                                            | You reject others&#039; ideas.                                                                      | You insist on your way, regardless of consequences.                                                 |\n| IMPULSIVE          | You act without thinking.                                                  | You make hasty decisions.                                                                      | You take immediate action without consideration.                                                    |\n| ENVIOUS            | You desire what others have.                                               | You fixate on others&#039; possessions or status.                                                   | You might steal or sabotage to level the field.                                                     |\n| APATHETIC          | You lack interest or concern.                                              | You disengage from situations.                                                                 | You become unresponsive to events around you.                                                       |\n| NARCISSISTIC       | You have an inflated sense of self-importance.                             | You demand special treatment.                                                                  | You believe only you can solve problems, dismissing others.                                         |\n| MASOCHISTIC        | You find satisfaction in your own discomfort.                              | You may self-sabotage or take unnecessary risks.                                               | You engage in self-destructive behaviors.                                                           |\n| UNTRUSTING         | You doubt others&#039; intentions.                                              | You suspect betrayal from those around you.                                                    | You isolate yourself, refusing help.                                                                |\n| GLUTTONOUS         | You overindulge in pleasures.                                              | You seek immediate gratification, neglecting duties.                                           | You binge excessively, ignoring consequences.                                                       |\n| IRRATIONAL         | You abandon logic and reason.                                              | You make illogical decisions.                                                                  | You cannot be reasoned with, acting unpredictably.                                                  |\n| VINDICTIVE         | You hold grudges and seek revenge.                                         | You dwell on past slights.                                                                     | You focus solely on settling scores, regardless of cost.                                            |\n| FRACTIOUS          | You&#039;re irritable and prone to conflict.                                    | You pick fights over minor issues.                                                             | You become uncooperative and disruptive.                                                            |\n| OBSTINATE          | You&#039;re unyielding and inflexible.                                          | You resist any change or compromise.                                                           | You become a barrier to progress and group harmony.                                                 |\n| SUPERSTITIOUS      | You believe in omens and rituals.                                          | You rely on superstitions to make decisions.                                                   | You refuse to act without a &#039;sign&#039; or ritual.                                                       |\n| WORKAHOLIC         | You&#039;re addicted to work.                                                   | You immerse yourself in tasks to avoid issues.                                                 | You neglect health and relationships, focusing only on work.                                        |\n| HYPOCHONDRIAC      | You fear illness excessively.                                              | You misinterpret symptoms as serious ailments.                                                 | You believe you&#039;re critically ill, hindering your actions.                                          |\n| RESENTFUL          | You hold onto past wrongs.                                                 | You bring up old grievances.                                                                   | You act out against perceived offenders, even if unwarranted.                                       |\n| INDECISIVE         | You struggle to make choices.                                              | You&#039;re paralyzed by options.                                                                   | You&#039;re incapable of deciding without external intervention.                                         |\n| GUILT-RIDDEN       | You&#039;re burdened by remorse.                                                | You fixate on past mistakes.                                                                   | You may confess to wrongs, real or imagined, distracting from current issues.                       |\n| SCHADENFREUDE      | You take pleasure in others&#039; misfortunes.                                  | You may cause or amplify others&#039; failures.                                                     | You actively create situations where others will fail.                                              |\n| COMPULSIVE CLEANER | You need cleanliness and order.                                            | You focus on tidiness over urgent matters.                                                     | You stop everything to clean compulsively, ignoring pressing issues.                                |\n| ESCAPIST           | You avoid reality through distractions.                                    | You retreat into fantasy or indulgent activities.                                              | You detach completely from reality, becoming unresponsive.                                          |\n| CONTROL FREAK      | You micromanage every detail.                                              | You can&#039;t delegate tasks, overwhelming yourself.                                               | You try to handle everything alone, leading to burnout.                                             |\n| PROCRASTINATOR     | You delay tasks habitually.                                                | You avoid responsibilities, causing delays.                                                    | You refuse to act, even when action is critical.                                                    |\n| PERFECTIONIST      | Nothing meets your standards.                                              | You obsess over minor flaws.                                                                   | You&#039;re immobilized by the impossibility of perfection.                                              |\n| EMOTIONLESS        | You suppress your feelings.                                                | You become detached and indifferent.                                                           | You can&#039;t empathize, making cold, calculated decisions without regard for others.                   |"},"Caroline-College/Player-Guide":{"title":"Player Guide - Caroline College","links":["Caroline-College/Optional-Rules---Distress-Points-(DSP)"],"tags":["TTRPG","Horror"],"content":"House Rules for Caroline College - An Early 1980&#039;s Call of Cthulhu Campaign Setting\nThese house rules are designed to enhance your gaming experience by:\n\nIncreasing character survivability regarding sanity loss.\nProviding more development options for characters.\nKeeping starting character abilities aligned with their status as beginning college students.\nAdding more depth to characters through enriched backstories and mechanics.\n\n\nDisclaimer\nThis is a game of horror. Some themes may be disturbing to some players. Players are required to engage with the Session Zero to ensure that the game is appropriate for themselves, all players, and the keeper at the table.\n\nCharacter Creation\nDetermining Character Stats\nCap on Starting Skill Values\n\nNo starting skill can be above 60% after modifications.\n\nRolling and Distributing Characteristics\nFor Caroline College, we use a variant of Option 3: Choosing Where to Place Rolled Characteristics.\n\nRoll 6 × 3d6 and distribute the results across:\n\nStrength (STR)\nConstitution (CON)\nDexterity (DEX)\nAppearance (APP)\nPower (POW)\nLuck (LUCK)\n\n\nRoll 3 × (2d6+6) and distribute the results across:\n\nSize (SIZ)\nIntelligence (INT)\nEducation (EDU)\nNote on Skill Caps: To reflect the inexperience of college freshmen, the cap on starting skills is set at 60%. This ensures characters have room for noticeable growth throughout the campaign.\n\n\n\nOccupation: College Student\nAll characters at Caroline College use the occupation College Student.\n\nOccupation Skill Points: EDU × 3 (Reduced from the standard to reflect starting students but with more opportunities for advancement during the campaign).\nCredit Rating: 5–10\nSuggested Contacts: Other students.\nSkills:\n\nLanguage (Own or Other)\nLibrary Use\nListen\nThree Fields of Study (choose three academic skills relevant to your character&#039;s studies)\nAny Two Other Skills as personal or era specialties\n\n\n\nBackstory Elements\nDeveloping a rich backstory adds depth to your character and enhances the gaming experience. Each character should create entries for the following areas, aiming for meaningful and engaging content. This is a horror game, so dark elements within a backstory is acceptable, thematically appropriate, and strongly encouraged (within the limits defined by Session Zero). Try to remember that your characters don&#039;t know what&#039;s happening in the setting yet; hints and suggestions go a long way!\nIdeology/Beliefs\n\nBad Example: &quot;I believe in justice.&quot;\n\nWhy it&#039;s bad: Too vague and generic; lacks depth.\n\n\nAcceptable Example: &quot;I believe that the legal system is flawed, and true justice can only be achieved outside of it.&quot;\n\nWhy it&#039;s acceptable: Adds complexity and hints at potential conflicts.\n\n\nGood Example: &quot;Ethan prowls the city&#039;s backstreets at night, where justice rarely reaches. When the courts failed him and the guilty walked free, he wasn&#039;t above bending the rules to set things right. To him, the law is just a guideline, and true justice sometimes requires a darker path that others might deem questionable.&quot;\n\nWhy it&#039;s good: Provides depth, aligns with game themes, and introduces moral ambiguity.\n\n\n\nSignificant People\n\nBad Example: &quot;My mother.&quot;\n\nWhy it&#039;s bad: Too general; doesn&#039;t explain significance.\n\n\nAcceptable Example: &quot;My mother, who supported my academic pursuits.&quot;\n\nWhy it&#039;s acceptable: Offers context but lacks depth.\n\n\nGood Example: &quot;Amelia carries a tattered letter from her estranged mother, filled with unsent words of apology. She reads it under dim lamplight, wondering about the life her mother chose over her family. Each word fuels Amelia&#039;s resolve to find her, not just to reconnect, but to understand the choices that led them apart.&quot;\n\nWhy it&#039;s good: Adds personal stakes, urgency, and ties to potential plot lines.\n\n\n\nMeaningful Locations\n\nBad Example: &quot;The park.&quot;\n\nWhy it&#039;s bad: Too vague; lacks meaningful context.\n\n\nAcceptable Example: &quot;The old park near my childhood home where I used to play.&quot;\n\nWhy it&#039;s acceptable: Provides some context but lacks depth.\n\n\nGood Example: &quot;The rusted remains of the old Ferris wheel loom over the deserted fairground, a place where Lucas once shared a fleeting moment of joy with his first love before she moved away without a word. He returns there, the silence heavy with memories and unanswered questions, hoping one day to recapture that lost connection or at least find closure.&quot;\n\nWhy it&#039;s good: Rich atmosphere, ties into supernatural elements, and profoundly impacts the character.\n\n\n\nTreasured Possessions\n\nBad Example: &quot;A book.&quot;\n\nWhy it&#039;s bad: Generic; doesn&#039;t reveal anything about the character.\n\n\nAcceptable Example: &quot;An old diary from my grandmother.&quot;\n\nWhy it&#039;s acceptable: Provides a familial connection but could be more detailed.\n\n\nGood Example: &quot;Lily discovered an old, leather-bound book hidden behind a loose brick in her grandmother&#039;s fireplace. The pages are filled with faded handwriting and strange symbols she doesn&#039;t understand. As she reads, unsettling family secrets begin to surface—stories of forgotten ancestors and choices that cast long shadows over her family&#039;s history, secrets they had tried desperately to keep buried. At least she knows she isn&#039;t alone in her bad choices.&quot;\n\nWhy it&#039;s good: Deeply personal, tied to game lore, and serves as a catalyst for adventures.\n\n\n\n\nBalancing Classes and Investigations\nClass Selection\nPlayers must balance academic responsibilities with their mystery-solving adventures.\n\nEach Semester, players must choose 5 classes.\n\nFreshman Fall Semester:\n\n3 Required Classes:\n\nOne Science\nOne History\nOne Language\n\n\n2 Optional Classes:\n\nChosen from the list of electives.\n\n\n\nPassing a Class\nTo pass a class, players must:\n\nPass the Final Exam:\n- Involves making an advancement roll in the relevant topic.\n\nLuck may be used on this roll.\n\n\nOptionally, Meet the Attendance Requirement:\n- Attend at least 70% of the class sessions (determined narratively).\n\nMeeting attendance grants a +5% bonus to the relevant skill (in addition to advancements from exams).\n\n\n\nExams\n\nMid-Term and Final Exams will be held each semester.\nPassing the Mid-Term:\n\nGrants a Penalty Die on the final exam advancement roll.\nNote: In advancement rolls, a failed roll results in skill improvement. Therefore, the Penalty Die increases your chance to fail the roll, which benefits your skill advancement.\n\n\nFailing a Class:\n\nIf you fail the final exam but met the attendance requirement, you still gain the +5% bonus.\n\n\n\nTension Mechanic\nPlayers must choose between attending classes or pursuing adventures, balancing academic success with their investigations.\n\nSkipping Classes may lead to:\n\nFalling grades.\nLoss of skill advancement opportunities.\nPotential narrative consequences.\n\n\nBenefits of Academic Success:\n\nAt the keeper&#039;s discretion, and at thematically appropriate times, academic achievements may grant benefits.\nExample: Passing all exams in a semester might unlock access to exclusive resources, faculty support, or special permissions.\n\n\n\n\nMechanics Adjustments\nSanity Loss Adjustments\n\nReading Mythos Tomes:\n\nCosts sanity but will not trigger bouts of madness or insanity if done in a safe environment.\n\n\n\nRecovery from Indefinite Insanity\nStudents at Caroline College have access to counseling sessions provided by the local Lutheran church. These sessions are non-religious and aim to aid students in recovering from indefinite insanity and trauma.\n\nWeekly Counseling Sessions:\n\nAvailability: Once per week when not participating in a game session.\nSanity Recovery Mechanics:\n\nRecovery Attempt:\n\nRoll percentile dice (1d100).\nOn a result of 01–95:\n\nSuccess: Recover 1d10 Sanity Points.\n\n\nOn a result of 96–100:\n\nSetback:\n\nLose 1d6 Sanity Points.\nGain a new phobia related to the stress or topics discussed during counseling.\n\n\n\n\n\n\nResolving Indefinite Insanity:\n\nIf Sanity Points are gained during a counseling session, you may immediately make a Sanity check (using your updated Sanity score).\nOn a Hard Success, your indefinite insanity is resolved.\n\n\n\n\nTime Commitment:\n\nAttending a counseling session requires an in-game time slot, potentially conflicting with classes or investigations.\n\n\nKeeper&#039;s Note:\n\nFrequent therapy sessions may draw attention or have narrative implications, adding to the tension of balancing time.\nFailed Therapy Sessions:\n\nMay induce phobias related to the therapy content, providing additional story hooks.\n\n\n\n\n\n\n\nLuck Recovery and Advancement\nLuck advancements are made at the start of every game session.\n\nLuck Recovery Mechanics:\n\nImprovement Check:\n\nRoll 1d100.\nIf the roll is above your current Luck, add 1d10 points.\nIf the roll is equal to or less than your current Luck, no points are recovered.\n\n\n\n\nNote:\n\nLuck may not exceed 99.\nThe starting Luck value is not used again in the game.\n\n\n\nSkill Advancements\nSkill advancements are made after thematically appropriate breaks, as determined by the keeper (expect 3–5 per semester, including exams).\nPvP Interactions and Loss of Control\n\nPlayer vs. Player (PvP) &#039;Attacks&#039;:\n\nMust be made with consent of all involved players.\n\n\nLoss of Control Situations:\n\nOccur when a character is under the effects of insanity, a Breakdown due to Distress, or certain supernatural influences.\nActions are at the keeper&#039;s discretion.\nThe keeper should consider player enjoyment and strive for consensual storytelling.\n\n\n\nBackstory Connections\n\nRobust and Thematically Appropriate Backstories:\n\nInclude one or more entries with a dark element.\nDevelop meaningful locations, significant people, and pivotal events that add depth.\n\n\nCharacter Connections:\n\nEvery character must have a connection to at least two other characters in the party in their backstory.\nNo character can have more than two connections to them.\n\n\n\nGroup Skill Checks\n\nAssisting with Skill Rolls:\n\nIf more than one character attempts a skill roll for the same task, under pressure:\n\nIf at least two characters have skill above baseline, one person can make the roll with a Bonus Die.\n\n\n\n\n\nSpending Luck\n\nLuck Points can be spent to alter the result of a skill or characteristic roll on a 1-for-1 basis.\nRestrictions:\n\nCannot spend Luck on:\n\nLuck rolls\nDamage rolls\nSanity rolls\nRolls to determine the amount of Sanity points lost\n\n\nCannot spend Luck on Pushed Rolls.\nCriticals, Fumbles, and Firearm Malfunctions cannot be altered with Luck.\nNo skill improvement check is earned if Luck was used to alter the roll.\n\n\n\n\nExpanded Sanity Rules\nThese OPTIONAL rules add psychological realism to the Sanity mechanics, fitting for modern or historical settings where characters may be hardy and accustomed to man-made horrors. Their inclusion will be discussed during Session Zero.\nSee Optional Rules - Distress Points (DSP)\n\nSession Zero Guidelines\nStarting Campaigns\nWe begin new campaigns with a Session Zero to:\n\nAlign expectations.\nDiscuss boundaries.\nEstablish the tone.\nIntegrate characters into the world.\n\nBackstories\n\nCharacters Should Not Start as Heroes:\n\nFocus on backstories that plant seeds for future adventures.\nAvoid having characters who have already achieved greatness.\n\n\n\nFitting the Tone\n\nEnsure your character fits the theme of the campaign (early 1980&#039;s horror sit in small town America).\n\nParty Dynamics\n\nCreate Characters That Fit the Party:\n\nDevelop strong connections with at least two other characters.\nCollaborate during character creation to ensure cohesion.\nCome to session zero with ideas, not characters.\n\n\n\nRespecting the Mood\n\nMaintain Immersion:\n\nAvoid breaking tension with out-of-place jokes, side talk, etc..\nEngage with the core themes agreed upon.\n\n\n\nRule of Cool\n\nStory Over Rules: We&#039;ll follow the Rule of Cool to prioritize narrative over strict rule adherence.\n\nImprovisation and Player Agency\n\nYour Actions Shape the Story:\n\nMajor events occur based on your decisions.\nCreativity is rewarded, even if payoffs aren&#039;t immediate.\nNot every encounter is balanced; sometimes avoiding conflict is wise.\n\n\n\nPlayer Preparation\n\nStay Engaged:\n\nBe attentive during sessions.\nReview notes between sessions.\nKeep your character curious and involved.\n\n\nSession Recaps:\n\nBefore each session, a player provides a recap of the previous session (group&#039;s choosing).\nIncentive:\n\nThe player who provides the recap gains a one-time Bonus Die for the session (unused bonus dice do not roll over).\n\n\n\n\n\nSafety Tools\n\nPlayer Comfort Is a Priority:\n\nSession Zero: Establish comfort levels and boundaries.\nLines &amp; Veils:\n\nLines: Hard limits not to be crossed.\nVeils: Topics that can occur but not be spotlighted.\n\n\nX Card:\n\nTap the X card to immediately stop and change uncomfortable content.\n\n\nConsent Flowers:\n\nGreen: Keep going.\nYellow: Proceed with caution.\nRed: Change the subject.\n\n\n\n\nExamples:\n\nA player indicating a yellow consent flower might prompt the keeper to adjust the scene&#039;s intensity without disrupting gameplay.\n\n\n\nThemes and Boundaries\n\nDiscuss Sensitive Topics:\n\nBe proactive in expressing preferences.\nCommon topics include violence, discrimination, sexuality, and personal phobias.\n\n\n\nConflict Resolution\n\nIn-Character Conflict:\n\nShould serve the narrative.\nAvoid actions that disrupt group dynamics.\n\n\nOut-of-Character Conflict:\n\nAddress issues respectfully among yourselves.\nThe keeper is a storyteller, not a mediator.\n\n\n\nRole-Playing\n\nImmerse Yourself:\n\nAct and speak as your character.\nAvoid phrases like &quot;My character does X.&quot;\n\n\n\nPlayer Respect\n\nTreat Each Other with Respect:\n\nRespect beliefs and views without imposing them.\nCreate a welcoming environment.\nAddress discomfort promptly and respectfully.\n\n\n\n\nCommon Topics to Discuss\nDuring Session Zero, we&#039;ll address the following possible story elements to ensure everyone&#039;s comfort:\n\nFrequently Lined Topics:\n\nSexualized violence\nChild abuse\nAnimal cruelty\n\n\nFrequently Veiled Topics:\n\nRacism\nDiscrimination against minorities\nSexuality\nTorture\nPhobias (spiders, snakes, clowns, dentists)\nSerious illnesses\nSexism\nSuicide\n\n\n\n\nBy adhering to these house rules and guidelines, we aim to create an engaging, immersive, and enjoyable gaming experience for everyone involved. Let&#039;s work together to weave a memorable story set in the mysterious world of Caroline College.\n\nClubs and Societies\nBelow are 20 clubs and societies with you might engage with in and around the college. Each includes associated Call of Cthulhu skills.\n\nGreat Lakes Archaeological Society\n\nSkills: Archaeology, History\nStory Hooks: Discovering Native American artifacts linked to ancient rituals; uncovering local historical sites.\n\n\nCaroline College Debate Club\n\nSkills: Persuade, Fast Talk\nStory Hooks: Debating controversial topics that stir up hidden tensions; uncovering faculty secrets.\n\n\nPeach Street Library Occult Studies Group\n\nSkills: Occult, Library Use\nStory Hooks: Access to obscure local folklore; accidental involvement with real supernatural forces.\n\n\nFolklore and Mythology Circle\n\nSkills: Anthropology, History\nStory Hooks: Exploring regional legends; finding connections between myths and current strange occurrences.\n\n\nCaroline Science Association\n\nSkills: Science (choose one), Mechanical Repair\nStory Hooks: Experiments affected by mysterious phenomena; encountering anomalies in nature.\n\n\nLiterary Appreciation Society\n\nSkills: Language (Own or Other), Art/Craft (Literature)\nStory Hooks: Uncovering hidden messages in classic literature; meeting reclusive authors with dark secrets.\n\n\nPsychology and Wellness Club\n\nSkills: Psychology, Psychoanalysis\nStory Hooks: Exploring the minds of troubled students; encountering mind-altering experiences.\n\n\nOutdoor Adventure Club\n\nSkills: Navigate, Survival\nStory Hooks: Organizing trips into the nearby forests; discovering hidden places and strange happenings.\n\n\nThespian Troupe of Caroline\n\nSkills: Acting, Disguise\nStory Hooks: Performing plays that have unexpected effects; blurring lines between roles and reality.\n\n\nAstronomy Enthusiasts of Caroline\n\nSkills: Astronomy, Spot Hidden\nStory Hooks: Observing unexplained celestial events; contact with cosmic entities.\n\n\nStrategy Games Club\n\nSkills: Strategy Game (Chess), Spot Hidden\nStory Hooks: Strategic contests with unusual stakes; deciphering patterns that hint at larger schemes.\n\n\nCaroline Art Collective\n\nSkills: Art/Craft (Painting, Sculpture)\nStory Hooks: Art that seems to come alive; students disappearing after creating certain pieces.\n\n\nMusic Appreciation Group\n\nSkills: Art/Craft (Music), Listen\nStory Hooks: Composing or playing music that has strange effects; instruments with mysterious origins.\n\n\nWatashuka Historical Preservation Society\n\nSkills: History, Library Use\nStory Hooks: Efforts to preserve local history uncover hidden truths; dealing with those who want the past forgotten.\n\n\nLakeview Cryptid Hunters\n\nSkills: Natural World, Track\nStory Hooks: Searching for legendary creatures said to inhabit local areas; encounters with the unknown.\n\n\nPhilosophical Inquiry Club\n\nSkills: Philosophy, Occult\nStory Hooks: Discussions that lead to unsettling realizations; questioning reality itself.\n\n\nLanguage and Culture Exchange\n\nSkills: Language (Other), Anthropology\nStory Hooks: Connecting with international students; discovering ancient languages with hidden power.\n\n\nSelf-Defense and Martial Arts Club\n\nSkills: Fighting (Brawl), Dodge\nStory Hooks: Learning techniques with unexpected origins; defending against unseen threats.\n\n\nPhotography and Journalism Society\n\nSkills: Photography, Spot Hidden\nStory Hooks: Capturing images that reveal more than meets the eye; investigating stories that others avoid.\n\n\nOur Earth Group\n\nSkills: Biology, Survival\nStory Hooks: Protecting local environments leads to strange discoveries; nature behaving unpredictably.\nKeeper&#039;s Note: Involvement in clubs can provide:\n\n\n\n\nSkill Bonuses: Gain a +5% bonus to associated skills while active in the club.\nStory Opportunities: Clubs can introduce unique quests, NPCs, and resources.\nPotential Risks: Groups can grant mechanical benefits as well as possible contacts. But some clubs may be fronts for groups your character may not wish to draw attention from.\n\n\nBy incorporating these elements, we aim to enrich the gameplay experience, providing ample opportunities for character development, fun, and immersive storytelling."},"Gaming-Thoughts/How-I-Play":{"title":"Welcome To My Table - A Guide For Players Looking To Play At A Table With Me","links":[],"tags":[],"content":"Welcome to my table: A Guide For New Players Looking To Play At A Table With Me\nWhat is this\nThis document is living and will be adjusted as my views grow and change. I have gamed for many decades and the only constant I have seen is change.\nThe following are my ideas and are focused mainly on players who have never played with me before. Your ideas about games and how they should be played may differ and that&#039;s great! The hope with this document is to see if we are compatible with each in terms of gaming. I believe strongly in the idea that not every table is right for every person.\nIntroduction\nRole-playing games are for everyone, but not every game table is the right fit for every player. My goal is to create collaborative stories, where everyone helps drive the narrative. We all work together to build a fun and memorable experience. Below is a guide to help you understand the expectations and style of games I run.\nSession Zero\nWe will always begin new campaigns with a Session Zero to align expectations, discuss boundaries, and establish the tone. There are two types of session zeros:\n\n\nEstablished World: If we are playing in a defined setting, I will provide information about the world and its tone ahead of time. During Session Zero, we’ll discuss how your character fits into this world and make sure everyone is aligned on tone and boundaries. There is still a lot of flexibility available to us to tweak existing worlds to taste.\n\n\nNew Campaign Setting: If we’re starting a new campaign world, we’ll collaboratively build the world together. This is your chance to influence the setting, tone, and major elements. Be ready to share your ideas and preferences, so we can create a world that fits your expectations.\n\n\nCharacter Creation\nCharacter creation is a crucial part of any game, and we’ll handle this during Session Zero. Here’s what to keep in mind:\n\nBackstories: Characters should not start as heroes; they are on the path to becoming heroes. Focus on creating backstories that plant seeds for future adventures, rather than ones where your character has already achieved greatness. Try not to come to the table with concrete notions about a character. The best characters are created within the context of a party.\nFitting the Tone: Your character should fit the theme of the campaign. If we’re playing a gritty, combat-heavy game, a pacifist may not work. If the game is about exploration, make sure your character is ready to explore.\nParty Dynamics: We are playing games with a party, not individuals. Try to make a character that is interesting to you and fits in with the party. One way of doing this is making sure that your characters has a strong connection to at least one other character in the party.\n&#039;Evil&#039; Characters: If you’re playing a morally gray character, ensure there is something that keeps you tied to the party. Conflicts within the party are fine if they create story opportunities but avoid actions that ruin the game for other players. And don&#039;t be surprised that actions have consequences. Murder hobos become the target for another party&#039;s quest.\n\nRespecting the Mood\nMood is everything! Respecting the tone and mood of the game is important. Avoid breaking tension or stepping outside the genre we’ve agreed upon. For example:\n\nCracking jokes during an emotional scene can spoil the immersion.\nRefusing to engage with core themes, such as exploration or combat, might disrupt the game.\n\n\nEven hobbits go on adventures!\n\nWe’re here to build a story together, and maintaining the right tone helps everyone stay immersed.\nHouse Rules and Rule of Cool\nI follow the Rule of Cool—the story always comes before the rules. While we’ll try to follow the game system&#039;s rule, if strict rule-following slows down the game or takes away from the story, we’ll prioritize the narrative.\n\nHouse Rules: These are generally aimed at speeding up gameplay or making things run smoother. For example, detailed combat rules might be simplified to keep the story moving.\nRules Lawyers: If you enjoy debating game mechanics, my games may not be the best fit for you. I prefer to focus on storytelling and improvisation. If you must debate the rules, with people that enjoy that type of thing, do so AFTER the session.\n\nImprovisation and Player Agency\nMy games involve a lot of improvisation. Your actions will heavily influence the story’s direction, and major events will only occur if the antagonists can counter your actions. It’s entirely possible for you to derail or even prevent major, planned events through clever choices. I write stories based on plans and locations, not end goals. So if you are looking to &#039;win&#039; a story then I am not the storyteller for you.\n\nModules are inspiration, not recipes!\n\nCreativity is always rewarded, even if the payoff isn’t immediate. Feel free to try unconventional actions—negotiating with an enemy, coming up with new uses for spells, or devising clever solutions to problems. While not every move will work as intended, it will always shape the story in meaningful ways.\nUnless planned for during session zero, not every encounter is balanced. Sometimes the best choice is to not engage.\nPlayer Preparation\nTo help keep the story flowing, here are a few tips:\n\nBe Attentive: Stay engaged with the game, listen to other players, and make notes if needed.\nReview Between Sessions: Before each session, review your notes to refresh yourself on the story and prepare for what’s ahead.\nStay Curious: Keep your character curious and involved in the world—ask questions, explore, and look for ways to engage with the narrative.\n\nSafety Tools\nGiven the mature themes often present in my games, player safety is a top priority. I use tools such as the &#039;X&#039; card and consent flowers to ensure everyone feels comfortable.\n\n\nSession Zero: we will establish the comfort levels for different topics. This is a proactive step to ensure that everyone is playing the game we want to play. You have to speak up for your preferences to be respected.\n\nLines &amp; Veils: Lines are hard limits that you do not want to see in the game, veils are things that can come up but you do not wish to have it in the spot light. These limits can apply differently for PCs and NPCs. It might be a hard limit, a line, for the PCs to commit murder, but not for an evil NPCs (thus giving a reason for the players to stop them!).\n\n\n\nX Card: If at any time you feel uncomfortable with the content, you can tap the X card to indicate we need to stop and change the topic immediately. It’s a disruption, but your safety is more important than the flow of the game.\n\n\nConsent &#039;Flowers&#039;: A more subtle tool, consent flowers let you indicate your comfort level with the game in a non-verbal manner. Items will be provided that can be place in front of you in order to communicate your current comfort level.\n\nGreen: You’re fine, keep going.\nYellow: Proceed with caution.\nRed: Please change the subject or theme.\n\n\n\nConsent Flowers can be thought of as precursors to the X card.\nIf possible, try to raise concerns during Session Zero. It helps me tailor the game, and it gives you the ability to consent to the story’s direction.\nAlways assume that people are acting in good faith. Most people do not want to harm someone else; mistakes can happen. The best solution is always open and proactive communication. Everyone at the table is human and misunderstandings can happen. So it is on each person to help your fellow table-mates if they begin to stray from the agreed upon limits.\nCommon Topics to Discuss\nFrom www.dramadice.com/gm-tips/safety-tools-for-tabletop-rpgs/\nFrequently &#039;Lined&#039; Topics:\n\nSexualized violence\nChild abuse\nAnimal cruelty\n\nFrequently &#039;Veiled&#039; Topics:\n\nRacism\nDiscrimination against minorities\nSexuality in general\nTorture\nSpiders\nSnakes\nClowns\nDentists\nSerious illnesses\nSexism\nSuicide\n\nThis should be a starting point for the conversation, not definitive check list. I will give my list at the end.\nThemes and Boundaries\nThere are many topics that I do not care to hear about in real life; harm to marginalized groups, women, children, violence, religion, etc. However, in dramatic stories these topic frequently arise. This is true even for darker topics within the context of villains or evil NPCs. My hope is that players will act as the force to oppose these actions. But these are my preferences.\nFor backstories, especially in horror games, it’s okay to explore darker themes. Just be mindful of other players’ boundaries and the tone we’ve established. (Another reason not to come to the table with preconceived ideas about your characters.)\nConflict Resolution\n\n\nIn-Character Conflict: Conflict between characters can add to the story, but it should serve the narrative and not disrupt the group dynamic. Always consider how your character’s actions impact the party. Don&#039;t be that person. If it is &#039;what your character would do&#039; then maybe that character doesn&#039;t fit the party.\n\n\nOut-of-Character Conflict: I prefer not to get involved in out-of-character disputes unless I’m directly involved. I’m a storyteller, not a mediator. If conflicts arise, try to resolve them respectfully among yourselves.\n\n\nRole-Playing\nIn my games, immersive role-playing is encouraged. Try to avoid saying “my character does X” or “my character says Y.” Instead, speak and act as your character. You don’t need to be a professional actor, but embracing the role will enhance the experience for everyone.\nPlayer Respect\nWhile our characters may clash and NPCs may engage in morally questionable behavior, it’s essential that players treat each other with respect. Regardless of the actions within the game, I expect players to:\n\nRespect each other’s beliefs and views without pushing them onto others.\nCreate a welcoming environment where no player feels insulted, ignored, bullied, or made uncomfortable.\n\nDisagreements about in-game decisions are natural, but they should never escalate into personal attacks. If an issue arises that makes you uncomfortable, please let me or another player know so we can address it.\nWe’re here to create a fun and immersive experience together, and that starts with mutual respect at the table.\nCommunication\nIf you need to reach me outside of the game, feel free to contact me via Discord or email. I’m always open to hearing feedback, answering questions, or discussing any concerns you might have.\nWarnings About My Style\n\nIn real life, most people do not view themselves as &#039;bad&#039;... even when they are demonstrably acting that way. People are great at rationalizing their actions. Many of my villains do that too! So morally gray NPCs are common.\nImprov is big part of my style. I love seeing the story we make together. That does mean I tend to forget things like minor NPCs names that were made up on the spot. Player notes help players and storytellers alike!\nI like to start each session with a player recapping the last session. This allows me to see things from the other side. If I didn&#039;t explain something well, or a clue was missed, or some action is taking on more importance in the players&#039; minds then was intended, this helps me see that.\nI like long running stories where one event bleeds into the next. So it is a challenge for me to do things episodically. I can do it, it just goes against my nature.\nI have told stories for over 40 years. That means I have 40 years of bad habits, not that I know more than someone else. I am still surprised most times I sit down to play.\nI am here to have fun. I hope you are too. We work together to make sure every reaches this goal.\n\nMy List of Lines and Veils\nI am very flexible on my list. Within the context of a good story I can move a line to a veil and ignore a veil altogether. But as a starting point here is my list:\nLines\n\nGraphic roleplaying of taboo topics such a torture, abuse of minors, and sexuality between PCs\n\nI am very sex positive but I don&#039;t wish to be engaged in PCs erotica. If it comes up in a story, state the minimum and move on. Violence happens in a game, state the minimum and move on. Full on role-playing out such acts is a line for me.\n\n\nAudio/Visual of people in pain or abused, especially children\n\nIn a story I can handle dark topics but I do not care to see or hear such things. This includes in audio props or visuals produced as props.\n\n\n\nVeils\n\nGratuitous violence without a story reason\nAbuse of minors or the non-consenting\nManipulation for the &#039;fun of it&#039;\n\nBad guys do bad things, got it. Sometimes the details are needed for a clue but let&#039;s keep even that to a minimum.\n\n\n"},"Niisii/Intro-Niisii":{"title":"The World Of Niisii","links":[],"tags":["TTRPG","Fantasy"],"content":"What was and what will be Niisii?\nNiisii is the world I have spend the most time on, and know the least about. This is because it started as one thing; something good. And that good thing got morphed into something else. This new thing was good but it was never &#039;right&#039;. It was forced into being something it was not supposed to be. And because it wasn&#039;t fit for this new purpose it broke.\nLet me explain.\nNo, there is too much. Let me sum up.\nNiisii was built at the request of a group of adult friends who gamed. This group of friends engaged in alternative lifestyles and activities. They a small request. &quot;Could we make a world where heteronormality and monogamy were NOT the default setting?&quot;\nMy answer was Niisii.\nSexuality, like in the real world, was a driving force in the world. The game was not erotic, but it was mature. The themes were heavy and tried to be thoughtful. The quests had more to do with human desire and fault (regardless of the species) than McGuffins and loot.\nStories were told, laughs were bellowed and tears were shed.\nThe DM was doing his job.\nBut as it happens, within the group there was a tiff. Someone in the group felt slighted and the games stopped because we all felt bad. And like that, Niisii was put on a shelf.\n\nFast forward\nYears and passed and a new group of friend have formed. And they wanted a homebrew world to play in. FR is fun and all but ....\n&#039;Sure! When do you want to start playing?&#039;\nTonight!\nOk, it was a few days later. But with work and life, what difference was 30-40 hours going to make.\nSo I dusted off an old friend and unlikely heroes went off to find a missing librarian.\nNiisii was always built to support multiple DMs; a measure of design went into the world so that different people had their own &#039;corners&#039; of the world with just enough connections to make it feel &#039;whole&#039;. So, for this group, I found an area where the lore was ignored and started to tell stories appropriate to this group.\nAnd then it grew.\nSlowly, what made Niisii, Niisii was being pushed out in favor of &#039;generica&#039;. Every race had to make an appearance, the world was always coming to the end, and no one wanted to go questing for love or vanity.\nAnother +5 sword would do just nicely thank you.\nAnd of course, whatever came out in the latest book by WotC had to be rolled in.\nStories were told, laughs were bellowed and tears were shed.\nThe DM was doing his job. :-D\nAnd not just the starting DM. Other DMs joined. And they told their stories too.\nAnd each story moved the world further away from its flavor. Mechanics, lore, limitations and options were stripped to make room for the latest suppliment.\nSure, there were are few that wanted see what this &#039;old&#039; Niisii was like but what do you mean my elf would live as long as my current 5e character?\nNiisii was generic.\nDon&#039;t get me wrong, we had a lot of fun in this world. Hundreds of years of history, epic stories, and games where, no exaggeration, over 20 people playing together in person (remember that!) just share in the stories.\nTo be fair that was only two or three times.\n....the average game night was over 12.\nAnd the games happened multiple times a week.\nEpic\nBut it wasn&#039;t Niisii.\nIt wasn&#039;t a world built where a group of lovely, good hearted perverts, could tell stories of love and betrayal. All in a world where they weren&#039;t the freaks. Where they weren&#039;t the ones who had to hide who or how they loved. Where they had representation. Their lore and stories were ... different. And when their lore got in the way, it was erased. Not added to. Erased.\nBut with that said, it was not the games played in Niisii, nor the people who played them, that was the problem.\nIt was me.\nI led people into this wonderful garden of joy. They didn&#039;t want to be there. They just wanted to play games. And if this was the world they had, well they would make a home for themselves here. They plowed the ground so they could plant their seeds. They did the right thing for them.\nIf I hadn&#039;t of been lazy, I would have made a world fit for them. It would have been something... sturdy. Every garden can be full of joy and no better than another. Just grow the garden that fits you!\nAs it is, Niisii lays in shambles. It doesn&#039;t &#039;feel&#039; right anymore; at least not to its father.\nAm I teary eyed sometimes about a make believe world?\nYeah.\nNo.\nNo, not for the world. For the why, and the who, it was made for.\nWill I &#039;fix&#039; Niisii someday?\nI don&#039;t know. I doubt it. But I am often wrong.\nWhat I do know is that maybe I&#039;m beginning to learn a lesson. Knowing when to build new gardens and when to tend the old ones is something I hope to get good at in the next 100-200 years. :-)\nThen why is this here?\nTo remind me of my mantra.\nDon&#039;t be lazy Randy"},"Terra-Mortuum/Intro-Terra":{"title":"The World of Terra Mortuum","links":[],"tags":["TTRPG","Fantasy"],"content":"&quot;You had to go and learn for yourself, didn&#039;t you?&quot;\nA look of anger, panic and fear each fought to control his mother&#039;s face as she moved the hair from his ashen brow. Dobbin had seen each of these emotions overtake her before. His mother was nothing if not... excitable. OK, she was a lot excitable. But there was always some subtle tell; some sly hint that she wasn&#039;t truly angry or panicked or afraid. He always thought that she just liked making a scene. The over-the-top warnings, her cries of feigned fear when he got in a fight and her sobs over the dangers her &#039;stupid baby boy&#039; faced in his trades was just her excuse to be heard.\nThis was different. There was no cocked smile or quick wink now. There was only raw emotion.\nTime passed but he could not tell how long. As the young man&#039;s hands began to stiffen, and his vision clouded, he could just make out the tears that flowed down her face as she stood from where she was kneeling by his bed. She left his room quickly. As he tried to call out to her, tried to say he was sorry, only a wet grumble came from his throat. A mass fell from his mouth and his face began to twitch uncontrollably.\nHe was so cold. Cold and starving.\n\nA lifetime later she returned. The raw emotion replaced with cold, sterile, determination. In one hand she held the family&#039;s felling axe. In the other, the Beams of God that usually stayed above the hearth.\nAs she knelt once more by his bed, she whispered.\n&quot;I am so sorry baby.&quot;\nShe choked back the tears and continued.\n&quot;How many tales did we tell you? How many warnings to stay out of the Northern Fields? We didn’t do enough.&quot;\nThe battle with her emotions was taking a turn as her words began to take on the wet, fluid sound of uncontrollable loss.\nIt was then that Dobbin realized he had been holding his breath. As he tried to fill his lungs with air he found no heady relief; no soothing of the burning in his chest.\nHis eyes went wide as his heart began to slow.\nHis muscles started to twitch and break the bones of his toes.\nHis ears felt like they have been stuffed full of dandelion seeds.\nShe never let go of the hand of his hand. Even as the flesh pulled away from his nail bed and his convulsions tore through him with enough strength to break her little finger she held fast. She had failed him before. The least she could do now was to be with him while he was still … her baby.\nAnd then it stopped.\nLike a candle snuffed out, the boy... the human … died. She freed her damaged hand and stood.\nIn her good hand she reached down and cradled the Beams of God and tried to remember the ‘Prayer of the Good Death’. Slowly the words came to mind.\n&quot;O Spirit, As Dobbin journeys through the Sheltered Route&#039;s serene domain, Let him find rest from his mortal travels.&quot;\nAs she started, so too did the transformation. The human had left and the gravling was arriving much sooner than expected. He had spent too long in their domain. The days she had hoped the family had to mourn was quickly turning into minutes of terror.\n&quot;Gu-Gu-Guarded him from the clutches of a sleepless second life, so his soul may bask in the dreams of everlasting night.&quot;\nNever letting the sign of her family&#039;s faith slip from her good hand, she took up the axe in her broken one...just in case her prayer wasn&#039;t enough.\n&quot;In the Sheltered Route&#039;s Haven, let my little boy find reprieve,&quot;\nAs the broken shell of her only son started to rise, she thought of her daughters. The pain in her hand as she gripped the handle for the blow made the last line tear from her mouth like storm.\n&quot;Where eternal rest he shall achieve.&quot;"},"index":{"title":"'That' Randy's Stuff","links":["Terra-Mortuum/Intro-Terra","Caroline-College/Intro-Caroline","Gaming-Thoughts/How-I-Play"],"tags":[],"content":"\nf you were looking for me, congratulations YOU WON. If you weren&#039;t looing for me I have to wonder why you are here. Are lost? Do you need a grown-up to help you get home? I&#039;ll try to help but I gave up being a grown up a long time ago. I&#039;m just an old man that likes to play games, make mediocre music and working on being a better person today than I was yesterday.\nWhat you will find here are links to my\n\nTTRPG gaming campaigns I tell stories in\n\nI am a proud member of the Forever DM club, and I like it that way\nYou will find some information about my two current worlds\n\nTerra Mortuum: A grim dark fantasy game about a future after a horrible mistake was made.\nCaroline College: Welcome to Wisconsin. The year is 1983, the metal is loud and all the things go bump in the night.\n\n\nAnd you&#039;ll find a little bit about how I play here . Not everyone is a good gaming match with everyone else and that&#039;s ok. Before I waste your time, see if we might vibe. Don&#039;t worry, I&#039;m flexible.\n\n\nMusic I Make\n\nI do not claim to be good. I make music for me and those who want to play with me. \n\n\nPhotographs I make\n\nI don&#039;t take pictures as often as I used to but I still love the craft.\n\n\n\nFinally I guess a bit about me isn&#039;t a bad thing to add.\n\nI&#039;m happily married to my high school sweetheart. Its been over 3 decades now and I&#039;m still enamored with her.\nI have three grown children. Two I helped make, a son and a daughter, one who I gained when she married my son.\nI write mathy-optimizey-codey-things for a living\n\nDon&#039;t worry, I&#039;m a trained professional and can use these types of professional terms safely.\n\n\nI&#039;m very liberal. And believe in love, peace, equality, sex positivity, education, reason and joy for all.\n\n"}}